{
  "version": "https://jsonfeed.org/version/1",
  "icon": "https://www.trackawesomelist.com/icon.png",
  "favicon": "https://www.trackawesomelist.com/favicon.ico",
  "language": "en",
  "title": "Awesome List Updates on May 12, 2023",
  "_site_title": "Track Awesome List",
  "description": "10 awesome lists updated today.",
  "_seo_title": "Awesome List Updates on May 12, 2023 - Track Awesome List",
  "feed_url": "https://www.trackawesomelist.com/feed.json",
  "home_page_url": "https://www.trackawesomelist.com",
  "items": [
    {
      "id": "https://www.trackawesomelist.com/stn1slv/awesome-integration/",
      "title": "Awesome Integration",
      "_slug": "stn1slv/awesome-integration/",
      "_filepath": "/content/stn1slv/awesome-integration/README.md",
      "url": "https://www.trackawesomelist.com/stn1slv/awesome-integration/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Resources / Certifications\n\n*   [Associate Administrator Certification](https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIKWA2\\&ltui__urlRedirect=learning-plan-detail-standard) - Validates an individual's foundational knowledge and skills in managing and administering the Boomi platform, focusing on platform monitoring, troubleshooting, and security.\n*   [Associate Developer Certification](https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIeWAM\\&ltui__urlRedirect=learning-plan-detail-standard) - Demonstrates a candidate's basic understanding of building and deploying integration processes using the Boomi platform, including design patterns, deployment, and error handling.\n*   [Associate EDI for X12 Certification](https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIFWA2\\&ltui__urlRedirect=learning-plan-detail-standard) - Validates an individual's proficiency in using Boomi to design, develop, and manage Electronic Data Interchange (EDI) integrations with the X12 standard, covering essential concepts like EDI document structure and trading partner management.\n*   [Associate Flow Essentials Certification](https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIZWA2\\&ltui__urlRedirect=learning-plan-detail-standard) - Showcases a candidate's knowledge of creating and managing business applications using Boomi Flow, with emphasis on workflow design, user interfaces, and data integration.\n*   [Associate Master Data Hub Certification](https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIPWA2\\&ltui__urlRedirect=learning-plan-detail-standard) - Highlights a candidate's understanding of using the Boomi Master Data Hub to ensure data quality and consistency across systems, focusing on data modeling, governance, and synchronization.\n*   [Development and Application Architecture Certification](https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OJOWA2\\&ltui__urlRedirect=learning-plan-detail-standard) - Confirms an individual's expertise in designing and implementing complex integration solutions and application architectures on the Boomi platform, including best practices and performance optimization.\n*   [Professional API Design Certification](https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OKzWAM\\&ltui__urlRedirect=learning-plan-detail-standard) - Demonstrates a candidate's ability to design, develop, and manage APIs using Boomi, including RESTful API principles, API security, and versioning.\n*   [Professional API Management Certification](https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIyWAM\\&ltui__urlRedirect=learning-plan-detail-standard) - Validates an individual's expertise in managing the full lifecycle of APIs using the Boomi platform, including API deployment, monitoring, and analytics.\n*   [Professional Developer Certification](https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OJrWAM\\&ltui__urlRedirect=learning-plan-detail-standard) - Recognizes a candidate's in-depth knowledge and skills in developing, deploying, and managing integration processes using Boomi, with emphasis on advanced data transformation and error handling techniques.\n*   [Professional Flow Developer Certification](https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIUWA2\\&ltui__urlRedirect=learning-plan-detail-standard) - Showcases an individual's advanced capabilities in designing, developing, and managing business applications using Boomi Flow, including complex workflow design, custom UI components, and integration with external systems.\n*   [Professional Linux Operational Administrator Certification](https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OI5WAM\\&ltui__urlRedirect=learning-plan-detail-standard) - Confirms a candidate's proficiency in managing and administering Boomi on Linux systems, covering topics such as system installation, configuration, security, and performance optimization.\n*   [Professional Windows Operational Administrator Certification](https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIAWA2\\&ltui__urlRedirect=learning-plan-detail-standard) - Validates an individual's expertise in managing and administering Boomi on Windows systems, focusing on system installation, configuration, security, and performance optimization.\n*   [IBM Certified Solution Developer – App Connect Enterprise V11](https://www.ibm.com/training/certification/C0003107#exam) - Validate your intermediate-level knowledge and experience to develop, deploy, tune, and support platform-independent message flow applications using IBM App Connect V11.0.\n*   [IBM Certified Solution Implementer – API Connect v10.0.3](https://www.ibm.com/training/certification/C0002604#exam) - Demonstrate your intermediate-level knowledge and skills to develop, publish, configure, and manage APIs using IBM API Connect v10.0.3.\n*   [Event-native API Management Foundations](https://gravitee.getlearnworlds.com/course/gravitee-event-native-api-management-foundations) - Basics of Event-native API Management.\n*   [Event-native API Management Professional](https://gravitee.getlearnworlds.com/course/gravitee-enap-certification) - Focuses on some more advanced API Management concepts, plus foundational knowledge around how to use Gravitee API Management.\n*   [Kong Gateway Certified Associate](https://konghq.com/academy/exam-preparation) - Validate your entry-level knowledge and skills on Kong Gateway for developers, DevOps, and architects.\n*   [MuleSoft Certified Developer - Level 1](https://training.mulesoft.com/certification/developer-mule4-level1) - Validate your knowledge and skills to design, build, test and debug, deploy, and manage basic APIs and integrations using MuleSoft.\n*   [MuleSoft Certified Developer - Level 2](https://training.mulesoft.com/certification/developer-mule4-level2) - Validate your ability to work on production-ready Mule applications that address and balance critical non-functional requirements including monitoring, performance, maintainability, reliability, and security.\n*   [MuleSoft Certified Integration Architect - Level 1](https://training.mulesoft.com/certification/architect-integration-level1) - Validate your knowledge and skills to translate functional and non-functional requirements into integration interfaces and implementations.\n*   [MuleSoft Certified Platform Architect - Level 1](https://training.mulesoft.com/certification/architect-platform-level1) - Validate your knowledge and skills to direct the emergence of an effective application network out of individual integration solutions following API-led connectivity across an organization using Anypoint Platform.\n*   [Oracle Business Process Management Suite 12c Certified Implementation Specialist](https://education.oracle.com/oracle-business-process-management-suite-12c-essentials/pexam_1Z0-435) - Validate your expertise in implementing Oracle BPM Suite 12c solution.\n*   [Oracle Data Integrator 12c Certified Implementation Specialist](https://education.oracle.com/oracle-data-integrator-12c-certified-implementation-specialist/trackp_379) - Validate your expertise in selling or implementing Oracle Data Integration 12c solutions.\n*   [Oracle SOA Suite 12c Certified Implementation Specialist](https://education.oracle.com/oracle-soa-suite-12c-essentials/pexam_1Z0-434) - Validate your expertise in implementing solutions based on Oracle SOA Suite 12c.\n*   [Red Hat Certified Specialist in API Management](https://www.redhat.com/en/services/certification/red-hat-certified-specialist-api-management) - Validates the ability to create and maintain enterprise APIs using the Red Hat 3scale API Management platform.\n*   [Red Hat Certified Specialist in Business Rules](https://www.redhat.com/en/services/certification/rhcs-business-rules) - Checks the knowledge, skills, and abilities needed to perform tasks involving the implementation and management of business logic using the Red Hat JBoss BRMS.\n*   [Red Hat Certified Specialist in Cloud-native Integration](https://www.redhat.com/en/services/certification/rhcs-cloud-native-integration) - Validates the ability to create and maintain enterprise integration services based on Red Hat Fuse, Camel, and APIs.\n*   [Red Hat Certified Specialist in Event-Driven Development with Kafka](https://www.redhat.com/en/services/certification/red-hat-certified-specialist-event-driven-development-kafka) - Validates the ability to develop applications using Apache Kafka and Apache Kafka Streams.\n*   [SnapLogic Administrator Certification](https://learn.snaplogic.com/snaplogic-administrator-certification) - Assesses your ability to handle administrative tasks for SnapLogic instances.\n*   [SnapLogic Architect Certification](https://learn.snaplogic.com/snaplogic-architect-certification) - Evaluates your knowledge of integration reference architectures and key strategies for the SnapLogic platform, covering topics like SnapLogic Architecture, Snaplex Requirements, Pipeline Lifecycle Management, Advanced Data Transformations, API Management, Resumable Pipelines, and Best Practices.\n*   [SnapLogic Developer Certification](https://learn.snaplogic.com/snaplogic-developer-certification) - Testing your expertise in using the SnapLogic SDK, implementing different parts of Snap functionality, and building custom Snaps.\n*   [SnapLogic Integrator Certification](https://learn.snaplogic.com/snaplogic-integrator-certification-1) - Focuses on topics such as beginner training, ultra tasks, pipeline migration, and user assistance videos covering various integration endpoints.",
      "content_html": "<h3><p>Resources / Certifications</p>\n</h3><ul>\n<li><a href=\"https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIKWA2&amp;ltui__urlRedirect=learning-plan-detail-standard\" rel=\"noopener noreferrer\">Associate Administrator Certification</a> - Validates an individual's foundational knowledge and skills in managing and administering the Boomi platform, focusing on platform monitoring, troubleshooting, and security.</li>\n</ul>\n<ul>\n<li><a href=\"https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIeWAM&amp;ltui__urlRedirect=learning-plan-detail-standard\" rel=\"noopener noreferrer\">Associate Developer Certification</a> - Demonstrates a candidate's basic understanding of building and deploying integration processes using the Boomi platform, including design patterns, deployment, and error handling.</li>\n</ul>\n<ul>\n<li><a href=\"https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIFWA2&amp;ltui__urlRedirect=learning-plan-detail-standard\" rel=\"noopener noreferrer\">Associate EDI for X12 Certification</a> - Validates an individual's proficiency in using Boomi to design, develop, and manage Electronic Data Interchange (EDI) integrations with the X12 standard, covering essential concepts like EDI document structure and trading partner management.</li>\n</ul>\n<ul>\n<li><a href=\"https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIZWA2&amp;ltui__urlRedirect=learning-plan-detail-standard\" rel=\"noopener noreferrer\">Associate Flow Essentials Certification</a> - Showcases a candidate's knowledge of creating and managing business applications using Boomi Flow, with emphasis on workflow design, user interfaces, and data integration.</li>\n</ul>\n<ul>\n<li><a href=\"https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIPWA2&amp;ltui__urlRedirect=learning-plan-detail-standard\" rel=\"noopener noreferrer\">Associate Master Data Hub Certification</a> - Highlights a candidate's understanding of using the Boomi Master Data Hub to ensure data quality and consistency across systems, focusing on data modeling, governance, and synchronization.</li>\n</ul>\n<ul>\n<li><a href=\"https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OJOWA2&amp;ltui__urlRedirect=learning-plan-detail-standard\" rel=\"noopener noreferrer\">Development and Application Architecture Certification</a> - Confirms an individual's expertise in designing and implementing complex integration solutions and application architectures on the Boomi platform, including best practices and performance optimization.</li>\n</ul>\n<ul>\n<li><a href=\"https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OKzWAM&amp;ltui__urlRedirect=learning-plan-detail-standard\" rel=\"noopener noreferrer\">Professional API Design Certification</a> - Demonstrates a candidate's ability to design, develop, and manage APIs using Boomi, including RESTful API principles, API security, and versioning.</li>\n</ul>\n<ul>\n<li><a href=\"https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIyWAM&amp;ltui__urlRedirect=learning-plan-detail-standard\" rel=\"noopener noreferrer\">Professional API Management Certification</a> - Validates an individual's expertise in managing the full lifecycle of APIs using the Boomi platform, including API deployment, monitoring, and analytics.</li>\n</ul>\n<ul>\n<li><a href=\"https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OJrWAM&amp;ltui__urlRedirect=learning-plan-detail-standard\" rel=\"noopener noreferrer\">Professional Developer Certification</a> - Recognizes a candidate's in-depth knowledge and skills in developing, deploying, and managing integration processes using Boomi, with emphasis on advanced data transformation and error handling techniques.</li>\n</ul>\n<ul>\n<li><a href=\"https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIUWA2&amp;ltui__urlRedirect=learning-plan-detail-standard\" rel=\"noopener noreferrer\">Professional Flow Developer Certification</a> - Showcases an individual's advanced capabilities in designing, developing, and managing business applications using Boomi Flow, including complex workflow design, custom UI components, and integration with external systems.</li>\n</ul>\n<ul>\n<li><a href=\"https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OI5WAM&amp;ltui__urlRedirect=learning-plan-detail-standard\" rel=\"noopener noreferrer\">Professional Linux Operational Administrator Certification</a> - Confirms a candidate's proficiency in managing and administering Boomi on Linux systems, covering topics such as system installation, configuration, security, and performance optimization.</li>\n</ul>\n<ul>\n<li><a href=\"https://community.boomi.com/s/learning-plan-detail-standard?ltui__urlRecordId=aOM6S0000008OIAWA2&amp;ltui__urlRedirect=learning-plan-detail-standard\" rel=\"noopener noreferrer\">Professional Windows Operational Administrator Certification</a> - Validates an individual's expertise in managing and administering Boomi on Windows systems, focusing on system installation, configuration, security, and performance optimization.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/training/certification/C0003107#exam\" rel=\"noopener noreferrer\">IBM Certified Solution Developer – App Connect Enterprise V11</a> - Validate your intermediate-level knowledge and experience to develop, deploy, tune, and support platform-independent message flow applications using IBM App Connect V11.0.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/training/certification/C0002604#exam\" rel=\"noopener noreferrer\">IBM Certified Solution Implementer – API Connect v10.0.3</a> - Demonstrate your intermediate-level knowledge and skills to develop, publish, configure, and manage APIs using IBM API Connect v10.0.3.</li>\n</ul>\n<ul>\n<li><a href=\"https://gravitee.getlearnworlds.com/course/gravitee-event-native-api-management-foundations\" rel=\"noopener noreferrer\">Event-native API Management Foundations</a> - Basics of Event-native API Management.</li>\n</ul>\n<ul>\n<li><a href=\"https://gravitee.getlearnworlds.com/course/gravitee-enap-certification\" rel=\"noopener noreferrer\">Event-native API Management Professional</a> - Focuses on some more advanced API Management concepts, plus foundational knowledge around how to use Gravitee API Management.</li>\n</ul>\n<ul>\n<li><a href=\"https://konghq.com/academy/exam-preparation\" rel=\"noopener noreferrer\">Kong Gateway Certified Associate</a> - Validate your entry-level knowledge and skills on Kong Gateway for developers, DevOps, and architects.</li>\n</ul>\n<ul>\n<li><a href=\"https://training.mulesoft.com/certification/developer-mule4-level1\" rel=\"noopener noreferrer\">MuleSoft Certified Developer - Level 1</a> - Validate your knowledge and skills to design, build, test and debug, deploy, and manage basic APIs and integrations using MuleSoft.</li>\n</ul>\n<ul>\n<li><a href=\"https://training.mulesoft.com/certification/developer-mule4-level2\" rel=\"noopener noreferrer\">MuleSoft Certified Developer - Level 2</a> - Validate your ability to work on production-ready Mule applications that address and balance critical non-functional requirements including monitoring, performance, maintainability, reliability, and security.</li>\n</ul>\n<ul>\n<li><a href=\"https://training.mulesoft.com/certification/architect-integration-level1\" rel=\"noopener noreferrer\">MuleSoft Certified Integration Architect - Level 1</a> - Validate your knowledge and skills to translate functional and non-functional requirements into integration interfaces and implementations.</li>\n</ul>\n<ul>\n<li><a href=\"https://training.mulesoft.com/certification/architect-platform-level1\" rel=\"noopener noreferrer\">MuleSoft Certified Platform Architect - Level 1</a> - Validate your knowledge and skills to direct the emergence of an effective application network out of individual integration solutions following API-led connectivity across an organization using Anypoint Platform.</li>\n</ul>\n<ul>\n<li><a href=\"https://education.oracle.com/oracle-business-process-management-suite-12c-essentials/pexam_1Z0-435\" rel=\"noopener noreferrer\">Oracle Business Process Management Suite 12c Certified Implementation Specialist</a> - Validate your expertise in implementing Oracle BPM Suite 12c solution.</li>\n</ul>\n<ul>\n<li><a href=\"https://education.oracle.com/oracle-data-integrator-12c-certified-implementation-specialist/trackp_379\" rel=\"noopener noreferrer\">Oracle Data Integrator 12c Certified Implementation Specialist</a> - Validate your expertise in selling or implementing Oracle Data Integration 12c solutions.</li>\n</ul>\n<ul>\n<li><a href=\"https://education.oracle.com/oracle-soa-suite-12c-essentials/pexam_1Z0-434\" rel=\"noopener noreferrer\">Oracle SOA Suite 12c Certified Implementation Specialist</a> - Validate your expertise in implementing solutions based on Oracle SOA Suite 12c.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.redhat.com/en/services/certification/red-hat-certified-specialist-api-management\" rel=\"noopener noreferrer\">Red Hat Certified Specialist in API Management</a> - Validates the ability to create and maintain enterprise APIs using the Red Hat 3scale API Management platform.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.redhat.com/en/services/certification/rhcs-business-rules\" rel=\"noopener noreferrer\">Red Hat Certified Specialist in Business Rules</a> - Checks the knowledge, skills, and abilities needed to perform tasks involving the implementation and management of business logic using the Red Hat JBoss BRMS.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.redhat.com/en/services/certification/rhcs-cloud-native-integration\" rel=\"noopener noreferrer\">Red Hat Certified Specialist in Cloud-native Integration</a> - Validates the ability to create and maintain enterprise integration services based on Red Hat Fuse, Camel, and APIs.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.redhat.com/en/services/certification/red-hat-certified-specialist-event-driven-development-kafka\" rel=\"noopener noreferrer\">Red Hat Certified Specialist in Event-Driven Development with Kafka</a> - Validates the ability to develop applications using Apache Kafka and Apache Kafka Streams.</li>\n</ul>\n<ul>\n<li><a href=\"https://learn.snaplogic.com/snaplogic-administrator-certification\" rel=\"noopener noreferrer\">SnapLogic Administrator Certification</a> - Assesses your ability to handle administrative tasks for SnapLogic instances.</li>\n</ul>\n<ul>\n<li><a href=\"https://learn.snaplogic.com/snaplogic-architect-certification\" rel=\"noopener noreferrer\">SnapLogic Architect Certification</a> - Evaluates your knowledge of integration reference architectures and key strategies for the SnapLogic platform, covering topics like SnapLogic Architecture, Snaplex Requirements, Pipeline Lifecycle Management, Advanced Data Transformations, API Management, Resumable Pipelines, and Best Practices.</li>\n</ul>\n<ul>\n<li><a href=\"https://learn.snaplogic.com/snaplogic-developer-certification\" rel=\"noopener noreferrer\">SnapLogic Developer Certification</a> - Testing your expertise in using the SnapLogic SDK, implementing different parts of Snap functionality, and building custom Snaps.</li>\n</ul>\n<ul>\n<li><a href=\"https://learn.snaplogic.com/snaplogic-integrator-certification-1\" rel=\"noopener noreferrer\">SnapLogic Integrator Certification</a> - Focuses on topics such as beginner training, ultra tasks, pipeline migration, and user assistance videos covering various integration endpoints.</li>\n</ul>\n",
      "date_published": "2023-05-12T15:32:22.000Z",
      "date_modified": "2023-05-12T15:32:22.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/unicodeveloper/awesome-nextjs/",
      "title": "Awesome Nextjs",
      "_slug": "unicodeveloper/awesome-nextjs/",
      "_filepath": "/content/unicodeveloper/awesome-nextjs/README.md",
      "url": "https://www.trackawesomelist.com/unicodeveloper/awesome-nextjs/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Articles\n\n*   [Integrate Next app with Tailwind](https://tailwind-elements.com/docs/standard/integrations/next-integration/)",
      "content_html": "<h3><p>Articles</p>\n</h3><ul>\n<li><a href=\"https://tailwind-elements.com/docs/standard/integrations/next-integration/\" rel=\"noopener noreferrer\">Integrate Next app with Tailwind</a></li>\n</ul>\n",
      "date_published": "2023-05-12T10:34:56.000Z",
      "date_modified": "2023-05-12T10:34:56.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/CodyReichert/awesome-cl/",
      "title": "Awesome Cl",
      "_slug": "CodyReichert/awesome-cl/",
      "_filepath": "/content/CodyReichert/awesome-cl/README.md",
      "url": "https://www.trackawesomelist.com/CodyReichert/awesome-cl/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Others / Third-party APIs\n\n*   ⭐ [maxima](http://maxima.sourceforge.net/) - Computer Algebra System. [GNU GPL3](http://www.gnu.org/copyleft/gpl.html).\n    *   [wxMaxima](https://wxmaxima-developers.github.io/wxmaxima/): a graphical frontend.\n    *   [Maxima on Android](https://play.google.com/store/apps/details?id=jp.yhonda), built with ECL.\n    *   [Maxima on Jupyter (⭐195)](https://github.com/robert-dodier/maxima-jupyter)\n    *   \\[new, POC] [Maxima in the browser on WASM](https://maxima-on-wasm.pages.dev/), [sources](https://gitlab.com/spaghettisalat/maxima/-/tree/emscripten-port-deployed)\n    *   it can be used via [SageMath](https://www.sagemath.org/) and [KDE Cantor](https://apps.kde.org/cantor/). Of course, with Emacs: [maxima-mode](https://gitlab.com/sasanidas/maxima) ([screenshot](https://community.linuxmint.com/img/screenshots/maxima-emacs.png)) and [maxima-interface (⭐18)](https://github.com/jmbr/maxima-interface) to ease the interface between Maxima and Common Lisp.\n    *   it can be used [from a Lisp REPL](https://mahmoodsheikh36.github.io/post/20230510181916-maxima_in_lisp/).",
      "content_html": "<h3><p>Others / Third-party APIs</p>\n</h3><ul>\n<li>⭐ <a href=\"http://maxima.sourceforge.net/\" rel=\"noopener noreferrer\">maxima</a> - Computer Algebra System. <a href=\"http://www.gnu.org/copyleft/gpl.html\" rel=\"noopener noreferrer\">GNU GPL3</a>.<ul>\n<li><a href=\"https://wxmaxima-developers.github.io/wxmaxima/\" rel=\"noopener noreferrer\">wxMaxima</a>: a graphical frontend.</li>\n<li><a href=\"https://play.google.com/store/apps/details?id=jp.yhonda\" rel=\"noopener noreferrer\">Maxima on Android</a>, built with ECL.</li>\n<li><a href=\"https://github.com/robert-dodier/maxima-jupyter\" rel=\"noopener noreferrer\">Maxima on Jupyter (⭐195)</a></li>\n<li>[new, POC] <a href=\"https://maxima-on-wasm.pages.dev/\" rel=\"noopener noreferrer\">Maxima in the browser on WASM</a>, <a href=\"https://gitlab.com/spaghettisalat/maxima/-/tree/emscripten-port-deployed\" rel=\"noopener noreferrer\">sources</a></li>\n<li>it can be used via <a href=\"https://www.sagemath.org/\" rel=\"noopener noreferrer\">SageMath</a> and <a href=\"https://apps.kde.org/cantor/\" rel=\"noopener noreferrer\">KDE Cantor</a>. Of course, with Emacs: <a href=\"https://gitlab.com/sasanidas/maxima\" rel=\"noopener noreferrer\">maxima-mode</a> (<a href=\"https://community.linuxmint.com/img/screenshots/maxima-emacs.png\" rel=\"noopener noreferrer\">screenshot</a>) and <a href=\"https://github.com/jmbr/maxima-interface\" rel=\"noopener noreferrer\">maxima-interface (⭐18)</a> to ease the interface between Maxima and Common Lisp.</li>\n<li>it can be used <a href=\"https://mahmoodsheikh36.github.io/post/20230510181916-maxima_in_lisp/\" rel=\"noopener noreferrer\">from a Lisp REPL</a>.</li>\n</ul>\n</li>\n</ul>\n",
      "date_published": "2023-05-12T10:30:57.000Z",
      "date_modified": "2023-05-12T10:30:57.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/kyrolabs/awesome-langchain/",
      "title": "Awesome Langchain",
      "_slug": "kyrolabs/awesome-langchain/",
      "_filepath": "/content/kyrolabs/awesome-langchain/README.md",
      "url": "https://www.trackawesomelist.com/kyrolabs/awesome-langchain/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Open Source Projects / Other / Chatbots\n\n*   [MM ReAct (⭐953)](https://github.com/microsoft/MM-REACT): Multi Modal ReAct Design",
      "content_html": "<h3><p>Open Source Projects / Other / Chatbots</p>\n</h3><ul>\n<li><a href=\"https://github.com/microsoft/MM-REACT\" rel=\"noopener noreferrer\">MM ReAct (⭐953)</a>: Multi Modal ReAct Design</li>\n</ul>\n",
      "date_published": "2023-05-12T10:28:10.000Z",
      "date_modified": "2023-05-12T10:28:10.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/Kazhnuz/awesome-gnome/",
      "title": "Awesome Gnome",
      "_slug": "Kazhnuz/awesome-gnome/",
      "_filepath": "/content/Kazhnuz/awesome-gnome/README.md",
      "url": "https://www.trackawesomelist.com/Kazhnuz/awesome-gnome/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Development and Design\n\n*   [Escambo (⭐142)](https://github.com/CleoMenezesJr/escambo) - HTTP-based APIs test application.",
      "content_html": "<h3><p>Development and Design</p>\n</h3><ul>\n<li><a href=\"https://github.com/CleoMenezesJr/escambo\" rel=\"noopener noreferrer\">Escambo (⭐142)</a> - HTTP-based APIs test application.</li>\n</ul>\n",
      "date_published": "2023-05-12T08:31:51.000Z",
      "date_modified": "2023-05-12T08:31:51.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/ddotta/awesome-polars/",
      "title": "Awesome Polars",
      "_slug": "ddotta/awesome-polars/",
      "_filepath": "/content/ddotta/awesome-polars/README.md",
      "url": "https://www.trackawesomelist.com/ddotta/awesome-polars/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Tutorials & workshops / Miscellaneous\n\n*   [Rust Polars: Unlocking High-Performance Data Analysis — Part 1](https://towardsdatascience.com/rust-polars-unlocking-high-performance-data-analysis-part-1-ce42af370ece) - First part of an article that explores the world of Rust’s Polars and explain some basic concepts of Polars such as Series by [@wiseaidev](https://github.com/wiseaidev). Code used is available on Github [here (⭐417)](https://github.com/wiseaidev/rust-data-analysis/blob/main/3-polars-tutorial-part-1.ipynb).",
      "content_html": "<h3><p>Tutorials &amp; workshops / Miscellaneous</p>\n</h3><ul>\n<li><a href=\"https://towardsdatascience.com/rust-polars-unlocking-high-performance-data-analysis-part-1-ce42af370ece\" rel=\"noopener noreferrer\">Rust Polars: Unlocking High-Performance Data Analysis — Part 1</a> - First part of an article that explores the world of Rust’s Polars and explain some basic concepts of Polars such as Series by <a href=\"https://github.com/wiseaidev\" rel=\"noopener noreferrer\">@wiseaidev</a>. Code used is available on Github <a href=\"https://github.com/wiseaidev/rust-data-analysis/blob/main/3-polars-tutorial-part-1.ipynb\" rel=\"noopener noreferrer\">here (⭐417)</a>.</li>\n</ul>\n",
      "date_published": "2023-05-12T06:30:21.000Z",
      "date_modified": "2023-05-12T06:30:21.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/dhamaniasad/awesome-postgres/",
      "title": "Awesome Postgres",
      "_slug": "dhamaniasad/awesome-postgres/",
      "_filepath": "/content/dhamaniasad/awesome-postgres/README.md",
      "url": "https://www.trackawesomelist.com/dhamaniasad/awesome-postgres/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Contents / Extensions\n\n*   [PostgresML](https://postgresml.org/) - Machine learning and AI inside your database, including vectors, LLMs, and classic ML. Train, predict and manage the entire lifecycle of machine learning models using only SQL.",
      "content_html": "<h3><p>Contents / Extensions</p>\n</h3><ul>\n<li><a href=\"https://postgresml.org/\" rel=\"noopener noreferrer\">PostgresML</a> - Machine learning and AI inside your database, including vectors, LLMs, and classic ML. Train, predict and manage the entire lifecycle of machine learning models using only SQL.</li>\n</ul>\n",
      "date_published": "2023-05-12T05:04:21.000Z",
      "date_modified": "2023-05-12T05:04:21.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/directus-community/awesome-directus/",
      "title": "Awesome Directus",
      "_slug": "directus-community/awesome-directus/",
      "_filepath": "/content/directus-community/awesome-directus/README.md",
      "url": "https://www.trackawesomelist.com/directus-community/awesome-directus/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Extensions / Community\n\n*   [Tab Group Interface (⭐70)](https://github.com/hanneskuettner/directus-extension-group-tabs-interface) - Display groups as tab panels, as a pretty, space saving alternative to the accordion group.",
      "content_html": "<h3><p>Extensions / Community</p>\n</h3><ul>\n<li><a href=\"https://github.com/hanneskuettner/directus-extension-group-tabs-interface\" rel=\"noopener noreferrer\">Tab Group Interface (⭐70)</a> - Display groups as tab panels, as a pretty, space saving alternative to the accordion group.</li>\n</ul>\n",
      "date_published": "2023-05-12T01:23:35.000Z",
      "date_modified": "2023-05-12T01:23:35.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/georgezouq/awesome-ai-in-finance/",
      "title": "Awesome Ai in Finance",
      "_slug": "georgezouq/awesome-ai-in-finance/",
      "_filepath": "/content/georgezouq/awesome-ai-in-finance/README.md",
      "url": "https://www.trackawesomelist.com/georgezouq/awesome-ai-in-finance/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### LLMs\n\n*   [A ChatGPT trading algorithm delivered 500% returns in stock market. My breakdown on what this means for hedge funds and retail investors](https://www.reddit.com/r/ChatGPT/comments/13duech/a_chatgpt_trading_algorithm_delivered_500_returns/)",
      "content_html": "<h3><p>LLMs</p>\n</h3><ul>\n<li><a href=\"https://www.reddit.com/r/ChatGPT/comments/13duech/a_chatgpt_trading_algorithm_delivered_500_returns/\" rel=\"noopener noreferrer\">A ChatGPT trading algorithm delivered 500% returns in stock market. My breakdown on what this means for hedge funds and retail investors</a></li>\n</ul>\n",
      "date_published": "2023-05-12T00:51:17.000Z",
      "date_modified": "2023-05-12T00:51:17.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/filipecalegario/awesome-generative-deep-art/",
      "title": "Awesome Generative Deep Art",
      "_slug": "filipecalegario/awesome-generative-deep-art/",
      "_filepath": "/content/filipecalegario/awesome-generative-deep-art/README.md",
      "url": "https://www.trackawesomelist.com/filipecalegario/awesome-generative-deep-art/",
      "summary": "3 awesome projects updated",
      "content_text": "\n\n### Structure\n\n*   **Sections**: Each section represents a different Generative AI-related category (e.g., LLMs, prompt engineering, image synthesis, educational resources, etc.). The Inboxes are the more general references of a category. When a new category emerges, it becomes a specific subsection.\n*   **References within sections**: Inside each section, references are listed in reverse chronological order, with the most recent one at the top. This order signifies the ever-evolving landscape of Generative AI, keeping you up-to-date with the latest developments.\n\n### Autonomous LLM Agents / Prompt Engineering for Text-to-image\n\n*   [Fine-Tuner.ai](https://fine-tuner.ai/): no code approach to build AI agents\n*   [AI Agent Basics: Let’s Think Step By Step - by Jon Stokes](https://www.jonstokes.com/p/ai-agent-basics-lets-think-step-by)\n\n### Text-related Generative Tools / Multi-agents\n\n*   [ChatBotKit](https://chatbotkit.com/): toolkit to build AI chat bots\n*   [Boring Report](https://www.boringreport.org/): \"an app that uses AI to remove sensationalism from the news and makes it boring to read\"",
      "content_html": "<h3><p>Structure</p>\n</h3><ul>\n<li><strong>Sections</strong>: Each section represents a different Generative AI-related category (e.g., LLMs, prompt engineering, image synthesis, educational resources, etc.). The Inboxes are the more general references of a category. When a new category emerges, it becomes a specific subsection.</li>\n</ul>\n<ul>\n<li><strong>References within sections</strong>: Inside each section, references are listed in reverse chronological order, with the most recent one at the top. This order signifies the ever-evolving landscape of Generative AI, keeping you up-to-date with the latest developments.</li>\n</ul>\n<h3><p>Autonomous LLM Agents / Prompt Engineering for Text-to-image</p>\n</h3><ul>\n<li><a href=\"https://fine-tuner.ai/\" rel=\"noopener noreferrer\">Fine-Tuner.ai</a>: no code approach to build AI agents</li>\n</ul>\n<ul>\n<li><a href=\"https://www.jonstokes.com/p/ai-agent-basics-lets-think-step-by\" rel=\"noopener noreferrer\">AI Agent Basics: Let’s Think Step By Step - by Jon Stokes</a></li>\n</ul>\n<h3><p>Text-related Generative Tools / Multi-agents</p>\n</h3><ul>\n<li><a href=\"https://chatbotkit.com/\" rel=\"noopener noreferrer\">ChatBotKit</a>: toolkit to build AI chat bots</li>\n</ul>\n<ul>\n<li><a href=\"https://www.boringreport.org/\" rel=\"noopener noreferrer\">Boring Report</a>: \"an app that uses AI to remove sensationalism from the news and makes it boring to read\"</li>\n</ul>\n",
      "date_published": "2023-05-12T00:30:08.000Z",
      "date_modified": "2023-05-12T11:44:53.000Z"
    }
  ]
}
