{
  "version": "https://jsonfeed.org/version/1",
  "icon": "https://www.trackawesomelist.com/icon.png",
  "favicon": "https://www.trackawesomelist.com/favicon.ico",
  "language": "en",
  "title": "Awesome List Updates on Sep 28, 2020",
  "_site_title": "Track Awesome List",
  "description": "11 awesome lists updated today.",
  "_seo_title": "Awesome List Updates on Sep 28, 2020 - Track Awesome List",
  "feed_url": "https://www.trackawesomelist.com/feed.json",
  "home_page_url": "https://www.trackawesomelist.com",
  "items": [
    {
      "id": "https://www.trackawesomelist.com/kdeldycke/awesome-billing/",
      "title": "Awesome Billing",
      "_slug": "kdeldycke/awesome-billing/",
      "_filepath": "/content/kdeldycke/awesome-billing/README.md",
      "url": "https://www.trackawesomelist.com/kdeldycke/awesome-billing/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Invoice / Electronic invoices\n\n*   [Factur-X (⭐245)](https://github.com/akretion/factur-x) - Python library to support the e-invoicing standard for France and Germany.",
      "content_html": "<h3><p>Invoice / Electronic invoices</p>\n</h3><ul>\n<li><a href=\"https://github.com/akretion/factur-x\" rel=\"noopener noreferrer\">Factur-X (⭐245)</a> - Python library to support the e-invoicing standard for France and Germany.</li>\n</ul>\n",
      "date_published": "2020-09-28T21:31:16.000Z",
      "date_modified": "2020-09-28T21:31:16.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/kdeldycke/awesome-engineering-team-management/",
      "title": "Awesome Engineering Team Management",
      "_slug": "kdeldycke/awesome-engineering-team-management/",
      "_filepath": "/content/kdeldycke/awesome-engineering-team-management/README.md",
      "url": "https://www.trackawesomelist.com/kdeldycke/awesome-engineering-team-management/",
      "summary": "3 awesome projects updated",
      "content_text": "\n\n### Recruitment / Negotiation\n\n*   [Salary Negotiation: Make More Money, Be More Valued](https://www.kalzumeus.com/2012/01/23/salary-negotiation/) - “Your salary negotiation — which routinely takes less than 5 minutes to conclude — has an outsized influence on what your compensation is.”\n\n### Cognitive Tools / Collections\n\n*   [A Few Rules](https://www.collaborativefund.com/blog/a-few-rules/) - A formalized list of some wisdom you probably encountered elsewhere.\n\n### Health / Burnout\n\n*   [How shitty job crush your soul, then lead to burnout](https://news.ycombinator.com/item?id=7789438) - “Burnout is a very serious situation. If you burn yourself out hard, it will be difficult to be effective at any future job you go to, even if it is ostensibly a wonderful job. Treat burnout like a physical injury.”",
      "content_html": "<h3><p>Recruitment / Negotiation</p>\n</h3><ul>\n<li><a href=\"https://www.kalzumeus.com/2012/01/23/salary-negotiation/\" rel=\"noopener noreferrer\">Salary Negotiation: Make More Money, Be More Valued</a> - “Your salary negotiation — which routinely takes less than 5 minutes to conclude — has an outsized influence on what your compensation is.”</li>\n</ul>\n<h3><p>Cognitive Tools / Collections</p>\n</h3><ul>\n<li><a href=\"https://www.collaborativefund.com/blog/a-few-rules/\" rel=\"noopener noreferrer\">A Few Rules</a> - A formalized list of some wisdom you probably encountered elsewhere.</li>\n</ul>\n<h3><p>Health / Burnout</p>\n</h3><ul>\n<li><a href=\"https://news.ycombinator.com/item?id=7789438\" rel=\"noopener noreferrer\">How shitty job crush your soul, then lead to burnout</a> - “Burnout is a very serious situation. If you burn yourself out hard, it will be difficult to be effective at any future job you go to, even if it is ostensibly a wonderful job. Treat burnout like a physical injury.”</li>\n</ul>\n",
      "date_published": "2020-09-28T21:30:54.000Z",
      "date_modified": "2020-09-28T21:53:42.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/mourarthur/awesome-credit-modeling/",
      "title": "Awesome Credit Modeling",
      "_slug": "mourarthur/awesome-credit-modeling/",
      "_filepath": "/content/mourarthur/awesome-credit-modeling/README.md",
      "url": "https://www.trackawesomelist.com/mourarthur/awesome-credit-modeling/",
      "summary": "3 awesome projects updated",
      "content_text": "\n\n### Credit Scoring\n\n*   [Financial credit risk assessment: a recent review](https://dl.acm.org/doi/10.1007/s10462-015-9434-x) - Summarizes the traditional statistical models and state-of-the-art intelligent methods for financial distress forecasting, with emphasis on the most recent achievements.\n*   [A literature review on the application of evolutionary computing to credit scoring](https://link.springer.com/article/10.1057/jors.2012.145) - The aim of this paper is to summarize the most recent developments in the application of evolutionary algorithms to credit scoring by means of a thorough review of scientific articles published during the period 2000–2012.\n*   [Consumer credit-risk models via machine-learning algorithms](https://alo.mit.edu/wp-content/uploads/2015/06/Household-behaviorConsumer-credit-riskCredit-card-borrowingMachine-learningNonparametric-estimation.pdf) - The authors apply machine-learning techniques to construct nonlinear nonparametric forecasting models of consumer credit risk. They are able to construct out-of-sample forecasts that signiﬁcantly improve the classiﬁcation rates of credit-card-holder delinquencies and defaults.\n*   [Example-Dependent Cost-Sensitive Logistic Regression for Credit Scoring](https://ieeexplore.ieee.org/document/7033125) - Several real-world classification problems are example-dependent cost-sensitive in nature, where the costs due to misclassification vary between examples. Credit scoring is a typical example of cost-sensitive classification. However, it is usually treated using methods that do not take into account the real financial costs associated with the lending business.\n*   [A comparative study on base classifiers in ensemble methods for credit scoring](https://www.sciencedirect.com/science/article/abs/pii/S0957417416306947) - In the last years, the application of artificial intelligence methods on credit risk assessment has meant an improvement over classic methods. Recent works show that ensembles of classifiers achieve the better results for this kind of tasks.\n*   [A survey of credit and behavioural scoring: forecasting financial risk of lending to consumers](https://www.sciencedirect.com/science/article/abs/pii/S0169207000000340) - Surveys the techniques used — both statistical and operational research based — to help organisations decide whether or not to grant credit to consumers. It also discusses the need to incorporate economic conditions into the scoring systems and the way the systems could change from estimating the probability of a consumer defaulting to estimating the profit a consumer will bring to the lending organisation.\n*   [The comparisons of data mining techniques for the predictive accuracy of probability of default of credit card clients](https://www.sciencedirect.com/science/article/abs/pii/S0957417407006719) - This research compares the predictive accuracy of probability of default among six data mining methods. From the perspective of risk management, the result of predictive accuracy of the estimated probability of default will be more valuable than the binary result of classification.\n*   [Super-App Behavioral Patterns in Credit Risk Models: Financial, Statistical and Regulatory Implications](https://arxiv.org/abs/2005.14658) - Presents the impact of alternative data that originates from an app-based marketplace, in contrast to traditional bureau data, upon credit scoring models. These alternative data sources have shown themselves to be immensely powerful in predicting borrower behavior in segments traditionally underserved by banks and financial institutions. At the same time alternative data must be carefully validated to overcome regulatory hurdles across diverse jurisdictions.\n\n### Institutional Credit Risk\n\n*   [Random Survival Forests Models for SME Credit Risk Measurement](https://link.springer.com/article/10.1007/s11009-008-9078-2) - Extends the existing literature on empirical research in the field of credit risk default for Small Medium Enterprizes (SMEs), proposing a non-parametric approach based on Random Survival Forests (RSF) and comparing its performance with a standard logit model.\n*   [Modeling Institutional Credit Risk with Financial News](https://arxiv.org/abs/2004.08204) - Current work in downgrade risk modeling depends on multiple variations of quantitative measures provided by third-party rating agencies and risk management consultancy companies. There has been a wide push into using alternative sources of data, such as financial news, earnings call transcripts, or social media content, to possibly gain a competitive edge in the industry. This paper proposes a predictive downgrade model using solely news data represented by neural network embeddings.\n*   [Bankruptcy prediction for credit risk using neural networks: A survey and new results](https://ieeexplore.ieee.org/document/935101) - The prediction of corporate bankruptcies is an important and widely studied topic since it can have significant impact on bank lending decisions and profitability. This work reviews the topic of bankruptcy prediction, with emphasis on neural-network (NN) models and develops an NN bankruptcy prediction model, proposing novel indicators for the NN system.\n\n### Model Explainability\n\n*   [Machine learning explainability in finance: an application to default risk analysis](https://www.bankofengland.co.uk/working-paper/2019/machine-learning-explainability-in-finance-an-application-to-default-risk-analysis) - This Staff Working Paper from the Bank of England proposes a framework for addressing the ‘black box’ problem present in some Machine Learning (ML) applications.",
      "content_html": "<h3><p>Credit Scoring</p>\n</h3><ul>\n<li><a href=\"https://dl.acm.org/doi/10.1007/s10462-015-9434-x\" rel=\"noopener noreferrer\">Financial credit risk assessment: a recent review</a> - Summarizes the traditional statistical models and state-of-the-art intelligent methods for financial distress forecasting, with emphasis on the most recent achievements.</li>\n</ul>\n<ul>\n<li><a href=\"https://link.springer.com/article/10.1057/jors.2012.145\" rel=\"noopener noreferrer\">A literature review on the application of evolutionary computing to credit scoring</a> - The aim of this paper is to summarize the most recent developments in the application of evolutionary algorithms to credit scoring by means of a thorough review of scientific articles published during the period 2000–2012.</li>\n</ul>\n<ul>\n<li><a href=\"https://alo.mit.edu/wp-content/uploads/2015/06/Household-behaviorConsumer-credit-riskCredit-card-borrowingMachine-learningNonparametric-estimation.pdf\" rel=\"noopener noreferrer\">Consumer credit-risk models via machine-learning algorithms</a> - The authors apply machine-learning techniques to construct nonlinear nonparametric forecasting models of consumer credit risk. They are able to construct out-of-sample forecasts that signiﬁcantly improve the classiﬁcation rates of credit-card-holder delinquencies and defaults.</li>\n</ul>\n<ul>\n<li><a href=\"https://ieeexplore.ieee.org/document/7033125\" rel=\"noopener noreferrer\">Example-Dependent Cost-Sensitive Logistic Regression for Credit Scoring</a> - Several real-world classification problems are example-dependent cost-sensitive in nature, where the costs due to misclassification vary between examples. Credit scoring is a typical example of cost-sensitive classification. However, it is usually treated using methods that do not take into account the real financial costs associated with the lending business.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0957417416306947\" rel=\"noopener noreferrer\">A comparative study on base classifiers in ensemble methods for credit scoring</a> - In the last years, the application of artificial intelligence methods on credit risk assessment has meant an improvement over classic methods. Recent works show that ensembles of classifiers achieve the better results for this kind of tasks.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0169207000000340\" rel=\"noopener noreferrer\">A survey of credit and behavioural scoring: forecasting financial risk of lending to consumers</a> - Surveys the techniques used — both statistical and operational research based — to help organisations decide whether or not to grant credit to consumers. It also discusses the need to incorporate economic conditions into the scoring systems and the way the systems could change from estimating the probability of a consumer defaulting to estimating the profit a consumer will bring to the lending organisation.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0957417407006719\" rel=\"noopener noreferrer\">The comparisons of data mining techniques for the predictive accuracy of probability of default of credit card clients</a> - This research compares the predictive accuracy of probability of default among six data mining methods. From the perspective of risk management, the result of predictive accuracy of the estimated probability of default will be more valuable than the binary result of classification.</li>\n</ul>\n<ul>\n<li><a href=\"https://arxiv.org/abs/2005.14658\" rel=\"noopener noreferrer\">Super-App Behavioral Patterns in Credit Risk Models: Financial, Statistical and Regulatory Implications</a> - Presents the impact of alternative data that originates from an app-based marketplace, in contrast to traditional bureau data, upon credit scoring models. These alternative data sources have shown themselves to be immensely powerful in predicting borrower behavior in segments traditionally underserved by banks and financial institutions. At the same time alternative data must be carefully validated to overcome regulatory hurdles across diverse jurisdictions.</li>\n</ul>\n<h3><p>Institutional Credit Risk</p>\n</h3><ul>\n<li><a href=\"https://link.springer.com/article/10.1007/s11009-008-9078-2\" rel=\"noopener noreferrer\">Random Survival Forests Models for SME Credit Risk Measurement</a> - Extends the existing literature on empirical research in the field of credit risk default for Small Medium Enterprizes (SMEs), proposing a non-parametric approach based on Random Survival Forests (RSF) and comparing its performance with a standard logit model.</li>\n</ul>\n<ul>\n<li><a href=\"https://arxiv.org/abs/2004.08204\" rel=\"noopener noreferrer\">Modeling Institutional Credit Risk with Financial News</a> - Current work in downgrade risk modeling depends on multiple variations of quantitative measures provided by third-party rating agencies and risk management consultancy companies. There has been a wide push into using alternative sources of data, such as financial news, earnings call transcripts, or social media content, to possibly gain a competitive edge in the industry. This paper proposes a predictive downgrade model using solely news data represented by neural network embeddings.</li>\n</ul>\n<ul>\n<li><a href=\"https://ieeexplore.ieee.org/document/935101\" rel=\"noopener noreferrer\">Bankruptcy prediction for credit risk using neural networks: A survey and new results</a> - The prediction of corporate bankruptcies is an important and widely studied topic since it can have significant impact on bank lending decisions and profitability. This work reviews the topic of bankruptcy prediction, with emphasis on neural-network (NN) models and develops an NN bankruptcy prediction model, proposing novel indicators for the NN system.</li>\n</ul>\n<h3><p>Model Explainability</p>\n</h3><ul>\n<li><a href=\"https://www.bankofengland.co.uk/working-paper/2019/machine-learning-explainability-in-finance-an-application-to-default-risk-analysis\" rel=\"noopener noreferrer\">Machine learning explainability in finance: an application to default risk analysis</a> - This Staff Working Paper from the Bank of England proposes a framework for addressing the ‘black box’ problem present in some Machine Learning (ML) applications.</li>\n</ul>\n",
      "date_published": "2020-09-28T19:30:02.000Z",
      "date_modified": "2020-09-28T19:30:02.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/agamm/awesome-developer-first/",
      "title": "Awesome Developer First",
      "_slug": "agamm/awesome-developer-first/",
      "_filepath": "/content/agamm/awesome-developer-first/README.md",
      "url": "https://www.trackawesomelist.com/agamm/awesome-developer-first/",
      "summary": "5 awesome projects updated",
      "content_text": "\n\n### Authentication & Identity\n\n*   [Firebase Auth](https://firebase.google.com/products/auth) - Google Firebase's take on authentication.\n\n### Discussions\n\n*   [Yotpo](https://www.yotpo.com/platform/reviews/) - Reviews ratings and Q\\&A as a service.\n\n### Localization\n\n*   [Localazy](https://localazy.com/) - App translation built for developers.\n\n### Repo\n\n*   [Artifactory](https://jfrog.com/artifactory/) - Create your own package repository.\n\n### Testing\n\n*   [Applitools](https://applitools.com/) - Automated visual testing.",
      "content_html": "<h3><p>Authentication &amp; Identity</p>\n</h3><ul>\n<li><a href=\"https://firebase.google.com/products/auth\" rel=\"noopener noreferrer\">Firebase Auth</a> - Google Firebase's take on authentication.</li>\n</ul>\n<h3><p>Discussions</p>\n</h3><ul>\n<li><a href=\"https://www.yotpo.com/platform/reviews/\" rel=\"noopener noreferrer\">Yotpo</a> - Reviews ratings and Q&amp;A as a service.</li>\n</ul>\n<h3><p>Localization</p>\n</h3><ul>\n<li><a href=\"https://localazy.com/\" rel=\"noopener noreferrer\">Localazy</a> - App translation built for developers.</li>\n</ul>\n<h3><p>Repo</p>\n</h3><ul>\n<li><a href=\"https://jfrog.com/artifactory/\" rel=\"noopener noreferrer\">Artifactory</a> - Create your own package repository.</li>\n</ul>\n<h3><p>Testing</p>\n</h3><ul>\n<li><a href=\"https://applitools.com/\" rel=\"noopener noreferrer\">Applitools</a> - Automated visual testing.</li>\n</ul>\n",
      "date_published": "2020-09-28T18:00:26.000Z",
      "date_modified": "2020-09-28T22:16:46.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/Igglybuff/awesome-piracy/",
      "title": "Awesome Piracy",
      "_slug": "Igglybuff/awesome-piracy/",
      "_filepath": "/content/Igglybuff/awesome-piracy/README.md",
      "url": "https://www.trackawesomelist.com/Igglybuff/awesome-piracy/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Academic Papers and Material / Third Party Hosts\n\n*   [Sci-Hub](https://sci-hub.se/) the first pirate website in the world to provide mass and public access to tens of millions of research papers",
      "content_html": "<h3><p>Academic Papers and Material / Third Party Hosts</p>\n</h3><ul>\n<li><a href=\"https://sci-hub.se/\" rel=\"noopener noreferrer\">Sci-Hub</a> the first pirate website in the world to provide mass and public access to tens of millions of research papers</li>\n</ul>\n",
      "date_published": "2020-09-28T17:27:47.000Z",
      "date_modified": "2020-09-28T17:27:47.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/ohenley/awesome-ada/",
      "title": "Awesome Ada",
      "_slug": "ohenley/awesome-ada/",
      "_filepath": "/content/ohenley/awesome-ada/README.md",
      "url": "https://www.trackawesomelist.com/ohenley/awesome-ada/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Build and Package / Apache License\n\n*   [ada4cmake (⭐5)](https://github.com/mosteo/ada4cmake) - CMake macros for simple gnat project inclusion.",
      "content_html": "<h3><p>Build and Package / Apache License</p>\n</h3><ul>\n<li><a href=\"https://github.com/mosteo/ada4cmake\" rel=\"noopener noreferrer\">ada4cmake (⭐5)</a> - CMake macros for simple gnat project inclusion.</li>\n</ul>\n",
      "date_published": "2020-09-28T14:42:53.000Z",
      "date_modified": "2020-09-28T14:42:53.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/aliesbelik/awesome-gatling/",
      "title": "Awesome Gatling",
      "_slug": "aliesbelik/awesome-gatling/",
      "_filepath": "/content/aliesbelik/awesome-gatling/README.md",
      "url": "https://www.trackawesomelist.com/aliesbelik/awesome-gatling/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Tools / Plugins\n\n*   [gatling-sbt-plugin (⭐107)](https://github.com/gatling/gatling-sbt-plugin) - Gatling SBT plugin to integrate Gatling with SBT, allowing to use Gatling as a testing framework.",
      "content_html": "<h3><p>Tools / Plugins</p>\n</h3><ul>\n<li><a href=\"https://github.com/gatling/gatling-sbt-plugin\" rel=\"noopener noreferrer\">gatling-sbt-plugin (⭐107)</a> - Gatling SBT plugin to integrate Gatling with SBT, allowing to use Gatling as a testing framework.</li>\n</ul>\n",
      "date_published": "2020-09-28T12:17:08.000Z",
      "date_modified": "2020-09-28T12:17:08.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/wilsonfreitas/awesome-quant/",
      "title": "Awesome Quant",
      "_slug": "wilsonfreitas/awesome-quant/",
      "_filepath": "/content/wilsonfreitas/awesome-quant/README.md",
      "url": "https://www.trackawesomelist.com/wilsonfreitas/awesome-quant/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Python / Financial Instruments and Pricing\n\n*   [FinancePy (⭐2.5k)](https://github.com/domokane/FinancePy) - A Python Finance Library that focuses on the pricing and risk-management of Financial Derivatives, including fixed-income, equity, FX and credit derivatives.",
      "content_html": "<h3><p>Python / Financial Instruments and Pricing</p>\n</h3><ul>\n<li><a href=\"https://github.com/domokane/FinancePy\" rel=\"noopener noreferrer\">FinancePy (⭐2.5k)</a> - A Python Finance Library that focuses on the pricing and risk-management of Financial Derivatives, including fixed-income, equity, FX and credit derivatives.</li>\n</ul>\n",
      "date_published": "2020-09-28T08:39:45.000Z",
      "date_modified": "2020-09-28T08:39:45.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/tobiasvl/awesome-chip-8/",
      "title": "Awesome Chip 8",
      "_slug": "tobiasvl/awesome-chip-8/",
      "_filepath": "/content/tobiasvl/awesome-chip-8/README.md",
      "url": "https://www.trackawesomelist.com/tobiasvl/awesome-chip-8/",
      "summary": "2 awesome projects updated",
      "content_text": "\n\n### Documentation\n\n*   [Chip-8 on the COSMAC VIP](https://laurencescotford.com/chip-8-on-the-cosmac-vip-index/) - An in-depth disassembly and analysis of the original CHIP-8 interpreter on the COSMAC VIP.\n\n### Software development / Tools\n\n*   [Octo (⭐727)](http://github.com/johnearnest/Octo/) - A high-level assembler for CHIP-8, Super-CHIP and XO-CHIP, complete with an environment for testing programs, and tools for sharing your creations.",
      "content_html": "<h3><p>Documentation</p>\n</h3><ul>\n<li><a href=\"https://laurencescotford.com/chip-8-on-the-cosmac-vip-index/\" rel=\"noopener noreferrer\">Chip-8 on the COSMAC VIP</a> - An in-depth disassembly and analysis of the original CHIP-8 interpreter on the COSMAC VIP.</li>\n</ul>\n<h3><p>Software development / Tools</p>\n</h3><ul>\n<li><a href=\"http://github.com/johnearnest/Octo/\" rel=\"noopener noreferrer\">Octo (⭐727)</a> - A high-level assembler for CHIP-8, Super-CHIP and XO-CHIP, complete with an environment for testing programs, and tools for sharing your creations.</li>\n</ul>\n",
      "date_published": "2020-09-28T08:07:20.000Z",
      "date_modified": "2020-09-28T08:40:57.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/jthegedus/awesome-firebase/",
      "title": "Awesome Firebase",
      "_slug": "jthegedus/awesome-firebase/",
      "_filepath": "/content/jthegedus/awesome-firebase/README.md",
      "url": "https://www.trackawesomelist.com/jthegedus/awesome-firebase/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Web\n\n*   🔧 [Remote Styles with Remote Config (⭐65)](https://github.com/firebaseextended/remote-styles/) - Dynamic/Conditional loading of CSS stored in Remote Config. ([Launch post](https://medium.com/firebase-developers/introducing-remote-styles-conditional-css-loading-made-easy-daddbbcce050)).",
      "content_html": "<h3><p>Web</p>\n</h3><ul>\n<li>🔧 <a href=\"https://github.com/firebaseextended/remote-styles/\" rel=\"noopener noreferrer\">Remote Styles with Remote Config (⭐65)</a> - Dynamic/Conditional loading of CSS stored in Remote Config. (<a href=\"https://medium.com/firebase-developers/introducing-remote-styles-conditional-css-loading-made-easy-daddbbcce050\" rel=\"noopener noreferrer\">Launch post</a>).</li>\n</ul>\n",
      "date_published": "2020-09-28T02:39:07.000Z",
      "date_modified": "2020-09-28T02:39:07.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/tvvocold/FOSS-for-Dev/",
      "title": "FOSS for Dev",
      "_slug": "tvvocold/FOSS-for-Dev/",
      "_filepath": "/content/tvvocold/FOSS-for-Dev/README.md",
      "url": "https://www.trackawesomelist.com/tvvocold/FOSS-for-Dev/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Feature management\n\n*   [Unleash (⭐12k)](https://github.com/Unleash/unleash) - Free open-source feature flag & toggle service. SDKs for all major languages.",
      "content_html": "<h3><p>Feature management</p>\n</h3><ul>\n<li><a href=\"https://github.com/Unleash/unleash\" rel=\"noopener noreferrer\">Unleash (⭐12k)</a> - Free open-source feature flag &amp; toggle service. SDKs for all major languages.</li>\n</ul>\n",
      "date_published": "2020-09-28T02:36:42.000Z",
      "date_modified": "2020-09-28T02:36:42.000Z"
    }
  ]
}
