{
  "version": "https://jsonfeed.org/version/1",
  "icon": "https://www.trackawesomelist.com/icon.png",
  "favicon": "https://www.trackawesomelist.com/favicon.ico",
  "language": "en",
  "title": "Awesome List Updates on Feb 02, 2024",
  "_site_title": "Track Awesome List",
  "description": "12 awesome lists updated today.",
  "_seo_title": "Awesome List Updates on Feb 02, 2024 - Track Awesome List",
  "feed_url": "https://www.trackawesomelist.com/feed.json",
  "home_page_url": "https://www.trackawesomelist.com",
  "items": [
    {
      "id": "https://www.trackawesomelist.com/igorbarinov/awesome-data-engineering/",
      "title": "Awesome Data Engineering",
      "_slug": "igorbarinov/awesome-data-engineering/",
      "_filepath": "/content/igorbarinov/awesome-data-engineering/README.md",
      "url": "https://www.trackawesomelist.com/igorbarinov/awesome-data-engineering/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Profiling / Data Profiler\n\n*   [Data Profiler (⭐1.5k)](https://github.com/capitalone/dataprofiler) - The DataProfiler is a Python library designed to make data analysis, monitoring, and sensitive data detection easy.",
      "content_html": "<h3><p>Profiling / Data Profiler</p>\n</h3><ul>\n<li><a href=\"https://github.com/capitalone/dataprofiler\" rel=\"noopener noreferrer\">Data Profiler (⭐1.5k)</a> - The DataProfiler is a Python library designed to make data analysis, monitoring, and sensitive data detection easy.</li>\n</ul>\n",
      "date_published": "2024-02-02T23:47:00.000Z",
      "date_modified": "2024-02-02T23:47:00.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/ddotta/awesome-polars/",
      "title": "Awesome Polars",
      "_slug": "ddotta/awesome-polars/",
      "_filepath": "/content/ddotta/awesome-polars/README.md",
      "url": "https://www.trackawesomelist.com/ddotta/awesome-polars/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Blog posts / Miscellaneous\n\n*   [Pandas vs Polars vs Pandas 2.0 … ROUND 2](https://levelup.gitconnected.com/pandas-vs-polars-vs-pandas-2-0-round-2-e1b9acc0f52f) - A blog post that makes a new comparison between Pandas, Pandas 2.0 and Polars by [@guoliveira](https://github.com/guoliveira).\n*   [Polars dataframe’s plugins and extensibility: getting started](https://medium.com/datamindedbe/polars-dataframes-plugins-and-extensibility-getting-started-9371d8b3f093) - A post that illustrates the possibility of extending the core Dataframe API of Polars with a few examples by [@brunocous](https://github.com/brunocous).",
      "content_html": "<h3><p>Blog posts / Miscellaneous</p>\n</h3><ul>\n<li><a href=\"https://levelup.gitconnected.com/pandas-vs-polars-vs-pandas-2-0-round-2-e1b9acc0f52f\" rel=\"noopener noreferrer\">Pandas vs Polars vs Pandas 2.0 … ROUND 2</a> - A blog post that makes a new comparison between Pandas, Pandas 2.0 and Polars by <a href=\"https://github.com/guoliveira\" rel=\"noopener noreferrer\">@guoliveira</a>.</li>\n</ul>\n<ul>\n<li><a href=\"https://medium.com/datamindedbe/polars-dataframes-plugins-and-extensibility-getting-started-9371d8b3f093\" rel=\"noopener noreferrer\">Polars dataframe’s plugins and extensibility: getting started</a> - A post that illustrates the possibility of extending the core Dataframe API of Polars with a few examples by <a href=\"https://github.com/brunocous\" rel=\"noopener noreferrer\">@brunocous</a>.</li>\n</ul>\n",
      "date_published": "2024-02-02T17:26:50.000Z",
      "date_modified": "2024-02-02T17:51:27.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/veggiemonk/awesome-docker/",
      "title": "Awesome Docker",
      "_slug": "veggiemonk/awesome-docker/",
      "_filepath": "/content/veggiemonk/awesome-docker/README.md",
      "url": "https://www.trackawesomelist.com/veggiemonk/awesome-docker/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Web / Other\n\n*   [dockemon (⭐731)](https://github.com/ProductiveOps/dokemon) - Docker Container Management GUI by [@productiveops](https://github.com/ProductiveOps)\n*   [dockge (⭐19k)](https://github.com/louislam/dockge) - easy-to-use and reactive self-hosted docker compose.yaml stack-oriented manager by [@louislam](https://github.com/louislam).",
      "content_html": "<h3><p>Web / Other</p>\n</h3><ul>\n<li><a href=\"https://github.com/ProductiveOps/dokemon\" rel=\"noopener noreferrer\">dockemon (⭐731)</a> - Docker Container Management GUI by <a href=\"https://github.com/ProductiveOps\" rel=\"noopener noreferrer\">@productiveops</a></li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/louislam/dockge\" rel=\"noopener noreferrer\">dockge (⭐19k)</a> - easy-to-use and reactive self-hosted docker compose.yaml stack-oriented manager by <a href=\"https://github.com/louislam\" rel=\"noopener noreferrer\">@louislam</a>.</li>\n</ul>\n",
      "date_published": "2024-02-02T14:08:37.000Z",
      "date_modified": "2024-02-02T14:11:19.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/rockerBOO/awesome-neovim/",
      "title": "Awesome Neovim",
      "_slug": "rockerBOO/awesome-neovim/",
      "_filepath": "/content/rockerBOO/awesome-neovim/README.md",
      "url": "https://www.trackawesomelist.com/rockerBOO/awesome-neovim/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Tree-sitter Supported Colorscheme / Diagnostics\n\n*   [sontungexpt/witch (⭐64)](https://github.com/sontungexpt/witch) - The primary stinvim distro colorscheme includes the default feature of dimming inactive windows, along with various other customization options for users.",
      "content_html": "<h3><p>Tree-sitter Supported Colorscheme / Diagnostics</p>\n</h3><ul>\n<li><a href=\"https://github.com/sontungexpt/witch\" rel=\"noopener noreferrer\">sontungexpt/witch (⭐64)</a> - The primary stinvim distro colorscheme includes the default feature of dimming inactive windows, along with various other customization options for users.</li>\n</ul>\n",
      "date_published": "2024-02-02T13:23:53.000Z",
      "date_modified": "2024-02-02T13:23:53.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/jaywcjlove/awesome-mac/",
      "title": "Awesome Mac",
      "_slug": "jaywcjlove/awesome-mac/",
      "_filepath": "/content/jaywcjlove/awesome-mac/README.md",
      "url": "https://www.trackawesomelist.com/jaywcjlove/awesome-mac/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Developer Tools / Developer Utilities\n\n*   [ZOC Terminal](https://www.emtec.com/zoc/index.html) - Terminal emulator which supports SSH, telnet, connections and other protocols.",
      "content_html": "<h3><p>Developer Tools / Developer Utilities</p>\n</h3><ul>\n<li><a href=\"https://www.emtec.com/zoc/index.html\" rel=\"noopener noreferrer\">ZOC Terminal</a> - Terminal emulator which supports SSH, telnet, connections and other protocols.</li>\n</ul>\n",
      "date_published": "2024-02-02T12:59:33.000Z",
      "date_modified": "2024-02-02T12:59:33.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/michelpereira/awesome-games-of-coding/",
      "title": "Awesome Games of Coding",
      "_slug": "michelpereira/awesome-games-of-coding/",
      "_filepath": "/content/michelpereira/awesome-games-of-coding/README.md",
      "url": "https://www.trackawesomelist.com/michelpereira/awesome-games-of-coding/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### JavaScript\n\n*   [Robot Rumble](https://robotrumble.org/) - A free and open source AI competition platform. Code an algorithm for a team of robots battling in 1x1 grid-based arenas, and test your skills against others on the site. Robots can move and attack in one of four directions, and the team with more robots after 100 turns wins. Supports Python and Javascript, and comes with a desktop-based command line tool.\n*   [DeepestWorld](https://deepestworld.com/) - A browser MMORPG where you can code your character with JavaScript. Explore a boundless, persistent open world devoid of loading screens, where a multitude of biomes and creatures come together to form a living, breathing world.",
      "content_html": "<h3><p>JavaScript</p>\n</h3><ul>\n<li><a href=\"https://robotrumble.org/\" rel=\"noopener noreferrer\">Robot Rumble</a> - A free and open source AI competition platform. Code an algorithm for a team of robots battling in 1x1 grid-based arenas, and test your skills against others on the site. Robots can move and attack in one of four directions, and the team with more robots after 100 turns wins. Supports Python and Javascript, and comes with a desktop-based command line tool.</li>\n</ul>\n<ul>\n<li><a href=\"https://deepestworld.com/\" rel=\"noopener noreferrer\">DeepestWorld</a> - A browser MMORPG where you can code your character with JavaScript. Explore a boundless, persistent open world devoid of loading screens, where a multitude of biomes and creatures come together to form a living, breathing world.</li>\n</ul>\n",
      "date_published": "2024-02-02T08:39:14.000Z",
      "date_modified": "2024-02-02T08:39:14.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/MartinMiles/awesome-sitecore/",
      "title": "Awesome Sitecore",
      "_slug": "MartinMiles/awesome-sitecore/",
      "_filepath": "/content/MartinMiles/awesome-sitecore/README.md",
      "url": "https://www.trackawesomelist.com/MartinMiles/awesome-sitecore/",
      "summary": "34 awesome projects updated",
      "content_text": "\n\n### Analytics\n\n*   [Sitecore Goal Conversion Demo (⭐0)](https://github.com/martinrayenglish/GoalConversions.Demo) - Demonstrate how to obtain goals that were triggered during a visitor's interaction, after their session has ended, this data can be sent to an external system to be used to help marketers by informing them of what customer's and leads are doing on their website.\n\n### Audit and performance\n\n*   [Sitecore.Boost (⭐18)](https://github.com/cardinal252/Sitecore.Boost) - This repository contains a whole wealth of potential patches for the performance Improvements for the Sitecore platform, most of which are running in production instances of Sitecore.\n*   [Sitecore.Cleanup (⭐2)](https://github.com/martinrayenglish/Sitecore.Cleanup) - The module consists of 3 agents that will monitor each of the Event Queue, Publish Queue, and History tables to ensure that they don't exceed a set threshold.\n*   [SitecoreDXG: The Documentation Experience Generator (⭐3)](https://github.com/zkniebel/SitecoreDXG) - Sitecore template architecture visualization and documentation tool from the SitecoreUML family. Leveraging the open-source APIs associated with StarUML (on which SitecoreUML is also based), SitecoreDXG provides support for generating template data model architecture diagrams and HTML documentation from any existing Sitecore instance (PaaS and non-PaaS both supported) that has the SitecoreUML Service for Sitecore.\n\n### Azure\n\n*   [Sitecore Azure Scripts (⭐16)](https://github.com/robhabraken/Sitecore-Azure-Scripts) - Azure-related PowerShell scripts and ARM templates to be used as a template or boilerplate for your own scripts and needs.\n*   [Sitecore Azure Content (⭐18)](https://github.com/olegburov/Sitecore-Azure-Content) - Articles on how to automate deployment of Sitecore solution to the Microsoft Azure Cloud Platform utilizing Azure services.\n*   [Sitecore Advanced Azure Devops (⭐14)](https://github.com/JeffDarchuk/AdvancedSitecoreAzureDevops) - Expanding Sitecore on Azure with flexible and generic scripts (requires a valid PowerShell Azure session to be connected and available).\n\n### Cache\n\n*   [Cache Tuner (⭐0)](https://github.com/KayeeNL/CacheTuner) - The module is an implementation of the rules given in the Sitecore Caching guide.\n*   [ExperienceEditorCache (⭐0)](https://github.com/marek-musielak/Skillcore.ExperienceEditorCache) - A caching module that makes working with Sitecore Experience Editor more pleasant.\n*   [Dictionary Flush Partial Cache (⭐1)](https://github.com/jbluemink/DictionaryFlushPartialCache) - Flashes Partial HTML Cache on changes to Sitecore Dictionary items.\n\n### Commerce\n\n*   [Short Confirmation Codes (⭐0)](https://github.com/dsolovay/ShortConfirmationCodes) - Provides six-character confirmation codes (configurable), randomly generated, and tracked in the commerce database to avoid conflicts, as shorter codes are easier to communicate over support calls and for some clients may be more convenient than the 25 character confirmations that are provided out of the box.\n\n### Containers\n\n*   [Sitecore Containers Prerequisites (⭐0)](https://github.com/nickwesselman/sitecore-containers-prerequisites) - Checks the machine for Sitecore Container compatibility, enable Hyper-V, downloads and installs software including Sitecore 10.1\n*   [Packer for Sitecore (⭐22)](https://github.com/asmagin/sitecore-packer) - Repository contains Packer templates for a local Sitecore hosting environment with IIS and SQL Server on Windows, SOLR and Sitecore 9.0 building virtual machine images and Vagrant boxes for VirtualBox, provisioned with Chef.\n*   [Docker SOLR with SSL (⭐11)](https://github.com/LaubPlusCo/docker-solr-ssl) - A simple setup that sets up a Linux container on a host running solr with SSL using a generated certificate.\n\n### Demo\n\n*   [Sitecore MVP (⭐65)](https://github.com/Sitecore/MVP-Site) - The source code of a real Sitecore MVP website built with Sitecore 10 and SXA working in containers.\n*   [Sitecore.HabitatHome.Utilities (⭐38)](https://github.com/Sitecore/Sitecore.HabitatHome.Utilities) - A collection of utilities and script examples to help with installing Sitecore Experience Platform, installing Sitecore Experience Commerce, installing Sitecore Modules, warming up a Sitecore Instance, security Hardening a Sitecore Instance, etc.\n\n### Content Hub\n\n*   [schguild](https://github.com/sitecoreguild/schguild) - Provides tools and sample code to help you learn and work with Sitecore Content Hub.\n*   [Sitecore.SharedSource.CMP.Connector.Extensions (⭐1)](https://github.com/josedbaez/Sitecore.SharedSource.CMP.Connector.Extensions) - Extends Sitecore Connect for Sitecore CMP 2.0.0 so images set on CMP entities can be synchronized using the XML format used by Sitecore Connect™ for Sitecore DAM 2.0.0, so this module is required.\n\n### Content Search\n\n*   [Sitecore spatial geojson polygons (⭐0)](https://github.com/josedbaez/sitecore-spatial-geojson-polygons) - Implementation of a Linq extension to be able to query on points that intercept GeoJson polygons in Solr indexes. The demo provides a template with the spatial field, a couple of sample items with polygons from OpenStreetMap that cover some cities; and a controller rendering that reads lat and long from the query string and returns the polygon of the item found (e.g. Big Ben's coordinates return London).\n*   [Docker SolrCloud for Sitecore 10 (⭐4)](https://github.com/jermdavis/Sitecore-SolrCloud-Docker) - Creates a SolrCloud container that can be used with a Sitecore 10 instance under Docker. The files have been adjusted from the Solr container files in the Sitecore Docker examples repo. The default \"solr\" service Sitecore provides can be replaced using these files.\n*   [Sitecore SolrProxy (⭐3)](https://github.com/Antonytm/Sitecore.SolrProxy) - Tool for easy access to the Solr admin console if you have access only to Sitecore CM.\n*   [Sitecore Computed Search (⭐2)](https://github.com/martinrayenglish/Sitecore-Computed-Search) - An index search development accelerator that allows developers to declare computed search fields on an index that can capture and store targeted field values of items within a scope as well as the field values of items based on specific templates that are part of its presentation. In addition, specific weights can be applied to these computed fields using search boosting so that content-matching search terms can be promoted in search results.\n\n### Helix\n\n*   [Sitecore Helix Examples (⭐78)](https://github.com/Sitecore/Helix.Examples) - Demonstrations of Sitecore Helix practices across various tooling and business scenarios; intended to demonstrate a wider variety of implementation types/requirements than existing examples.\n*   [Sitecore Helix Documentation (⭐24)](https://github.com/Sitecore/Helix.Docs) - The official guidelines and recommended practices for developing in Sitecore for Sitecore Helix.\n*   [Helixbase (⭐105)](https://github.com/muso31/Helixbase) - Sitecore Helix-based solution for Greenfield projects.\n*   [Helix Publishing Pipeline (⭐69)](https://github.com/richardszalay/helix-publishing-pipeline) - Allows Helix solutions to be published as a single unit, with content from modules (like views and config patches) being automatically included. It also contains optimizations and guidance around local development deployments. Since it  extends the standard Web Publishing Pipeline it should work with any supported target (package, file system, Azure, Docker) via either Visual Studio or the command line.\n*   [Elision](https://github.com/sitecore-elision) - An open-source Sitecore accelerator implementing Helix principles.\n*   [Helixify (⭐0)](https://github.com/konabos/Konabos.Helixify) - The module is designed to add instant Helix compatibility to any Sitecore project.\n\n### Deployment\n\n*   [PostDeploySteps (⭐0)](https://github.com/jst-cyr/NonlinearPostDeploySteps) - Post-deploy steps for use with TDS. 1) TDS Example project that triggers the post-deploy step; 2) Sample web project to show pulling in the deploy step; 3) DeployStep class library that you can add to your solution.\n\n### Extending Content Editor\n\n*   [Browse Command (⭐3)](https://github.com/ParTech/Browse-Command) - Adds a command that allows the user to open an item from the Sitecore content tree in a new browser window. Sitecore does not offer this out-of-the-box, except for the Preview command which has the effect of entering preview mode, so the given module will do the same but without entering Preview mode.\n*   [Environment Styler for Sitecore (⭐4)](https://github.com/jammykam/Environment-Styler-for-Sitecore) - An environment-specific styling (and text) on the login screen and header ribbon for Sitecore.\n*   [SitecoreFieldSuite (⭐6)](https://github.com/Velir/SitecoreFieldSuite) - Provides Sitecore users a more streamlined and informational approach to content authoring. This is achieved by revamping 5 field types, introducing an Images field, enabling automatic publishing of referenced items, and adding new functionality such as the Edit Form, Go to Item button, and the Field Gutter.\n*   [Sitecore Smart Commands (⭐10)](https://github.com/AlenPelin/Sitecore-Smart-Commands) - A shared-source module that contains smart copy, duplicate, and clone commands in Content Editor, that implement so much wanted functionality missing by default.\n\n### Fields\n\n*   [CrossDatabaseTreeListField (⭐0)](https://github.com/ivansharamok/CrossDatabaseTreeListField) - An extended Treelist field to support cross-database references.\n*   [LimitedText Field (⭐3)](https://github.com/ParTech/LimitedText-Field-Controls) - Adds two new field types to the Sitecore Content Editor, Single-Line Text Limited and Multi-Line Text Limited. Both inherit all functionality from the existing text field controls and add the possibility to configure a maximum allowed value for the field, also inform the user of the number of remaining characters while they are editing.\n*   [Hide Dependent Fields Controls (⭐2)](https://github.com/jammykam/Hide-Dependent-Fields) - Adds new Checkbox, Droplist, and Droplink field type to the Sitecore Content Editor which depending on the selected value will hide the proceeding sibling fields. All controls inherit from their equivalent Sitecore counterpart and add the required UI enhancements.\n*   [ImageSelector (⭐0)](https://github.com/markvanaalst/Sitecore.SharedSource.ImageSelector) - An image Selector field for Sitecore to allow selecting and previewing multiple images based on the TreeListEx field.\n\n### Forms\n\n*   [Sitecore-Forms-Extensions (⭐61)](https://github.com/bartverdonck/Sitecore-Forms-Extensions) - Adds some functionality to the forms creator, such as sending emails, timespan validation, subscribing a list, conditions, Azure Blob storage provider and many more.\n\n### JAMstack\n\n*   [Next.js Starter kit using GraphQL and Sitecore Experience Edge for Content Hub (⭐9)](https://github.com/konabos/Next.js-Starter-kit-using-GraphQL-and-Sitecore-Content-Hub-Content-as-a-Service) - This is a great example of Sitecore Experience Edge Content as-a-Service approach using NextJS upon React, using a demo instance of the latest Content Hub.\n*   [Uniform, JSS and Next.js starter kit (⭐29)](https://github.com/uniformdev/sitecore-jss-nextjs-starterkit) - A starter kit of Uniform, JSS, and Next.JS with content items and required configuration files, great to start a vanilla project with.\n\n### JSS\n\n*   [SitecoreQL (⭐15)](https://github.com/kmazzoni/SitecoreQL) - A GraphQL implementation for Sitecore, for example, you can query against Sitecore's Content Search API.\n*   [How to GraphQL (⭐0)](https://github.com/kamsar/howtographql) - A full-stack tutorial website to learn all about GraphQL.\n*   [jss21.4-nextjs-storybook7.4 (⭐4)](https://github.com/jflheureux/jss21.4-nextjs-storybook7.4) - Sitecore JSS 21.4 Next.js sample application in which Storybook 7.4 was added step by step, exposed with the commit history.\n\n### Item Resource Files\n\n*   [Sitecore IAR Management (⭐1)](https://github.com/GAAOPS/Sitecore.IAR.Management) - PowerShell script for managing Items as resources.\n\n### Languages\n\n*   [Sitecore Item Translator (⭐1)](https://github.com/adoprog/Sitecore-Item-Translator) - An item Translator module integrates Google Translate seamlessly so that with a click of a button you can translate your text into any language that Google Translate supports.\n*   [Sitecore Item Versioner (⭐2)](https://github.com/aquasonic/SitecoreItemVersioner) - This module adds a new ribbon into the version's chunk of the Content Editor. With the new ribbon, it is possible to initially create an item version in all configured languages.\n\n### Logging\n\n*   [SitecoreRollingLogFileAppender (⭐0)](https://github.com/ivansharamok/SitecoreRollingLogFileAppender) - Log4net RollingLogFileAppender for Sitecore that allows capping log files size.\n*   [Logging To Logentries (⭐0)](https://github.com/jammykam/Sitecore.Logentries) - Configures your application to log into Logentries (supports NLog, Log4net, Serilog, others).\n\n### Maintenance\n\n*   [Sitecore Instance Manager (⭐108)](https://github.com/Sitecore/Sitecore-Instance-Manager) - The legendary Sitecore Instant Manager, now with version 9.x support.\n*   [Sifon (⭐12)](https://github.com/MartinMiles/Sifon) - Backup-restore tool supporting XC and remote machine operation with an excellent pluggable interface. Sifon also has a very powerful extension system with plugins covering many aspects of day-to-day activities.\n\n### Media\n\n*   [YouTube Integration module (⭐0)](https://github.com/ivansharamok/YouTube-Integration) - An easy way to show the videos from a channel on YouTube on your site, the YouTube integration module might be what you are looking for. In the media library, you have a YouTube folder and by typing the name of the channel, all the videos in that channel are now represented by an item and when you create a new video on your channel it automatically updates the channel in the media library.\n*   [Shrink (⭐2)](https://github.com/robhabraken/shrink) - Gives an insight into the usage of your media library similar to a disk usage statistics viewer for your hard drives, also shows you which items are being used and published, so you can easily find media items that unnecessarily take up space in your database and offers you multiple ways of cleaning up your media library!\n\n### ORM\n\n*   [TemplateModelHelper (⭐0)](https://github.com/lowedown/TemplateModelHelper) - Helper methods for working with generated Sitecore Template Models (Mapped through Glass.Mapper or other framework) with a main goal is to make it easy for developers to query the Sitecore database using generated Template models.\n*   [Synthesis (⭐76)](https://github.com/blipson89/Synthesis) - An object mapping framework for Sitecore that enables the development of more reliable and maintainable sites in less time than traditional Sitecore development. It is a strongly typed template object generator that is easily understandable for developers with either a Sitecore or traditional .NET background. It neatly integrates with Sitecore MVC (via the Synthesis.Mvc package) as a View rendering model provider and IoC dependency for controller renderings.\n\n### Other\n\n*   [Sitecore.SharedSource.JohnWest (⭐10)](https://github.com/jammykam/Sitecore.SharedSource.JohnWest) - A collection of code samples of Sitecore prototypes from John West blog posts.\n*   [BLAZOR + SITECORE (⭐48)](https://github.com/GoranHalvarsson/SitecoreBlazor) - Allows you to run the Sitecore app's client-side, also following the HELIX concept, the clean way.\n*   [Sitecore TokenManager (⭐11)](https://github.com/JeffDarchuk/SCTokenManager) - A framework designed to allow any type of content to be dynamically injected into an RTE field.\n\n### Publishing\n\n*   [SIF scripts to install Publishing Service (⭐3)](https://github.com/KayeeNL/sitecore-sif-autoinstall-publishingservice) - Powershell scripts that both use the Sitecore Install Framework (SIF) to auto-install the Publishing Service & auto-install the Publishing Module on top of the ContentManagement instance or StandAlone instance.\n*   [Publish Viewer (⭐4)](https://github.com/mikeedwards83/Glass.PublishViewer) - Allows you to monitor the publishing queue on the Sitecore Publishing CM Server, see their current status, and cancel publishing jobs if required (ie. time queued, time publish job started, duration in the queue, number of items published, average time to publish an item, all messages from the published job).\n*   [Sitecore Power Publish (⭐1)](https://github.com/robhabraken/sitecore-power-publish) - Publish button that forces the item being published, regardless of the state of the Publishable option on the Item tab in the Publish restriction. 1) This function will not publish linked pages in your site that are not published, but only resources like media library items and data sources used in item fields, as those are needed to display the item you want to publish correctly. This method even publishes the templates and layouts used by the current item, if that's not done yet. 2) Unpublish button enables you to unpublish an item with a single click. It will change the Publish Restrictions as it unchecks the Publishable option on the Item tab and publishes the item after that, using a full Republish without Subitems. 3) The Publishing State button shows the publishing state for all publishing targets. If a publishing target is up-to-date, a green dot is shown. If the item is published to a publishing target, but the item has changed afterward, an orange dot is shown (so it's published, but not up-to-date). If the current item is not present in a publishing target at all, a red dot is shown. This function enables the content editor to check in detail if the content is published or not, for every publishing target.\n\n### Rules\n\n*   [Conditional Placeholder Settings](https://github.com/matthewkenny/ConditionalPlaceholderSettings) - A module to allow Sitecore Rules Engine to support the existing placeholder settings functionality coming with Sitecore.\n\n### Security\n\n*   [Securty Headers (⭐8)](https://github.com/GuitarRich/SXA.SecurityHeaders) - Shows how to implement response security headers on an example of SXA, but they are truly Helix-generic.\n*   [SI Snitch (⭐7)](https://github.com/KayeeNL/SI-Snitch) - A debugging tool for reading claims passed to Sitecore from Sitecore Identity, after the transformation of those claims from Sitecore Identity. It can be helpful in identifying claims that Sitecore is getting (and in what format) and ensuring group transformations in Sitecore Identity are being processed properly.\n\n### SEO\n\n*   [URL Rewrite (⭐23)](https://github.com/iamandycohen/UrlRewrite) - A site-specific version of the Redirect / Rewrite module.\n\n### Serialization\n\n*   [Sidekick (⭐48)](https://github.com/JeffDarchuk/SitecoreSidekick) - A framework for angularjs-based microservice architecture operations.\n\n### SXA (Sitecore Experience Accelerator)\n\n*   [SXA Styleguide (⭐14)](https://github.com/markvanaalst/SXA.Styleguide) - An education site based on SXA that helps explain the inner workings and illustrate best practices.\n*   [SXA.Styleguide.Frontend (⭐2)](https://github.com/markvanaalst/SXA.Styleguide.Frontend) - A repository holds all the frontend code needed to run the site. It consists of two parts, the SXA themes and the Scriban templates used on the site. The folder structure used in this repository mimics the SXA Creative Exchange output, therefore you can find the sources for the themes and the separate Scriban templates.\n*   [SXA Reference (⭐19)](https://github.com/alan-null/XA.Reference) - An example Sitecore project built on top of Sitecore Experience Accelerator.\n*   [SXA.HealthCheck (⭐5)](https://github.com/alan-null/SXA.HealthCheck) - A Power Shell script used to determine the health status of the SXA site, consists of validation steps, each of them checks different things in SXA solution and provides possible solutions.\n*   [SXA Securty Headers (⭐8)](https://github.com/GuitarRich/SXA.SecurityHeaders) - Shows how to implement response security headers on an example of SXA, but they are truly Helix-generic.\n\n### Testing\n\n*   [Sitecore FakeDb (⭐115)](https://github.com/sshushliapin/Sitecore.FakeDb) - A unit testing framework for Sitecore that enables the creation and manipulation of Sitecore content in memory. It is designed to minimize efforts for the test content initialization keeping focus on the minimal test data rather than comprehensive content tree representation.\n\n### Templates\n\n*   [Token Set (⭐1)](https://github.com/retohugi/SitecoreExtension-TokenSet) - Provides additional standard value tokens for Sitecore Data Templates, including future date and obtaining the value by executing a query.\n\n### Tooling\n\n*   [Terminal DevEx Improvements (⭐10)](https://github.com/Sitecore/Windows-Terminal-DevEx-improvements) - A Sitecore branded Windows Terminal and VS Code Theme and Profile to unlock helpful tooling for working with XM Cloud such as autocompletion, command history list and directory improvements.\n\n### Workflows\n\n*   [DynamicWorkflows (⭐2)](https://github.com/ivansharamok/DynamicWorkflows) - Rule Engine-based workflow management tool.\n\n### xConnect and xDB\n\n*   [XConnectHelper (⭐23)](https://github.com/lowedown/xConnectHelper) - A Swiss Army Knife for debugging xConnect. Features: Insight into current tracking session data; Show goals and events that were triggered on the last page view; Status checker that validates your xConnect setup (connections, certificates, settings); Set identifiers and basic contact data in the current session; Flush current session for immediate processing.",
      "content_html": "<h3><p>Analytics</p>\n</h3><ul>\n<li><a href=\"https://github.com/martinrayenglish/GoalConversions.Demo\" rel=\"noopener noreferrer\">Sitecore Goal Conversion Demo (⭐0)</a> - Demonstrate how to obtain goals that were triggered during a visitor's interaction, after their session has ended, this data can be sent to an external system to be used to help marketers by informing them of what customer's and leads are doing on their website.</li>\n</ul>\n<h3><p>Audit and performance</p>\n</h3><ul>\n<li><a href=\"https://github.com/cardinal252/Sitecore.Boost\" rel=\"noopener noreferrer\">Sitecore.Boost (⭐18)</a> - This repository contains a whole wealth of potential patches for the performance Improvements for the Sitecore platform, most of which are running in production instances of Sitecore.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/martinrayenglish/Sitecore.Cleanup\" rel=\"noopener noreferrer\">Sitecore.Cleanup (⭐2)</a> - The module consists of 3 agents that will monitor each of the Event Queue, Publish Queue, and History tables to ensure that they don't exceed a set threshold.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/zkniebel/SitecoreDXG\" rel=\"noopener noreferrer\">SitecoreDXG: The Documentation Experience Generator (⭐3)</a> - Sitecore template architecture visualization and documentation tool from the SitecoreUML family. Leveraging the open-source APIs associated with StarUML (on which SitecoreUML is also based), SitecoreDXG provides support for generating template data model architecture diagrams and HTML documentation from any existing Sitecore instance (PaaS and non-PaaS both supported) that has the SitecoreUML Service for Sitecore.</li>\n</ul>\n<h3><p>Azure</p>\n</h3><ul>\n<li><a href=\"https://github.com/robhabraken/Sitecore-Azure-Scripts\" rel=\"noopener noreferrer\">Sitecore Azure Scripts (⭐16)</a> - Azure-related PowerShell scripts and ARM templates to be used as a template or boilerplate for your own scripts and needs.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/olegburov/Sitecore-Azure-Content\" rel=\"noopener noreferrer\">Sitecore Azure Content (⭐18)</a> - Articles on how to automate deployment of Sitecore solution to the Microsoft Azure Cloud Platform utilizing Azure services.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/JeffDarchuk/AdvancedSitecoreAzureDevops\" rel=\"noopener noreferrer\">Sitecore Advanced Azure Devops (⭐14)</a> - Expanding Sitecore on Azure with flexible and generic scripts (requires a valid PowerShell Azure session to be connected and available).</li>\n</ul>\n<h3><p>Cache</p>\n</h3><ul>\n<li><a href=\"https://github.com/KayeeNL/CacheTuner\" rel=\"noopener noreferrer\">Cache Tuner (⭐0)</a> - The module is an implementation of the rules given in the Sitecore Caching guide.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/marek-musielak/Skillcore.ExperienceEditorCache\" rel=\"noopener noreferrer\">ExperienceEditorCache (⭐0)</a> - A caching module that makes working with Sitecore Experience Editor more pleasant.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/jbluemink/DictionaryFlushPartialCache\" rel=\"noopener noreferrer\">Dictionary Flush Partial Cache (⭐1)</a> - Flashes Partial HTML Cache on changes to Sitecore Dictionary items.</li>\n</ul>\n<h3><p>Commerce</p>\n</h3><ul>\n<li><a href=\"https://github.com/dsolovay/ShortConfirmationCodes\" rel=\"noopener noreferrer\">Short Confirmation Codes (⭐0)</a> - Provides six-character confirmation codes (configurable), randomly generated, and tracked in the commerce database to avoid conflicts, as shorter codes are easier to communicate over support calls and for some clients may be more convenient than the 25 character confirmations that are provided out of the box.</li>\n</ul>\n<h3><p>Containers</p>\n</h3><ul>\n<li><a href=\"https://github.com/nickwesselman/sitecore-containers-prerequisites\" rel=\"noopener noreferrer\">Sitecore Containers Prerequisites (⭐0)</a> - Checks the machine for Sitecore Container compatibility, enable Hyper-V, downloads and installs software including Sitecore 10.1</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/asmagin/sitecore-packer\" rel=\"noopener noreferrer\">Packer for Sitecore (⭐22)</a> - Repository contains Packer templates for a local Sitecore hosting environment with IIS and SQL Server on Windows, SOLR and Sitecore 9.0 building virtual machine images and Vagrant boxes for VirtualBox, provisioned with Chef.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/LaubPlusCo/docker-solr-ssl\" rel=\"noopener noreferrer\">Docker SOLR with SSL (⭐11)</a> - A simple setup that sets up a Linux container on a host running solr with SSL using a generated certificate.</li>\n</ul>\n<h3><p>Demo</p>\n</h3><ul>\n<li><a href=\"https://github.com/Sitecore/MVP-Site\" rel=\"noopener noreferrer\">Sitecore MVP (⭐65)</a> - The source code of a real Sitecore MVP website built with Sitecore 10 and SXA working in containers.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/Sitecore/Sitecore.HabitatHome.Utilities\" rel=\"noopener noreferrer\">Sitecore.HabitatHome.Utilities (⭐38)</a> - A collection of utilities and script examples to help with installing Sitecore Experience Platform, installing Sitecore Experience Commerce, installing Sitecore Modules, warming up a Sitecore Instance, security Hardening a Sitecore Instance, etc.</li>\n</ul>\n<h3><p>Content Hub</p>\n</h3><ul>\n<li><a href=\"https://github.com/sitecoreguild/schguild\" rel=\"noopener noreferrer\">schguild</a> - Provides tools and sample code to help you learn and work with Sitecore Content Hub.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/josedbaez/Sitecore.SharedSource.CMP.Connector.Extensions\" rel=\"noopener noreferrer\">Sitecore.SharedSource.CMP.Connector.Extensions (⭐1)</a> - Extends Sitecore Connect for Sitecore CMP 2.0.0 so images set on CMP entities can be synchronized using the XML format used by Sitecore Connect™ for Sitecore DAM 2.0.0, so this module is required.</li>\n</ul>\n<h3><p>Content Search</p>\n</h3><ul>\n<li><a href=\"https://github.com/josedbaez/sitecore-spatial-geojson-polygons\" rel=\"noopener noreferrer\">Sitecore spatial geojson polygons (⭐0)</a> - Implementation of a Linq extension to be able to query on points that intercept GeoJson polygons in Solr indexes. The demo provides a template with the spatial field, a couple of sample items with polygons from OpenStreetMap that cover some cities; and a controller rendering that reads lat and long from the query string and returns the polygon of the item found (e.g. Big Ben's coordinates return London).</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/jermdavis/Sitecore-SolrCloud-Docker\" rel=\"noopener noreferrer\">Docker SolrCloud for Sitecore 10 (⭐4)</a> - Creates a SolrCloud container that can be used with a Sitecore 10 instance under Docker. The files have been adjusted from the Solr container files in the Sitecore Docker examples repo. The default \"solr\" service Sitecore provides can be replaced using these files.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/Antonytm/Sitecore.SolrProxy\" rel=\"noopener noreferrer\">Sitecore SolrProxy (⭐3)</a> - Tool for easy access to the Solr admin console if you have access only to Sitecore CM.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/martinrayenglish/Sitecore-Computed-Search\" rel=\"noopener noreferrer\">Sitecore Computed Search (⭐2)</a> - An index search development accelerator that allows developers to declare computed search fields on an index that can capture and store targeted field values of items within a scope as well as the field values of items based on specific templates that are part of its presentation. In addition, specific weights can be applied to these computed fields using search boosting so that content-matching search terms can be promoted in search results.</li>\n</ul>\n<h3><p>Helix</p>\n</h3><ul>\n<li><a href=\"https://github.com/Sitecore/Helix.Examples\" rel=\"noopener noreferrer\">Sitecore Helix Examples (⭐78)</a> - Demonstrations of Sitecore Helix practices across various tooling and business scenarios; intended to demonstrate a wider variety of implementation types/requirements than existing examples.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/Sitecore/Helix.Docs\" rel=\"noopener noreferrer\">Sitecore Helix Documentation (⭐24)</a> - The official guidelines and recommended practices for developing in Sitecore for Sitecore Helix.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/muso31/Helixbase\" rel=\"noopener noreferrer\">Helixbase (⭐105)</a> - Sitecore Helix-based solution for Greenfield projects.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/richardszalay/helix-publishing-pipeline\" rel=\"noopener noreferrer\">Helix Publishing Pipeline (⭐69)</a> - Allows Helix solutions to be published as a single unit, with content from modules (like views and config patches) being automatically included. It also contains optimizations and guidance around local development deployments. Since it  extends the standard Web Publishing Pipeline it should work with any supported target (package, file system, Azure, Docker) via either Visual Studio or the command line.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/sitecore-elision\" rel=\"noopener noreferrer\">Elision</a> - An open-source Sitecore accelerator implementing Helix principles.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/konabos/Konabos.Helixify\" rel=\"noopener noreferrer\">Helixify (⭐0)</a> - The module is designed to add instant Helix compatibility to any Sitecore project.</li>\n</ul>\n<h3><p>Deployment</p>\n</h3><ul>\n<li><a href=\"https://github.com/jst-cyr/NonlinearPostDeploySteps\" rel=\"noopener noreferrer\">PostDeploySteps (⭐0)</a> - Post-deploy steps for use with TDS. 1) TDS Example project that triggers the post-deploy step; 2) Sample web project to show pulling in the deploy step; 3) DeployStep class library that you can add to your solution.</li>\n</ul>\n<h3><p>Extending Content Editor</p>\n</h3><ul>\n<li><a href=\"https://github.com/ParTech/Browse-Command\" rel=\"noopener noreferrer\">Browse Command (⭐3)</a> - Adds a command that allows the user to open an item from the Sitecore content tree in a new browser window. Sitecore does not offer this out-of-the-box, except for the Preview command which has the effect of entering preview mode, so the given module will do the same but without entering Preview mode.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/jammykam/Environment-Styler-for-Sitecore\" rel=\"noopener noreferrer\">Environment Styler for Sitecore (⭐4)</a> - An environment-specific styling (and text) on the login screen and header ribbon for Sitecore.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/Velir/SitecoreFieldSuite\" rel=\"noopener noreferrer\">SitecoreFieldSuite (⭐6)</a> - Provides Sitecore users a more streamlined and informational approach to content authoring. This is achieved by revamping 5 field types, introducing an Images field, enabling automatic publishing of referenced items, and adding new functionality such as the Edit Form, Go to Item button, and the Field Gutter.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/AlenPelin/Sitecore-Smart-Commands\" rel=\"noopener noreferrer\">Sitecore Smart Commands (⭐10)</a> - A shared-source module that contains smart copy, duplicate, and clone commands in Content Editor, that implement so much wanted functionality missing by default.</li>\n</ul>\n<h3><p>Fields</p>\n</h3><ul>\n<li><a href=\"https://github.com/ivansharamok/CrossDatabaseTreeListField\" rel=\"noopener noreferrer\">CrossDatabaseTreeListField (⭐0)</a> - An extended Treelist field to support cross-database references.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/ParTech/LimitedText-Field-Controls\" rel=\"noopener noreferrer\">LimitedText Field (⭐3)</a> - Adds two new field types to the Sitecore Content Editor, Single-Line Text Limited and Multi-Line Text Limited. Both inherit all functionality from the existing text field controls and add the possibility to configure a maximum allowed value for the field, also inform the user of the number of remaining characters while they are editing.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/jammykam/Hide-Dependent-Fields\" rel=\"noopener noreferrer\">Hide Dependent Fields Controls (⭐2)</a> - Adds new Checkbox, Droplist, and Droplink field type to the Sitecore Content Editor which depending on the selected value will hide the proceeding sibling fields. All controls inherit from their equivalent Sitecore counterpart and add the required UI enhancements.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/markvanaalst/Sitecore.SharedSource.ImageSelector\" rel=\"noopener noreferrer\">ImageSelector (⭐0)</a> - An image Selector field for Sitecore to allow selecting and previewing multiple images based on the TreeListEx field.</li>\n</ul>\n<h3><p>Forms</p>\n</h3><ul>\n<li><a href=\"https://github.com/bartverdonck/Sitecore-Forms-Extensions\" rel=\"noopener noreferrer\">Sitecore-Forms-Extensions (⭐61)</a> - Adds some functionality to the forms creator, such as sending emails, timespan validation, subscribing a list, conditions, Azure Blob storage provider and many more.</li>\n</ul>\n<h3><p>JAMstack</p>\n</h3><ul>\n<li><a href=\"https://github.com/konabos/Next.js-Starter-kit-using-GraphQL-and-Sitecore-Content-Hub-Content-as-a-Service\" rel=\"noopener noreferrer\">Next.js Starter kit using GraphQL and Sitecore Experience Edge for Content Hub (⭐9)</a> - This is a great example of Sitecore Experience Edge Content as-a-Service approach using NextJS upon React, using a demo instance of the latest Content Hub.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/uniformdev/sitecore-jss-nextjs-starterkit\" rel=\"noopener noreferrer\">Uniform, JSS and Next.js starter kit (⭐29)</a> - A starter kit of Uniform, JSS, and Next.JS with content items and required configuration files, great to start a vanilla project with.</li>\n</ul>\n<h3><p>JSS</p>\n</h3><ul>\n<li><a href=\"https://github.com/kmazzoni/SitecoreQL\" rel=\"noopener noreferrer\">SitecoreQL (⭐15)</a> - A GraphQL implementation for Sitecore, for example, you can query against Sitecore's Content Search API.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/kamsar/howtographql\" rel=\"noopener noreferrer\">How to GraphQL (⭐0)</a> - A full-stack tutorial website to learn all about GraphQL.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/jflheureux/jss21.4-nextjs-storybook7.4\" rel=\"noopener noreferrer\">jss21.4-nextjs-storybook7.4 (⭐4)</a> - Sitecore JSS 21.4 Next.js sample application in which Storybook 7.4 was added step by step, exposed with the commit history.</li>\n</ul>\n<h3><p>Item Resource Files</p>\n</h3><ul>\n<li><a href=\"https://github.com/GAAOPS/Sitecore.IAR.Management\" rel=\"noopener noreferrer\">Sitecore IAR Management (⭐1)</a> - PowerShell script for managing Items as resources.</li>\n</ul>\n<h3><p>Languages</p>\n</h3><ul>\n<li><a href=\"https://github.com/adoprog/Sitecore-Item-Translator\" rel=\"noopener noreferrer\">Sitecore Item Translator (⭐1)</a> - An item Translator module integrates Google Translate seamlessly so that with a click of a button you can translate your text into any language that Google Translate supports.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/aquasonic/SitecoreItemVersioner\" rel=\"noopener noreferrer\">Sitecore Item Versioner (⭐2)</a> - This module adds a new ribbon into the version's chunk of the Content Editor. With the new ribbon, it is possible to initially create an item version in all configured languages.</li>\n</ul>\n<h3><p>Logging</p>\n</h3><ul>\n<li><a href=\"https://github.com/ivansharamok/SitecoreRollingLogFileAppender\" rel=\"noopener noreferrer\">SitecoreRollingLogFileAppender (⭐0)</a> - Log4net RollingLogFileAppender for Sitecore that allows capping log files size.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/jammykam/Sitecore.Logentries\" rel=\"noopener noreferrer\">Logging To Logentries (⭐0)</a> - Configures your application to log into Logentries (supports NLog, Log4net, Serilog, others).</li>\n</ul>\n<h3><p>Maintenance</p>\n</h3><ul>\n<li><a href=\"https://github.com/Sitecore/Sitecore-Instance-Manager\" rel=\"noopener noreferrer\">Sitecore Instance Manager (⭐108)</a> - The legendary Sitecore Instant Manager, now with version 9.x support.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/MartinMiles/Sifon\" rel=\"noopener noreferrer\">Sifon (⭐12)</a> - Backup-restore tool supporting XC and remote machine operation with an excellent pluggable interface. Sifon also has a very powerful extension system with plugins covering many aspects of day-to-day activities.</li>\n</ul>\n<h3><p>Media</p>\n</h3><ul>\n<li><a href=\"https://github.com/ivansharamok/YouTube-Integration\" rel=\"noopener noreferrer\">YouTube Integration module (⭐0)</a> - An easy way to show the videos from a channel on YouTube on your site, the YouTube integration module might be what you are looking for. In the media library, you have a YouTube folder and by typing the name of the channel, all the videos in that channel are now represented by an item and when you create a new video on your channel it automatically updates the channel in the media library.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/robhabraken/shrink\" rel=\"noopener noreferrer\">Shrink (⭐2)</a> - Gives an insight into the usage of your media library similar to a disk usage statistics viewer for your hard drives, also shows you which items are being used and published, so you can easily find media items that unnecessarily take up space in your database and offers you multiple ways of cleaning up your media library!</li>\n</ul>\n<h3><p>ORM</p>\n</h3><ul>\n<li><a href=\"https://github.com/lowedown/TemplateModelHelper\" rel=\"noopener noreferrer\">TemplateModelHelper (⭐0)</a> - Helper methods for working with generated Sitecore Template Models (Mapped through Glass.Mapper or other framework) with a main goal is to make it easy for developers to query the Sitecore database using generated Template models.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/blipson89/Synthesis\" rel=\"noopener noreferrer\">Synthesis (⭐76)</a> - An object mapping framework for Sitecore that enables the development of more reliable and maintainable sites in less time than traditional Sitecore development. It is a strongly typed template object generator that is easily understandable for developers with either a Sitecore or traditional .NET background. It neatly integrates with Sitecore MVC (via the Synthesis.Mvc package) as a View rendering model provider and IoC dependency for controller renderings.</li>\n</ul>\n<h3><p>Other</p>\n</h3><ul>\n<li><a href=\"https://github.com/jammykam/Sitecore.SharedSource.JohnWest\" rel=\"noopener noreferrer\">Sitecore.SharedSource.JohnWest (⭐10)</a> - A collection of code samples of Sitecore prototypes from John West blog posts.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/GoranHalvarsson/SitecoreBlazor\" rel=\"noopener noreferrer\">BLAZOR + SITECORE (⭐48)</a> - Allows you to run the Sitecore app's client-side, also following the HELIX concept, the clean way.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/JeffDarchuk/SCTokenManager\" rel=\"noopener noreferrer\">Sitecore TokenManager (⭐11)</a> - A framework designed to allow any type of content to be dynamically injected into an RTE field.</li>\n</ul>\n<h3><p>Publishing</p>\n</h3><ul>\n<li><a href=\"https://github.com/KayeeNL/sitecore-sif-autoinstall-publishingservice\" rel=\"noopener noreferrer\">SIF scripts to install Publishing Service (⭐3)</a> - Powershell scripts that both use the Sitecore Install Framework (SIF) to auto-install the Publishing Service &amp; auto-install the Publishing Module on top of the ContentManagement instance or StandAlone instance.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/mikeedwards83/Glass.PublishViewer\" rel=\"noopener noreferrer\">Publish Viewer (⭐4)</a> - Allows you to monitor the publishing queue on the Sitecore Publishing CM Server, see their current status, and cancel publishing jobs if required (ie. time queued, time publish job started, duration in the queue, number of items published, average time to publish an item, all messages from the published job).</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/robhabraken/sitecore-power-publish\" rel=\"noopener noreferrer\">Sitecore Power Publish (⭐1)</a> - Publish button that forces the item being published, regardless of the state of the Publishable option on the Item tab in the Publish restriction. 1) This function will not publish linked pages in your site that are not published, but only resources like media library items and data sources used in item fields, as those are needed to display the item you want to publish correctly. This method even publishes the templates and layouts used by the current item, if that's not done yet. 2) Unpublish button enables you to unpublish an item with a single click. It will change the Publish Restrictions as it unchecks the Publishable option on the Item tab and publishes the item after that, using a full Republish without Subitems. 3) The Publishing State button shows the publishing state for all publishing targets. If a publishing target is up-to-date, a green dot is shown. If the item is published to a publishing target, but the item has changed afterward, an orange dot is shown (so it's published, but not up-to-date). If the current item is not present in a publishing target at all, a red dot is shown. This function enables the content editor to check in detail if the content is published or not, for every publishing target.</li>\n</ul>\n<h3><p>Rules</p>\n</h3><ul>\n<li><a href=\"https://github.com/matthewkenny/ConditionalPlaceholderSettings\" rel=\"noopener noreferrer\">Conditional Placeholder Settings</a> - A module to allow Sitecore Rules Engine to support the existing placeholder settings functionality coming with Sitecore.</li>\n</ul>\n<h3><p>Security</p>\n</h3><ul>\n<li><a href=\"https://github.com/GuitarRich/SXA.SecurityHeaders\" rel=\"noopener noreferrer\">Securty Headers (⭐8)</a> - Shows how to implement response security headers on an example of SXA, but they are truly Helix-generic.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/KayeeNL/SI-Snitch\" rel=\"noopener noreferrer\">SI Snitch (⭐7)</a> - A debugging tool for reading claims passed to Sitecore from Sitecore Identity, after the transformation of those claims from Sitecore Identity. It can be helpful in identifying claims that Sitecore is getting (and in what format) and ensuring group transformations in Sitecore Identity are being processed properly.</li>\n</ul>\n<h3><p>SEO</p>\n</h3><ul>\n<li><a href=\"https://github.com/iamandycohen/UrlRewrite\" rel=\"noopener noreferrer\">URL Rewrite (⭐23)</a> - A site-specific version of the Redirect / Rewrite module.</li>\n</ul>\n<h3><p>Serialization</p>\n</h3><ul>\n<li><a href=\"https://github.com/JeffDarchuk/SitecoreSidekick\" rel=\"noopener noreferrer\">Sidekick (⭐48)</a> - A framework for angularjs-based microservice architecture operations.</li>\n</ul>\n<h3><p>SXA (Sitecore Experience Accelerator)</p>\n</h3><ul>\n<li><a href=\"https://github.com/markvanaalst/SXA.Styleguide\" rel=\"noopener noreferrer\">SXA Styleguide (⭐14)</a> - An education site based on SXA that helps explain the inner workings and illustrate best practices.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/markvanaalst/SXA.Styleguide.Frontend\" rel=\"noopener noreferrer\">SXA.Styleguide.Frontend (⭐2)</a> - A repository holds all the frontend code needed to run the site. It consists of two parts, the SXA themes and the Scriban templates used on the site. The folder structure used in this repository mimics the SXA Creative Exchange output, therefore you can find the sources for the themes and the separate Scriban templates.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/alan-null/XA.Reference\" rel=\"noopener noreferrer\">SXA Reference (⭐19)</a> - An example Sitecore project built on top of Sitecore Experience Accelerator.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/alan-null/SXA.HealthCheck\" rel=\"noopener noreferrer\">SXA.HealthCheck (⭐5)</a> - A Power Shell script used to determine the health status of the SXA site, consists of validation steps, each of them checks different things in SXA solution and provides possible solutions.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/GuitarRich/SXA.SecurityHeaders\" rel=\"noopener noreferrer\">SXA Securty Headers (⭐8)</a> - Shows how to implement response security headers on an example of SXA, but they are truly Helix-generic.</li>\n</ul>\n<h3><p>Testing</p>\n</h3><ul>\n<li><a href=\"https://github.com/sshushliapin/Sitecore.FakeDb\" rel=\"noopener noreferrer\">Sitecore FakeDb (⭐115)</a> - A unit testing framework for Sitecore that enables the creation and manipulation of Sitecore content in memory. It is designed to minimize efforts for the test content initialization keeping focus on the minimal test data rather than comprehensive content tree representation.</li>\n</ul>\n<h3><p>Templates</p>\n</h3><ul>\n<li><a href=\"https://github.com/retohugi/SitecoreExtension-TokenSet\" rel=\"noopener noreferrer\">Token Set (⭐1)</a> - Provides additional standard value tokens for Sitecore Data Templates, including future date and obtaining the value by executing a query.</li>\n</ul>\n<h3><p>Tooling</p>\n</h3><ul>\n<li><a href=\"https://github.com/Sitecore/Windows-Terminal-DevEx-improvements\" rel=\"noopener noreferrer\">Terminal DevEx Improvements (⭐10)</a> - A Sitecore branded Windows Terminal and VS Code Theme and Profile to unlock helpful tooling for working with XM Cloud such as autocompletion, command history list and directory improvements.</li>\n</ul>\n<h3><p>Workflows</p>\n</h3><ul>\n<li><a href=\"https://github.com/ivansharamok/DynamicWorkflows\" rel=\"noopener noreferrer\">DynamicWorkflows (⭐2)</a> - Rule Engine-based workflow management tool.</li>\n</ul>\n<h3><p>xConnect and xDB</p>\n</h3><ul>\n<li><a href=\"https://github.com/lowedown/xConnectHelper\" rel=\"noopener noreferrer\">XConnectHelper (⭐23)</a> - A Swiss Army Knife for debugging xConnect. Features: Insight into current tracking session data; Show goals and events that were triggered on the last page view; Status checker that validates your xConnect setup (connections, certificates, settings); Set identifiers and basic contact data in the current session; Flush current session for immediate processing.</li>\n</ul>\n",
      "date_published": "2024-02-02T07:13:14.000Z",
      "date_modified": "2024-02-02T07:13:14.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/mahseema/awesome-ai-tools/",
      "title": "Awesome Ai Tools",
      "_slug": "mahseema/awesome-ai-tools/",
      "_filepath": "/content/mahseema/awesome-ai-tools/README.md",
      "url": "https://www.trackawesomelist.com/mahseema/awesome-ai-tools/",
      "summary": "2 awesome projects updated",
      "content_text": "\n\n### Audio / Phone Calls\n\n*   [AICaller.io](https://aicaller.io/?ref=v) - AICaller is a simple-to-use automated bulk calling solution that uses the latest Generative AI technology to trigger phone calls for you and get things done. It can do things like lead qualification, data gathering over phone calls, and much more. It comes with a powerful API, low cost pricing and free trial.\n\n### Other / Music\n\n*   [GradGPT](https://www.gradgpt.com/) - AI tools to simplify college applications. Review applications, draft essays, find universities and requirements and more.",
      "content_html": "<h3><p>Audio / Phone Calls</p>\n</h3><ul>\n<li><a href=\"https://aicaller.io/?ref=v\" rel=\"noopener noreferrer\">AICaller.io</a> - AICaller is a simple-to-use automated bulk calling solution that uses the latest Generative AI technology to trigger phone calls for you and get things done. It can do things like lead qualification, data gathering over phone calls, and much more. It comes with a powerful API, low cost pricing and free trial.</li>\n</ul>\n<h3><p>Other / Music</p>\n</h3><ul>\n<li><a href=\"https://www.gradgpt.com/\" rel=\"noopener noreferrer\">GradGPT</a> - AI tools to simplify college applications. Review applications, draft essays, find universities and requirements and more.</li>\n</ul>\n",
      "date_published": "2024-02-02T07:01:51.000Z",
      "date_modified": "2024-02-02T10:14:27.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/kdeldycke/awesome-engineering-team-management/",
      "title": "Awesome Engineering Team Management",
      "_slug": "kdeldycke/awesome-engineering-team-management/",
      "_filepath": "/content/kdeldycke/awesome-engineering-team-management/README.md",
      "url": "https://www.trackawesomelist.com/kdeldycke/awesome-engineering-team-management/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Engineering / Technology\n\n*   [Industry Data Models](https://web.archive.org/web/20220330034214/http://databaseanswers.org/data_models/) - A huge list of database templates collected over 25 years by Barry Williams to represent any business process.",
      "content_html": "<h3><p>Engineering / Technology</p>\n</h3><ul>\n<li><a href=\"https://web.archive.org/web/20220330034214/http://databaseanswers.org/data_models/\" rel=\"noopener noreferrer\">Industry Data Models</a> - A huge list of database templates collected over 25 years by Barry Williams to represent any business process.</li>\n</ul>\n",
      "date_published": "2024-02-02T05:40:30.000Z",
      "date_modified": "2024-02-02T05:40:30.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/tvvocold/FOSS-for-Dev/",
      "title": "FOSS for Dev",
      "_slug": "tvvocold/FOSS-for-Dev/",
      "_filepath": "/content/tvvocold/FOSS-for-Dev/README.md",
      "url": "https://www.trackawesomelist.com/tvvocold/FOSS-for-Dev/",
      "summary": "6 awesome projects updated",
      "content_text": "\n\n### Collaboration Tools\n\n*   [Tolgee](https://tolgee.io) - Developer & translator friendly web-based localization platform\n\n### Security and PKI\n\n*   [Selefra (⭐537)](https://github.com/selefra/selefra) - An open-source policy-as-code software that provides analytics for multi-cloud and SaaS.\n\n### PaaS\n\n*   [Preevy (⭐2.1k)](https://github.com/livecycle/preevy) - Provision preview environments for docker compose applications with minimal configuration\n*   [Zeabur](https://zeabur.com) - deploy your full stack apps and databases with one click\n\n### Backend\n\n*   [Hook0](https://www.hook0.com/) Webhooks-as-a-service (WaaS) for developers to send and manage webhooks\n*   [Dokku](https://dokku.com/) - Heroku like environment\n*   [Keploy](https://www.keploy.io/) - A  developer-centric backend testing tool which makes backend tests with built-in-mocks, faster than unit tests, from user traffic\n\n### Mail server\n\n*   [WildDuck Email Server](https://wildduck.email/) - nodejs application to send emails (built for scale (needs more hand work to make it work)\n\n### Environment Manager Tools\n\n*   [DEM](https://axemsolutions.io/dem_doc/index.html) - DEM (Development Environment Manager) is an open source command line tool to manage containerized Development Environments.",
      "content_html": "<h3><p>Collaboration Tools</p>\n</h3><ul>\n<li><a href=\"https://tolgee.io\" rel=\"noopener noreferrer\">Tolgee</a> - Developer &amp; translator friendly web-based localization platform</li>\n</ul>\n<h3><p>Security and PKI</p>\n</h3><ul>\n<li><a href=\"https://github.com/selefra/selefra\" rel=\"noopener noreferrer\">Selefra (⭐537)</a> - An open-source policy-as-code software that provides analytics for multi-cloud and SaaS.</li>\n</ul>\n<h3><p>PaaS</p>\n</h3><ul>\n<li><a href=\"https://github.com/livecycle/preevy\" rel=\"noopener noreferrer\">Preevy (⭐2.1k)</a> - Provision preview environments for docker compose applications with minimal configuration</li>\n</ul>\n<ul>\n<li><a href=\"https://zeabur.com\" rel=\"noopener noreferrer\">Zeabur</a> - deploy your full stack apps and databases with one click</li>\n</ul>\n<h3><p>Backend</p>\n</h3><ul>\n<li><a href=\"https://www.hook0.com/\" rel=\"noopener noreferrer\">Hook0</a> Webhooks-as-a-service (WaaS) for developers to send and manage webhooks</li>\n</ul>\n<ul>\n<li><a href=\"https://dokku.com/\" rel=\"noopener noreferrer\">Dokku</a> - Heroku like environment</li>\n</ul>\n<ul>\n<li><a href=\"https://www.keploy.io/\" rel=\"noopener noreferrer\">Keploy</a> - A  developer-centric backend testing tool which makes backend tests with built-in-mocks, faster than unit tests, from user traffic</li>\n</ul>\n<h3><p>Mail server</p>\n</h3><ul>\n<li><a href=\"https://wildduck.email/\" rel=\"noopener noreferrer\">WildDuck Email Server</a> - nodejs application to send emails (built for scale (needs more hand work to make it work)</li>\n</ul>\n<h3><p>Environment Manager Tools</p>\n</h3><ul>\n<li><a href=\"https://axemsolutions.io/dem_doc/index.html\" rel=\"noopener noreferrer\">DEM</a> - DEM (Development Environment Manager) is an open source command line tool to manage containerized Development Environments.</li>\n</ul>\n",
      "date_published": "2024-02-02T05:00:33.000Z",
      "date_modified": "2024-02-02T05:04:23.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/ligurio/awesome-ci/",
      "title": "Awesome Ci",
      "_slug": "ligurio/awesome-ci/",
      "_filepath": "/content/ligurio/awesome-ci/README.md",
      "url": "https://www.trackawesomelist.com/ligurio/awesome-ci/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n- Name: [Dagger](https://dagger.io/)\n\n  Description: Application Delivery as Code that Runs Anywhere\n\n  Features: \n\n  Supported repositories: GitHub, GitLab, Gitea\n\n  Documentation: [Documentation](https://docs.dagger.io/)\n\n  Price: [Open Source (⭐14k)](https://github.com/dagger/dagger)\n\n  Stars: \n\n",
      "content_html": "<ul>\n<li><p>Name: <a href=\"https://dagger.io/\" rel=\"noopener noreferrer\">Dagger</a></p>\n<p>Description: Application Delivery as Code that Runs Anywhere</p>\n<p>Features:</p>\n<p>Supported repositories: GitHub, GitLab, Gitea</p>\n<p>Documentation: <a href=\"https://docs.dagger.io/\" rel=\"noopener noreferrer\">Documentation</a></p>\n<p>Price: <a href=\"https://github.com/dagger/dagger\" rel=\"noopener noreferrer\">Open Source (⭐14k)</a></p>\n<p>Stars:</p>\n</li>\n</ul>\n",
      "date_published": "2024-02-02T04:53:54.000Z",
      "date_modified": "2024-02-02T04:53:54.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/TheComputerM/awesome-svelte/",
      "title": "Awesome Svelte",
      "_slug": "TheComputerM/awesome-svelte/",
      "_filepath": "/content/TheComputerM/awesome-svelte/README.md",
      "url": "https://www.trackawesomelist.com/TheComputerM/awesome-svelte/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Miscellaneous\n\n*   [css-3d-progress (⭐3)](https://github.com/rofixro/css-3d-progress) - A 3D Progress Bar component",
      "content_html": "<h3><p>Miscellaneous</p>\n</h3><ul>\n<li><a href=\"https://github.com/rofixro/css-3d-progress\" rel=\"noopener noreferrer\">css-3d-progress (⭐3)</a> - A 3D Progress Bar component</li>\n</ul>\n",
      "date_published": "2024-02-02T01:11:49.000Z",
      "date_modified": "2024-02-02T01:11:49.000Z"
    }
  ]
}
