{
  "version": "https://jsonfeed.org/version/1",
  "icon": "https://www.trackawesomelist.com/icon.png",
  "favicon": "https://www.trackawesomelist.com/favicon.ico",
  "language": "en",
  "title": "Awesome List Updates on Sep 29, 2023",
  "_site_title": "Track Awesome List",
  "description": "7 awesome lists updated today.",
  "_seo_title": "Awesome List Updates on Sep 29, 2023 - Track Awesome List",
  "feed_url": "https://www.trackawesomelist.com/feed.json",
  "home_page_url": "https://www.trackawesomelist.com",
  "items": [
    {
      "id": "https://www.trackawesomelist.com/ripienaar/free-for-dev/",
      "title": "Free for Dev",
      "_slug": "ripienaar/free-for-dev/",
      "_filepath": "/content/ripienaar/free-for-dev/README.md",
      "url": "https://www.trackawesomelist.com/ripienaar/free-for-dev/",
      "summary": "42 awesome projects updated",
      "content_text": "\n\n### Cloud management solutions\n\n*   [Cloud 66](https://www.cloud66.com/) - Free for personal projects (includes one deployment server, one static site), Cloud 66 gives you everything you need to build, deploy, and grow your applications on any cloud without the headache of the “server stuff.”.\n*   [scalr.com](https://scalr.com/) - Scalr is a Terraform Automation and COllaboration (TACO) product used to better collaboration and automation on infrastructure and configurations managed by Terraform. Full Terraform CLI support, OPA integration, and a hierarchical configuration model. No SSO tax. All features are included. Use up to 50 runs/month for free.\n\n### Source Code Repos\n\n*   [codebasehq.com](https://www.codebasehq.com/) — One free project with 100 MB space and two users\n*   [OSDN](https://osdn.net/) - OSDN.net is a free-of-charge service for open-source software developers, offering SVN/Git/Mercurial/Bazaar/CVS repositories.\n*   [pijul.com](https://pijul.com/) - Unlimited free and open source distributed version control system. Its distinctive feature is based on a sound theory of patches, which makes it easy to learn, use, and distribute. Solves many problems of git/hg/svn/darcs.\n\n### APIs, Data, and ML\n\n*   [Abstract API](https://www.abstractapi.com) — API suite for various use cases, including IP geolocation, gender detection, or email validation.\n*   [APITemplate.io](https://apitemplate.io) - Auto-generate images and PDF documents with a simple API or automation tools like Zapier & Airtable. No CSS/HTML is required. The free plan comes with 50 images/month and three templates.\n*   [Beeceptor](https://beeceptor.com) - Mock a rest API in seconds, fake API response and much more. Free 50 requests per day, public dashboard, open endpoints (anyone with a dashboard link can view submissions and answers).\n*   [CometML](https://www.comet.com/site/) - The MLOps platform for experiment tracking, model production management, model registry, and complete data lineage, covering your workflow from training to production. Free for individuals and academics.\n*   [CraftMyPDF](https://craftmypdf.com) - Auto-Generate PDF documents from reusable templates with a drop-and-drop editor and a simple API. The free plan comes with 100 PDFs/month and three templates.\n*   [CurlHub](https://curlhub.io) — Proxy service for inspecting and debugging API calls. The free plan includes 10,000 requests per month.\n*   [CurrencyScoop](https://currencyscoop.com) - Realtime currency data API for fintech apps. The free plan includes 5,000 calls per month.\n*   [Data Fetcher](https://datafetcher.com) - Connect Airtable to any application or API with no code. Postman-like interface for running API requests in Airtable. Pre-built integrations with dozens of apps. The free plan includes 100 runs per month.\n*   [DB-IP](https://db-ip.com/api/free) - Free IP geolocation API with 1k request per IP per day.lite database under the CC-BY 4.0 License is free too.\n*   [DB Designer](https://www.dbdesigner.net/) — Cloud-based Database schema design and modeling tool with a free starter plan of 2 Database models and ten tables per model.\n*   [DeepAR](https://developer.deepar.ai) — Augmented reality face filters for any platform with one SDK. The free plan provides up to 10 monthly active users (MAU) and tracks up to 4 faces\n*   [dreamfactory.com](https://dreamfactory.com/) — Open source REST API backend for mobile, web, and IoT applications. Hook up any SQL/NoSQL database, file storage system, or external service, and it instantly creates a comprehensive REST API platform with live documentation and user management.\n*   [DynamicDocs](https://advicement.io) - Generate PDF documents with JSON to PDF API based on LaTeX templates. The free plan allows 50 API calls per month and access to a library of templates.\n*   [Export SDK](https://exportsdk.com) - PDF generator API with drag-and-drop template editor that provides an SDK and no-code integrations. The free plan has 250 monthly pages, unlimited users, and three templates.\n*   [FraudLabs Pro](https://www.fraudlabspro.com) — Screen an order transaction for credit card payment fraud. This REST API will detect all possible fraud traits based on the input parameters of an order. The Free Micro plan has 500 transactions per month.\n*   [GeoDataSource](https://www.geodatasource.com) — Location search service looks up city names using latitude and longitude coordinates. Free API queries up to 500 times per month.\n*   [Glitterly](https://glitterly.app/) - Programmatically generate dynamic images from base templates. Restful API and nocode integrations. The free tier comes with 50 images/month and five templates.\n*   [ipaddress.sh](https://ipaddress.sh) — Simple service to get a public IP address in different [formats](https://about.ipaddress.sh/).\n*   [ipbase.com](https://ipbase.com) - IP Geolocation API - Forever free plan that spans 150 monthly requests.\n*   [IP2Location](https://www.ip2location.com) — Freemium IP geolocation service. LITE database is available for free download. Import the database in the server and perform a local query to determine the city, coordinates, and ISP information.\n*   [ipapi](https://ipapi.co/) - IP Address Location API by Kloudend, Inc - A reliable geolocation API built on AWS, trusted by Fortune 500. The free tier offers 30k lookups/month (1k/day) without signup.\n*   [JSON2Video](https://json2video.com) - A video editing API to automate video marketing and social media videos, programmatically or with no code.\n*   [JSON IP](https://getjsonip.com) — Returns the Public IP address of the client it is requested from. No registration is required for the free tier. Using CORS, data can be requested using client-side JS directly from the browser. Useful for services monitoring change in client and server IPs. Unlimited Requests.\n*   [konghq.com](https://konghq.com/) — API Marketplace and powerful private and public API tools. With the free tier, some features such as monitoring, alerting, and support, are limited.\n*   [Lightly](https://www.lightly.ai/) — Improve your machine-learning models by using the correct data. Use datasets of up to 1000 samples for free.\n*   [Meteosource Weather API](https://www.meteosource.com/) — global weather API for current and forecasted weather data. Forecasts are based on a machine learning combination of more weather models to achieve better accuracy. The free plan comes with 400 calls per day.\n*   [Mockfly](https://www.mockfly.dev/) — Mockfly is a trusted development tool for API mocking and feature flag management. Quickly generate and control mock APIs with an intuitive interface. The free tier offers 500 requests per day.\n*   [Mocki](https://mocki.io) - A tool that lets you create mock GraphQL and REST APIs synced to a GitHub repository. Simple REST APIs are free to develop and use without signup.\n*   [Mocko.dev](https://mocko.dev/) — Proxy your API, choose which endpoints to mock in the cloud and inspect traffic, for free. Speed up your development and integration tests.\n*   [Mocky](https://designer.mocky.io/) - A simple web app to generate custom HTTP responses for mocking HTTP requests. Also available as [open source (⭐2.1k)](https://github.com/julien-lafont/Mocky).\n*   [microenv.com](https://microenv.com) —  Create fake REST API for developers with the possibility to generate code and app in a docker container.\n*   [parsehub.com](https://parsehub.com/) — Extract data from dynamic sites, turn dynamic websites into APIs, five projects free.\n*   [pdfEndpoint.com](https://pdfendpoint.com) - Effortlessly convert HTML or URLs to PDF with a simple API. One hundred conversions per month for free.\n*   [Preset Cloud](https://preset.io/) - A hosted Apache Superset service. Forever free for teams of up to 5 users, featuring unlimited dashboards and charts, a no-code chart builder, and a collaborative SQL editor.\n*   [RequestBin.com](https://requestbin.com) — Create a free endpoint to which you can send HTTP requests. Any HTTP requests sent to that endpoint will be recorded with the associated payload and headers so you can observe recommendations from webhooks and other services.\n*   [ROBOHASH](https://robohash.org/) - Web service to generate unique and cool images from any text.\n*   [Scraper's Proxy](https://scrapersproxy.com) — Simple HTTP proxy API for scraping. Scrape anonymously without having to worry about restrictions, blocks, or captchas. First 100 successful scrapes per month free including javascript rendering (more available if you contact support).\n*   [SerpApi](https://serpapi.com/) - Real-time search engine scraping API. Returns structured JSON results for Google, YouTube, Bing, Baidu, Walmart, and many other machines. The free plan includes 100 successful API calls per month.\n*   [Sofodata](https://www.sofodata.com/) - Create secure RESTful APIs from CSV files. Upload a CSV file and instantly access the data via its API allowing faster application development. The free plan includes 2 APIs and 2,500 API calls per month. You don't need a credit card.\n*   [Stoplight](https://stoplight.io/) - Saas for collaboratively designing and documenting for APIs. The free plan offers free design, mocking, and documentation tools.\n*   [TinyMCE](https://www.tiny.cloud) - rich text editing API. Core features are free for unlimited usage.\n*   [Webhook Store](https://www.openwebhook.io) - Tool for storing third-party webhooks and debug them on localhost (ngrok style). Open source and self-hostable. Free personal domain *username*.github.webhook.store, free public domains *anything*.webhook.store.\n*   [Zenscrape](https://zenscrape.com/web-scraping-api) — Web scraping API with headless browsers, residentials IPs, and straightforward pricing. One thousand free API calls/month and extra credits for students and non-profits.\n\n### Screenshot APIs\n\n*   [microlink.io](https://microlink.io/) – It turns any website into data such as metatags normalization, beauty link previews, scraping capabilities, or screenshots as a service. 250 requests/day every day free.\n*   [ApiFlash](https://apiflash.com) — A screenshot API based on Aws Lambda and Chrome. Handles full page, captures timing, and viewport dimensions.\n*   [ScreenshotAPI.net](https://screenshotapi.net/) - Screenshot API uses a straightforward API call to generate screenshots of any website. Built to scale and hosted on Google Cloud. Offers 100 free screenshots per month.\n*   [Webshrinker.com](https://webshrinker.com) — Web Shrinker provides website screenshots and domain intelligence API services. Free 100 requests/month.\n\n### Tools for Teams and Collaboration\n\n*   [3Cols](https://3cols.com/) - A free cloud-based code snippet manager for personal and collaborative code.\n*   [Braid](https://www.braidchat.com/) — Chat app designed for teams. Free for public access group, unlimited users, history, and integrations. also, it provides a self-hostable open-source version.\n*   [Calendly](https://calendly.com) — Calendly is the tool for connecting and scheduling meetings. The free plan provides 1 Calendar connection per user and Unlimited sessions. Desktop and Mobile apps are also offered.\n*   [Telegram](https://telegram.org/) — Telegram is for everyone who wants fast, reliable messaging and calls. Business users and small teams may like the large groups, usernames, desktop apps, and powerful file-sharing options.\n*   [Duckly](https://duckly.com/) — Talk and collaborate in real time with your team. Pair programming with IDE, terminal sharing, voice, video, and screen sharing. Free for small teams.\n*   [Dyte](https://dyte.io) - The most developer-friendly live video & audio SDK, featuring collaborative plugins to enhance productivity and engagement. The free tier includes monthly 10,000 minutes of live video/audio usage.\n*   [Fibery](https://fibery.io/) — Connected workspace platform. Free for single users, up to 2 GB disk space.\n*   [gokanban.io](https://gokanban.io) - Syntax-based, no registration Kanban Board for fast use. Free with no limitations.\n*   [GitDailies](https://gitdailies.com) - Daily reports of your team's Commit and Pull Request activity on GitHub. Includes Push visualizer, peer recognition system, and custom alert builder. The free tier has unlimited users, three repos, and 3 alert configs.\n*   [gitter.im](https://gitter.im/) — Chat, for GitHub. Unlimited public and private rooms, free for teams of up to 25\n*   [Igloo](https://www.igloosoftware.com/) — Internal portal for sharing documents, blogs, calendars, etc. Free for up to 10 users.\n*   [Keybase](https://keybase.io/) — Keybase is a FOSS alternative to Slack; it keeps everyone's chats and files safe, from families to communities to companies.\n*   [/meet for Slack](https://meetslack.com) - Start Google Meetings directly from Slack by using /meet in any channel, group, or DM. Free without any limitations.\n*   [Livecycle](https://www.livecycle.io/) — Livecycle is an inclusive collaboration platform that makes workflows frictionless for cross-functional product teams and open-source projects.\n*   [meet.jit.si](https://meet.jit.si/) — One-click video conversations, and screen sharing, for free\n*   [Miro](https://miro.com/) - Scalable, secure, cross-device, and enterprise-ready collaboration whiteboard for distributed teams. With a freemium plan.\n*   [Notion](https://www.notion.so/) - Notion is a note-taking and collaboration application with markdown support that integrates tasks, wikis, and databases. The company describes the app as an all-in-one workspace for note-taking, project management and task management. In addition to cross-platform apps, it can be accessed via most web browsers.\n*   [Nuclino](https://www.nuclino.com) - A lightweight and collaborative wiki for all your team's knowledge, docs, and notes. Free plan with all essential features, up to 50 items, and 5GB storage.\n*   [OnlineInterview.io](https://onlineinterview.io/) - Free code interview platform with embedded video chat, drawing board, and online code editor where you can compile and run your code on the browser. You can create a remote interview room with just one click.\n*   [Quidlo Timesheets](https://www.quidlo.com/timesheets) - A simple timesheet and time tracking app for teams. The free plan has time tracking and generating reports features for up to 10 users.\n*   [PageShare.dev](https://www.pageshare.dev) - Adds visual review capabilities into GitHub Pull Requests with no need to deploy websites. Free for up to 10 pages each month and 100MB of storage in total.\n*   [Pendulums](https://pendulums.io/) - Pendulums is a free time tracking tool that helps you manage your time in a better manner with an easy-to-use interface and valuable statistics.\n*   [Raindrop.io](https://raindrop.io) - Private and secure bookmarking app for macOS, Windows, Android, iOS, and Web. Free Unlimited Bookmarks and Collaboration.\n*   [element.io](https://element.io/) — A decentralized and open-source communication tool built on Matrix. Group chats, direct messaging, encrypted file transfers, voice and video chats, and easy integration with other services.\n*   [Rocket.Chat](https://rocket.chat/) - Open-source communication platform with Omnichannel features, Matrix Federation, Bridge with others apps, Unlimited messaging, and Full messaging history.\n*   [seafile.com](https://www.seafile.com/) — Private or cloud storage, file sharing, sync, discussions. The cloud version has just 1 GB\n*   [StatusPile](https://www.statuspile.com/) - A status page of status pages. Could you track the status pages of your upstream providers?\n*   [Stickies](https://stickies.app/) - Visual collaboration app used for brainstorming, content curation, and notes. Free for up to 3 Walls, unlimited users, and 1 GB storage.\n*   [Teamhood](https://teamhood.com/) - Free Project, Task, and Issue-tracking software. Supports Kanban with Swimlanes and full Scrum implementation. Has integrated time tracking. Free for five users and three project portfolios.\n*   [Teamplify](https://teamplify.com) - improve team development processes with Team Analytics and Smart Daily Standup. Includes full-featured Time Off management for remote-first teams. Free for small groups of up to 5 users.\n*   [TeleType](https://teletype.oorja.io/) — share terminals, voice, code, whiteboard, and more. no sign-in is required for end-to-end encrypted collaboration for developers.\n*   [twist.com](https://twist.com) — An asynchronous-friendly team communication app where conversations stay organized and on-topic. Free and Unlimited plans are available. Discounts are provided for eligible teams.\n*   [tldraw.com](https://tldraw.com) —  Free open-source white-boarding and diagramming tool with intelligent arrows, snapping, sticky notes, and SVG export features. Multiplayer mode for collaborative editing. Free official VS Code extension available as well.\n*   [typetalk.com](https://www.typetalk.com/) — Share and discuss ideas with your team through instant messaging on the web or your mobile\n*   [whereby.com](https://whereby.com/) — One-click video conversations, for free (formerly known as appear.in)\n*   [windmill.dev](https://windmill.dev/) - Windmill is an open-source developer platform to quickly build production-grade multi-step automation and internal apps from minimal Python and Typescript scripts. As a free user, you can create and be a member of at most three non-premium workspaces.\n*   [vadoo.tv](https://vadoo.tv/) — Video hosting and marketing made simple. Upload videos with a single click. Record, manage, share & more. The free tier provides up to 10 videos, 1 GB of storage, and 10 GB of bandwidth/per month\n*   [userforge.com](https://userforge.com/) - Interconnected online personas, user stories and context mapping.  Helps keep design and dev in sync free for up to 3 personas and two collaborators.\n*   [wistia.com](https://wistia.com/) — Video hosting with viewer analytics, HD video delivery, and marketing tools to help understand your visitors, 25 videos, and Wistia branded player\n*   [wormhol.org](https://www.wormhol.org/) — Straightforward file sharing service. Share unlimited files up to 5GB with as many peers as you want.\n*   [zoom.us](https://zoom.us/) — Secure Video and Web conferencing add-ons available. The free plan is limited to 40 minutes.\n*   [Zulip](https://zulip.com/) — Real-time chat with a unique email-like threading model. The free plan includes 10,000 messages of search history and File storage up to 5 GB. also, it provides a self-hostable open-source version.\n*   [robocorp.com](https://robocorp.com) - Open-source stack for powering Automation Ops. Try out Cloud features and implement simple automation for free. Robot work 240 min/month, 10 Assistant runs, Storage of 100 MB.\n*   [Fleep.io](https://fleep.io/) — Fleep an alternative to Slack. It has a free plan for small teams with full message history, unlimited 1:1 conversations, 1 group conversation, and 1 GB file storage.\n*   [Chanty.com](https://chanty.com/) — Chanty is another alternative to Slack. It has a free forever plan for small teams (up to 10) with unlimited public and private conversations, searchable history, unlimited 1:1 audio calls, unlimited voice messages, ten integrations, and 20 GB storage per team.\n*   [ruttl.com](https://ruttl.com/) — The best all-in-one feedback tool to collect digital feedback and review websites, PDFs, and images.\n*   [Mattermost](https://mattermost.com/) — Secure collaboration for technical teams. Free plan with unlimited channels, playbooks, boards, users, 10GB storage, and more.\n\n### CMS\n\n*   [acquia.com](https://www.acquia.com/) — Hosting for Drupal sites. Free tier for developers. Free development tools (such as Acquia Dev Desktop) are also available.\n*   [Contentful](https://www.contentful.com/) — Headless CMS. Content management and delivery APIs in the cloud. Comes with one free Community space that includes five users, 25K records, 48 Content Types, 2 locales.\n*   [Crystallize](https://crystallize.com) — Headless PIM with ecommerce support. Built-in GraphQL API. The free version includes unlimited users, 1000 catalog items, 5 GB/month bandwidth, and 25k/month API calls.\n*   [DatoCMS](https://www.datocms.com/) - Offers free tier for small projects. DatoCMS is a GraphQL-based CMS. On the lower tier, you have 100k/month calls.\n*   [Directus](https://directus.io) — Headless CMS. A completely free and open-source platform for managing assets and database content on-prem or in the Cloud. There are no limitations or paywalls.\n*   [FrontAid](https://frontaid.io/) — Headless CMS that stores JSON content directly in your Git repository. No restrictions.\n*   [kontent.ai](https://www.kontent.ai) - A Content-as-a-Service platform that gives you all the headless CMS benefits while empowering marketers at the same time. The developer plan provides two users with unlimited projects with two environments for each, 500 content items, two languages with Delivery and Management API, and Custom elements support. You can use more detailed plans to meet your needs.\n*   [Prismic](https://www.prismic.io/) — Headless CMS. Content management interface with fully hosted and scalable API. The Community Plan provides unlimited API calls, documents, custom types, assets, and locales to one user. Everything that you need for your next project. Bigger free plans are available for Open Content/Open Source projects.\n*   [Sanity.io](https://www.sanity.io/) - Platform for structured content with an open-source editing environment and a real-time hosted data store. Unlimited projects. Unlimited admin users, three non-admin users, two datasets, 500K API CDN requests, 10GB bandwidth, and 5GB assets included for free per project.\n*   [sensenet](https://sensenet.com) - API-first headless CMS providing enterprise-grade solutions for businesses of all sizes. The Developer plan provides three users, 500 content items, three built-in roles, 25+5 content types, fully accessible REST API, document preview generation, and Office Online editing.\n*   [TinaCMS](https://tina.io/) — Replacing Forestry.io. Open source Git-backed headless CMS that supports Markdown, MDX, and JSON. The basic offer is free with two users available.\n*   [Squidex](https://squidex.io/) - Offers free tier for small projects. API / GraphQL first. Open source and based on event sourcing (versing every change automatically).\n*   [InstaWP](https://instawp.com/) - Launch a WordPress site in a few seconds. A free tier with 5 Active Sites, 500 MB Space, 48 hrs Site Expiry.\n*   [Storyblok](https://www.storyblok.com) - A Headless CMS for developers and marketers that works with all modern frameworks. The Community (free) tier offers Management API, Visual Editor, ten sources, Custom Field Types, Internationalization (unlimited languages/locales), Asset Manager (up to 2500 assets), Image Optimizing Service, Search Query, Webhook + 250GB Traffic/month included.\n\n### Code Generation\n\n*   [Appinvento](https://appinvento.io/) — AppInvento is a free No code app builder. In the automatically generated backend code, users have complete access to the source code and unlimited APIs and routes, allowing for extensive integration. The free plan includes three projects, five tables, and a Google add-on.\n*   [Metalama](https://www.postsharp.net/metalama) - Only for C#. Metalama generates the boilerplate of the code on the fly during compilation so that your source code remains clean. It is free for open-source projects, and its commercial-friendly free tier includes three aspects.\n*   [tabnine.com](https://www.tabnine.com/) — Tabnine helps developers create better software faster by providing insights learned from all the code in the world. Plugin available.\n\n### Code Quality\n\n*   [beanstalkapp.com](https://beanstalkapp.com/) — A complete workflow to write, review, and deploy code), a free account for one user, and one repository with 100 MB of storage\n*   [codacy.com](https://www.codacy.com/) — Automated code reviews for PHP, Python, Ruby, Java, JavaScript, Scala, CSS, and CoffeeScript, free for unlimited public and private repositories\n*   [Codeac.io](https://www.codeac.io/infrastructure-as-code.html?ref=free-for-dev) - Automated Infrastructure as Code review tool for DevOps integrates with GitHub, Bitbucket, and GitLab (even self-hosted). In addition to standard languages, it also analyzes Ansible, Terraform, CloudFormation, Kubernetes, and more. (open-source free)\n*   [CodeBeat](https://codebeat.co) — Automated Code Review Platform available for many languages. Free forever for public repositories with Slack and e-mail integration.\n*   [codecov.io](https://codecov.io/) — Code coverage tool (SaaS), free for Open Source and one free private repo\n*   [CodeFactor](https://www.codefactor.io) — Automated Code Review for Git. The free version includes unlimited users, public repositories, and one private repo.\n*   [dareboost](https://dareboost.com) - 5 free analysis reports for web performance, accessibility, and security each month\n*   [deepcode.ai](https://www.deepcode.ai) — DeepCode finds bugs, security vulnerabilities, performance and API issues based on AI. DeepCode's speed of analysis allows us to analyze your code in real time and deliver results when you hit the save button in your IDE. Supported languages are Java, C/C++, JavaScript, Python, and TypeScript. Integrations with GitHub, BitBucket, and GitLab. Free for open source and private repos and up to 30 developers.\n*   [DeepSource](https://deepsource.io/) - DeepSource continuously analyzes source code changes, finding and fixing issues categorized under security, performance, anti-patterns, bug-risks, documentation, and style. Native integration with GitHub, GitLab, and Bitbucket.\n*   [eversql.com](https://www.eversql.com/) — EverSQL - The #1 platform for database optimization. Gain critical insights into your database and SQL queries automatically.\n*   [reviewable.io](https://reviewable.io/) — Code review for GitHub repositories, free for public or personal repos.\n*   [webceo.com](https://www.webceo.com/) — SEO tools but with also code verifications and different types of devices\n\n### Code Search and Browsing\n\n*   [Namae](https://namae.dev/) - Search various websites like GitHub, Gitlab, Heroku, Netlify, and many more for the availability of your project name.\n*   [CodeKeep](https://codekeep.io) - Google Keep for Code Snippets. Organize, Discover, and share code snippets, featuring a powerful code screenshot tool with preset templates and a linking feature.\n\n### CI and CD\n\n*   [Argonaut](https://argonaut.dev/) - Deploy apps and infrastructure on your cloud in minutes. Support for custom and third-party app deployments on Kubernetes and Lambda environments. The free tier allows unlimited apps and deployments for 5 domains and 2 users.\n*   [buddy.works](https://buddy.works/) — A CI/CD with five free projects and one concurrent run (120 executions/month)\n*   [bytebase.com](https://www.bytebase.com/) — Database CI/CD and DevOps. Free under 20 users and ten database instances\n*   [CircleCI](https://circleci.com/) — Comprehensive free plan with all features included in a hosted CI/CD service for GitHub, GitLab, and BitBucket repositories. Multiple resource classes, Docker, Windows, Mac OS, ARM executors, local runners, test splitting, Docker Layer Caching, and other advanced CI/CD features. Free for up to 6000 minutes/month execution time, unlimited collaborators, 30 parallel jobs in private projects, and up to 80,000 free build minutes for Open Source projects.\n*   [codefresh.io](https://codefresh.io) — Free-for-Life plan: 1 build, one environment, shared servers, unlimited public repos\n*   [codeship.com](https://codeship.com/) — 100 private builds/month, five private projects, unlimited for Open Source\n*   [deploybot.com](https://www.deploybot.com/) — 1 repository with ten deployments, free for Open Source\n*   [deployhq.com](https://www.deployhq.com/) — 1 project with ten daily deployments (30 build minutes/month)\n*   [drone](https://cloud.drone.io/) - Drone Cloud enables developers to run Continuous Delivery pipelines across multiple architectures - including x86 and Arm (both 32-bit and 64-bit) - all in one place\n*   [LayerCI](https://layerci.com) — CI for full stack projects. One full stack preview environment with 5GB memory & 3 CPUs.\n*   [Make](https://www.make.com/en) — The workflow automation tool lets you connect apps and automate workflows using UI. It supports many apps and the most popular APIs. Free for public GitHub repositories, and free tier with 100 Mb, 1000 Operations, and 15 minutes of minimum interval.\n*   [Spacelift](https://spacelift.io/) - Management platform for Infrastructure as Code. Free plan features: IaC collaboration, Terraform module registry, ChatOps integration, Continuous resource compliance with Open Policy Agent, SSO with SAML 2.0, and access to public worker pools: up to 200 minutes/month\n*   [microtica.com](https://microtica.com/) - Startup environments with ready-made infrastructure components, deploy apps on AWS for free, and support your production workloads. The free tier includes 1 Environment (on your AWS account), 2 Kubernetes Services, 100 build minutes per month, and 20 monthly deployments.\n\n### Testing\n\n*   [Apptim](https://apptim.com) — A mobile testing tool that enables people without performance engineering skills to evaluate an app's performance and user experience (UX). A desktop version using your own device is 100% FREE, with unlimited tests on both iOS and Android.\n*   [Bencher](https://bencher.dev/) - A continuous benchmarking tool suite to catch CI performance regressions. Free for all public projects.\n*   [Cypress Recorder by Preflight](https://cypress.preflight.com/) - Create AI-powered Cypress Tests/POM models on your browser. It's open-source, except for the AI part. It's free for five monthly test creations with Self-healing scripts, Email, and Visual testing.\n*   [everystep-automation.com](https://www.everystep-automation.com/) — Records and replays all steps made in a web browser and creates scripts, free with fewer options\n*   [katalon.com](https://katalon.com) - Provides a testing platform that can help teams of all sizes at different levels of testing maturity, including  Katalon Studio, TestOps (+ Visual Testing free), TestCloud, and Katalon Recorder.\n*   [Keploy](https://keploy.io/) - Keploy is a functional testing toolkit for developers. Recording API calls generates E2E tests for APIs (KTests) and mocks or stubs(KMocks). It is free for Open Source projects.\n*   [Vaadin](https://vaadin.com) — Build scalable UIs in Java or TypeScript, and use the integrated tooling, components, and design system to iterate faster, design better, and simplify the development process. Unlimited Projects with five years of free maintenance.\n*   [webhook-test.com](https://webhook-test.com) - Debug and inspect webhooks and HTTP requests with a unique URL during integration. Completely free, you can create unlimited URLs and receive recommendations.\n\n### Security and PKI\n\n*   [hostedscan.com](https://hostedscan.com) — Online vulnerability scanner for web applications, servers, and networks. Ten free scans per month.\n*   [opswat.com](https://www.opswat.com/) — Security Monitoring of computers, devices, applications, configurations, Free 25 users and 30 days history users.\n*   [openapi.security](https://openapi.security/) - Free tool to quickly check the security of any OpenAPI / Swagger-based API. You don't need to sign up.\n*   [threatconnect.com](https://threatconnect.com) — Threat intelligence: It is designed for individual researchers, analysts, and organizations starting to learn about cyber threat intelligence. Free up to 3 Users\n\n### Authentication, Authorization, and User Management\n\n*   [asgardeo.io](https://wso2.com/asgardeo) - Seamless Integration of SSO, MFA, passwordless auth and more. Includes SDKs for frontend and backend apps. Free up to 1000 MAUs and five identity providers.\n\n### Management System\n\n*   [Esper](https://esper.io) — MDM and MAM for Android Devices with DevOps. One hundred devices free with one user license and 25 MB Application Storage.\n*   [jamf.com](https://www.jamf.com/) —  Device management for iPads, iPhones, and Macs, three devices free\n*   [Miradore](https://miradore.com) — Device Management service. Stay up-to-date with your device fleet and secure unlimited devices for free. The free plan offers basic features.\n*   [ploi.io](https://ploi.io/) - Server management tool to easily manage and deploy your servers & sites. Free for one server.\n\n### Log Management\n\n*   [logentries.com](https://logentries.com/) — Free up to 5 GB/month with seven days retention\n*   [loggly.com](https://www.loggly.com/) — Free for a single user, 200MB/day with seven days retention\n*   [papertrailapp.com](https://papertrailapp.com/) — 48 hours search, seven days archive, 50 MB/month\n*   [sematext.com](https://sematext.com/logsene) — Free up to 500 MB/day, seven days retention\n*   [sumologic.com](https://www.sumologic.com/) — Free up to 500 MB/day, seven days retention\n*   [logtail.com](https://logtail.com/) — ClickHouse-based SQL-compatible log management. Free up to 1 GB per month, three days retention.\n\n### Translation Management\n\n*   [Localeum](https://localeum.com) - Free up to 1000 strings, one user, unlimited languages, unlimited projects\n*   [Loco](https://localise.biz/) — Free up to 2000 translations, Unlimited translators, ten languages/project, 1000 translatable assets/project\n*   [Translized](https://translized.com) - Free up to 1000 strings, one user, unlimited languages, unlimited projects\n\n### Monitoring\n\n*   [cronitor.io](https://cronitor.io/) - Performance insights and uptime monitoring for cron jobs, websites, APIs and more. A free tier with five monitors.\n*   [deadmanssnitch.com](https://deadmanssnitch.com/) — Monitoring for cron jobs. One free snitch (monitor), more if you refer others to sign up\n*   [economize.cloud](https://economize.cloud) — Economize helps demystify cloud infrastructure costs by organizing cloud resources to optimize and report the same. Free for up to $5,000 spent on Google Cloud Platform every month.\n*   [Grafana Cloud](https://grafana.com/products/cloud/) - Grafana Cloud is a composable observability platform that integrates metrics and logs with Grafana. Free: 3 users, ten dashboards, 100 alerts, metrics storage in Prometheus and Graphite (10,000 series, 14 days retention), logs storage in Loki (50 GB of logs, 14 days retention)\n*   [netdata.cloud](https://www.netdata.cloud/) — Netdata is an open-source tool to collect real-time metrics. It's a growing product and can also be found on GitHub!\n*   [newrelic.com](https://www.newrelic.com) — New Relic observability platform built to help engineers create more perfect software. From monoliths to serverless, you can instrument everything and then analyze, troubleshoot, and optimize your entire software stack. The free tier offers 100GB/month of free data ingest, one free full-access user, and unlimited free primary users.\n*   [OnlineOrNot.com](https://onlineornot.com/) - OnlineOrNot provides uptime monitoring for websites and APIs, monitoring for cron jobs and scheduled tasks. Also provides status pages. The first five checks with a 3-minute interval are free. The free tier sends alerts via Slack, Discord, and Email.\n*   [paessler.com](https://www.paessler.com/) — Powerful infrastructure and network monitoring solution, including alerting, strong visualization capabilities, and basic reporting. Free up to 100 sensors.\n*   [sematext.com](https://sematext.com/) — Free for 24-hour metrics, unlimited servers, ten custom metrics, 500,000 custom metrics data points, unlimited dashboards, users, etc.\n*   [stathat.com](https://www.stathat.com/) — Get started with ten stats for free, no expiration\n*   [uptimetoolbox.com](https://uptimetoolbox.com/) — Free monitoring for five websites, 60-second intervals, public statuspage.\n*   [RoboMiri.com](https://robomiri.com/) - RoboMiri is a stable uptime monitor that offers a wide range of monitors: cronjob, keyword, website, port, ping. Twenty-five uptime checks with 3-minute interval checks for free. Alerts via Phone Call, SMS, Email, and Webhooks.\n*   [Wachete](https://www.wachete.com) - monitor five pages, checks every 24 hours.\n\n### Crash and Exception Handling\n\n*   [memfault.com](https://memfault.com) — Cloud device observability and debugging platform. 100 devices free for [Nordic](https://app.memfault.com/register-nordic), [NXP](https://app.memfault.com/register-nxp), and [Laird](https://app.memfault.com/register-laird) devices.\n*   [sentry.io](https://sentry.io/) — Sentry tracks app exceptions in real-time and has a small free plan. Free for 5k errors per month/ 1 user, unrestricted use if self-hosted\n\n### Email\n\n*   [Bump](https://bump.email/) - Free 10 Bump email addresses, one custom domain\n*   [EmailLabs.io](https://emaillabs.io/en) — Send up to 9,000 Emails for free every month, up to 300 emails daily.\n*   [EmailJS](https://www.emailjs.com/) – This is not an entire email server; this is just an email client that you can use to send emails right from the client without exposing your credentials, the free tier has 200 monthly requests, 2 email templates, Requests up to 50Kb, Limited contacts history.\n*   [ImprovMX](https://improvmx.com) – Free email forwarding.\n*   [EForw](https://www.eforw.com) – Free email forwarding for one domain. Receive and send emails from your domain.\n*   [mail-tester.com](https://www.mail-tester.com) — Test if the email's DNS/SPF/DKIM/DMARC settings are correct, 20 free/month.\n*   [mailcatcher.me](https://mailcatcher.me/) — Catches mail and serves it through a web interface.\n*   [Mailchimp](https://mailchimp.com/) — 500 subscribers and 1,000 emails/month free.\n*   [Mailtrap.io](https://mailtrap.io/) — Fake SMTP server for development, free plan with one inbox, 100 messages, no team member, two emails/second, no forward rules.\n*   [Mail7.io](https://www.mail7.io/) — Free Temp Email Addresses for QA Developers. Create email addresses instantly using Web Interface or API.\n*   [Outlook.com](https://outlook.live.com/owa/) - Free personal email and calendar.\n*   [pepipost.com](https://pepipost.com) — 30k emails free for the first month, then the first 100 emails/day free.\n*   [Postmark](https://postmarkapp.com/) - 100 emails/month free, unlimited DMARC weekly digests.\n\n### Feature Toggles Management Platforms\n\n*   [ConfigCat](https://configcat.com) - ConfigCat is a developer-centric feature flag service with unlimited team size, excellent support, and a reasonable price tag. Free plan up to 10 flags, two environments, 1 product, and 5 Million requests per month.\n*   [Toggled.dev](https://www.toggled.dev) - Enterprise-ready, scalable multi-regional feature toggles management platform. Free plan up to 10 flags, two environments, unlimited requests. SDK, analytics dashboard, release calendar, Slack notifications, and all other features are included in the endless free plan.\n\n### Font\n\n*   [Font Squirrel](https://www.fontsquirrel.com/) - Freeware fonts licensed for commercial work. Hand-selected these typefaces and presented them in an easy-to-use format.\n*   [Google Fonts](https://fonts.google.com/) - Many free fonts are easy and quick to install on a website via a download or a link to Google's CDN.\n*   [Fontshare](https://www.fontshare.com/) - is a free fonts service. It’s a growing collection of professional-grade fonts, 100% free for personal and commercial use.\n*   [FontsKey](https://www.fontskey.com/) - Provides free and commercial paid fonts for personal use and can enter text for quick filtering.\n\n### Forms\n\n*   [Feathery](https://feathery.io) - Powerful, developer-friendly form builder. Build signup & login, user onboarding, payment flows, complex financial applications, and more. The free plan allows up to 250 submissions/month and five active forms.\n*   [Form-Data](https://form-data.com) - No-code forms backend. Spam filter, email notification and auto-respond, webhooks, zapier, redirects, AJAX or POST, and more. The free plan offers unlimited forms, 20 submissions/month, and an additional 2000 submissions with Form-Data badge.\n*   [Formcarry.com](https://formcarry.com) - HTTP POST Form endpoint, Free plan allows 100 monthly submissions.\n*   [formingo.co](https://www.formingo.co/)- Easy HTML forms for static websites. You can start for free without registering an account. The free plan allows 500 monthly submissions and a customizable reply-to email address.\n*   [FormKeep.com](https://www.formkeep.com/) - Unlimited forms with 50 monthly submissions, spam protection, email notification, and a drag-and-drop designer that can export HTML. Additional features include custom field rules, teams, and integrations to Google Sheets, Slack, ActiveCampaign, and Zapier.\n*   [HeroTofu.com](https://herotofu.com/) - Forms backend with bot detection and encrypted archive. Forward submissions via UI to email, Slack, or Zapier. Use your own front end. No server code is required. The free plan gives unlimited forms and 100 submissions per month.\n*   [Tally.so](https://tally.so/) - 99% of all the features are free. The free tier lets you have: unlimited forms, unlimited submissions, email notifications, form logic, collect payments, file upload, custom thank you page, and many more.\n*   [Hyperforms.app](https://hyperforms.app/) — Create a form to email and more in seconds and without backend code. The Personal account gives you up to 50 monthly form submissions for free.\n*   [Kwes.io](https://kwes.io/) - Feature rich form endpoint. Works great with static sites. The free plan includes up to 1 website with up to 50 monthly submissions.\n*   [Pageclip](https://pageclip.co/) - The free plan allows one site, one form, and 1,000 monthly submissions.\n*   [staticforms.xyz](https://www.staticforms.xyz/) - Integrate HTML forms easily without any server-side code for free. After the user submits the form, an email with the form content will be sent to your registered address.\n*   [stepFORM.io](https://stepform.io) - Quiz and Form Builder. The free plan has five forms, up to 3 steps per form, and 50 monthly responses.\n*   [Typeform.com](https://www.typeform.com/) — Include beautifully designed forms on websites.  The free plan allows only ten fields per form and 100 monthly responses.\n*   [WaiverStevie.com](https://waiverstevie.com) - Electronic Signature platform with a REST API. You can receive notifications with webhooks. Free plan watermarks signed documents but allow unlimited envelopes + signatures.\n*   [WebAsk](https://webask.io) - Survey and Form Builder. The free plan has three surveys per account, 100 monthly responses, and ten elements per survey.\n*   [SimplePDF.eu](https://simplepdf.eu/embed) - Embed a PDF editor on your website and turn any PDF into a fillable form. The free plan allows unlimited PDFs with three submissions per PDF.\n\n### CDN and Protection\n\n*   [Stellate](https://stellate.co/) - Stellate is a blazing-fast, reliable CDN for your GraphQL API and free for two services.\n*   [jsdelivr.com](https://www.jsdelivr.com/) — A free, fast, and reliable open-source CDN. Supports npm, GitHub, WordPress, Deno, and more.\n*   [toranproxy.com](https://toranproxy.com/) — Proxy for Packagist and GitHub. Never fail CD. Free for personal use, one developer, no support\n\n### PaaS\n\n*   [anvil.works](https://anvil.works) - Web app development with nothing but Python. Free tier with unlimited apps and 30-second timeouts.\n*   [configure.it](https://www.configure.it/) — Mobile app development platform, free for two projects, limited features but no resource limits\n*   [gigalixir.com](https://gigalixir.com/) - Gigalixir provides one free instance that never sleeps and a free-tier PostgreSQL database limited to 2 connections, 10, 000 rows and no backups for Elixir/Phoenix apps.\n*   [Glitch](https://glitch.com/) — Free public hosting with code sharing and real-time collaboration features. The free plan has a 1000-hours/month limit.\n*   [pipedream.com](https://pipedream.com) - An integration platform built for developers. Develop any workflow based on any trigger. Workflows are code you can run [for free](https://docs.pipedream.com/pricing/). No server or cloud resources to manage.\n*   [Meteor Cloud](https://www.meteor.com/cloud) — Galaxy hosting. Meteor's platform-as-a-service for Meteor apps includes free MongoDB Shared Hosting and automatic SSL.\n*   [Northflank](https://northflank.com) — Build and deploy microservices, jobs, and managed databases with a powerful UI, API & CLI. Seamlessly scale containers from version control and external Docker registries. The free tier includes two services, two cron jobs and 1 database.\n*   [Zeabur](https://zeabur.com) - Deploy your services with one click. Free for three services, with US$ 5 free credits per month.\n\n### BaaS\n\n*   [Activepieces](https://www.activepieces.com) - Build automation flows to connect several apps together in your app's backend. For example, send a Slack message or add a Google Sheet row when an event fires in your app. Free up to 5,000 tasks per month.\n*   [BMC Developer Program](https://developers.bmc.com/site/global/bmc_helix_platform/program/overview/index.gsp) — The BMC Developer Program provides documentation and resources to build and deploy digital innovations for your enterprise. Access to a comprehensive, personal sandbox that includes the platform, SDK, and a library of components that can be used to build and tailor apps.\n*   [convex.dev](https://convex.dev/) - Reactive backend as a service, hosting your data (documents with relationships & serializable ACID transactions), serverless functions, and WebSockets to stream updates to various clients. Free for small projects - up to 1M records, 5M monthly function calls.\n*   [paraio.com](https://paraio.com) — Backend service API with flexible authentication, full-text search and caching. Free for one app, 1GB of app data.\n*   [zapier.com](https://zapier.com/) — Connect the apps you use to automate tasks. Five zaps every 15 minutes and 100 tasks/month\n*   [Integrately](https://integrately.com) — Automate tedious tasks with a single click. Free 100 Tasks, 15 Minute\n    Update Time, five active automations, webhooks.\n\n### Web Hosting\n\n*   [dAppling Network](https://www.dappling.network/) - Decentralized web hosting platform for Web3 frontends focusing on increasing uptime and security and providing an additional access point for users.\n*   [DigitalOcean](https://www.digitalocean.com/pricing) - Build and deploy three static sites for free on the App Platform Starter tier.\n*   [Fenix Web Server](https://preview.fenixwebserver.com) - A developer desktop app for hosting sites locally and sharing them publically (in real-time). Work however you like, using its beautiful user interface, API, and/or CLI.\n*   [Lecturify](https://www.lecturify.net/index.en.html) - Web hosting with SFPT access for file upload and download, php available.\n*   [Netlify](https://www.netlify.com/) — Builds, deploys and hosts static site/app free for 100 GB data and 100 GB/month bandwidth.\n*   [pantheon.io](https://pantheon.io/) — Drupal and WordPress hosting, automated DevOps, and scalable infrastructure. Free for developers and agencies. No custom domain.\n*   [readthedocs.org](https://readthedocs.org/) — Free documentation hosting with versioning, PDF generation, and more\n*   [SourceForge](https://sourceforge.net/) — Find, Create, and Publish Open Source software for free\n*   [tilda.cc](https://tilda.cc/) — One site, 50 pages, 50 MB storage, only the main pre-defined blocks among 170+ available, no fonts, no favicon, and no custom domain\n*   [Versoly](https://versoly.com/) — SaaS-focused website builder - unlimited websites, 70+ blocks, five templates, custom CSS, favicon, SEO and forms. No custom domain.\n*   [Qoddi](https://qoddi.com) - PaaS service similar to Heroku with a developer-centric approach and all-inclusive features. Free tier for static assets, staging, and developer apps.\n*   [FreeFlarum](https://freeflarum.com/) - Community-powered free Flarum hosting for up to 250 users (donate to remove the watermark from the footer).\n*   [MDB GO](https://mdbgo.com/) - Free hosting for one project with two weeks Container TTL, 500 MB RAM per project, SFTP - 1G disk space.\n*   [Patr Cloud](https://patr.cloud/) — An easy-to-use cloud platform, among its paid services it offers to host three static sites for free.\n\n### DNS\n\n*   [1.1.1.1](https://developers.cloudflare.com/1.1.1.1/) - Free public DNS Resolver, which is fast and secure (encrypt your DNS query), provided by Cloudflare. Useful to bypass your internet provider's DNS blocking, prevent DNS query spying, and [to block adult & malware content](https://developers.cloudflare.com/1.1.1.1/1.1.1.1-for-families). It can also be used [via API](https://developers.cloudflare.com/1.1.1.1/encrypted-dns/dns-over-https/make-api-requests). Note: Just a DNS resolver, not a DNS hoster.\n*   [1984.is](https://www.1984.is/product/freedns/) — Free DNS service with API and lots of other free DNS features included.\n*   [freedns.afraid.org](https://freedns.afraid.org/) — Free DNS hosting. Also, provide free subdomains based on numerous public user [contributed domains](https://freedns.afraid.org/domain/registry/). Get free subdomains from the \"Subdomains\" menu after signing up.\n*   [luadns.com](https://www.luadns.com/) — Free DNS hosting, three domains, all features with reasonable limits\n*   [namecheap.com](https://www.namecheap.com/domains/freedns/) — Free DNS. No limit on the number of domains\n*   [nextdns.io](https://nextdns.io) - DNS-based firewall, 300K free queries monthly\n*   [noip](https://www.noip.com/) — a dynamic DNS service that allows up to 3 hostnames free with confirmation every 30 days\n*   [zilore.com](https://zilore.com/en/dns) — Free DNS hosting for 5 domains.\n*   [zonewatcher.com](https://zonewatcher.com) — Automatic backups and DNS change monitoring. One domain free\n\n### IaaS\n\n*   [filebase.com](https://filebase.com/) - S3 Compatible Object Storage Powered by Blockchain. 5 GB free storage for an unlimited duration.\n*   [C2 Object Storage](https://c2.synology.com/en-us/pricing/object-storage) - S3 compatibility object storage. 15 GB free storage and 15 GB downloads per month.\n\n### Storage and Media Processing\n\n*   [resmush.it](https://resmush.it) — reSmush.it is a FREE API that provides image optimization. reSmush.it has been implemented on the most common CMS such as WordPress, Drupal, or Magento. reSmush.it is the most used image optimization API with more than seven billion images already treated, and it is still Free of charge.\n\n### Design and UI\n\n*   [Float UI](https://floatui.com/) - free web development tool for quickly creating modern, responsive websites with sleek design, even for non-designers.\n*   [Backlight](https://backlight.dev/) — With collaboration between developers and designers at heart, Backlight is a complete coding platform where teams build, document, publish, scale, and maintain Design Systems. The free plan allows up to 3 editors to work on one design system with unlimited viewers.\n*   [BoxySVG](https://boxy-svg.com/app) — A free installable Web app for drawing SVGs and exporting in SVG, PNG, jpeg, and other formats.\n*   [Circum Icons](https://circumicons.com) - Consistent open-source icons such as SVG for React, Vue, and Svelte.\n*   [clevebrush.com](https://www.cleverbrush.com/) — Free Graphics Design / Photo Collage App. Also, they offer paid integration of it as a component.\n*   [cloudconvert.com](https://cloudconvert.com/) — Convert anything to anything. Two hundred eight supported formats including videos and gifs.\n*   [Branition](https://branition.com/colors) - Hand-curated color pallets best fitted for brands.\n*   [css-gradient.com](https://www.css-gradient.com/) - Free tool to quickly generate custom cross-browser CSS gradients. In RGB and HEX format.\n*   [easyvectors.com](https://easyvectors.com/) — EasyVectors.com is a free SVG vector art stock. Download the best vector graphics absolutely for free.\n*   [figma.com](https://www.figma.com) — Online, collaborative design tool for teams; free tier includes unlimited files and viewers with a max of 2 editors and three projects.\n*   [framer.com](https://www.framer.com/) - Framer helps you iterate and animate interface ideas for your next app, website, or product—starting with powerful layouts. For anyone validating Framer as a professional prototyping tool: unlimited viewers, up to 2 editors, and up to 3 projects.\n*   [landen.co](https://www.landen.co) — Generate, edit, and publish beautiful websites and landing pages for your startup. All without code. The free tier allows you to have one website, fully customizable and published on the web.\n*   [Lorem Picsum](https://picsum.photos/) - A Free tool, easy to use, stylish placeholders. After our URL, add your desired image size (width & height), and you'll get a random image.\n*   [LottieFiles](https://lottiefiles.com/) - The world’s largest online platform for the world’s most miniature animation format for designers, developers, and more. Access Lottie animation tools and plugins for Android, iOS, and Web.\n*   [marvelapp.com](https://marvelapp.com/) — Design, prototyping, and collaboration, free plan limited to one user and project.\n*   [Mindmup.com](https://www.mindmup.com/) — Unlimited mind maps for free and store them in the cloud. Your mind maps are available everywhere, instantly, from any device.\n*   [Mockplus iDoc](https://www.mockplus.com/idoc) - Mockplus iDoc is a powerful design collaboration & handoff tool. Free Plan includes three users and five projects with all features available.\n*   [Octopus.do](https://octopus.do) — Visual sitemap builder. Build your website structure in real time and rapidly share it to collaborate with your team or clients.\n*   [Penpot](https://penpot.app) - Web-based, open-source design and prototyping tool. Supports SVG. Completely free.\n*   [pexels.com](https://www.pexels.com/) - Free stock photos for commercial use. Has a free API that allows you to search photos by keywords.\n*   [Plasmic](https://www.plasmic.app/) - A fast, easy-to-use, robust web design tool and page builder that integrates into your codebase. Build responsive pages or complex components; optionally extend with code; and publish to production sites and apps.\n*   [Pravatar](https://pravatar.cc/) - Generate a random/placeholder fake avatar whose URL can be directly hot-linked in your web/app.\n*   [Proto.io](https://www.proto.io) - Create fully interactive UI prototypes without coding. The free tier is available when the free trial ends. The free tier includes one user, one project, five prototypes, 100MB of online storage, and a preview of the proto.io app.\n*   [Rive](https://rive.app) — Create and ship beautiful animations to any platform. Free forever for Individuals. The service is an editor that also hosts all the graphics on their servers. They also provide runtimes for many platforms to run representations made using Rive.\n*   [storyset.com](https://storyset.com/) — Create incredible free customized illustrations for your project using this tool.\n*   [tabler-icons.io](https://tabler-icons.io/) — Over 1500 free copy-and-paste SVG editable icons.\n*   [UI Avatars](https://ui-avatars.com/) - Generate avatars with initials from names. The URLs can be directly hot-linked in your web/app. Support config parameters via the URL.\n*   [unDraw](https://undraw.co/) - A constantly updated collection of beautiful SVG images that you can use completely free without attribution.\n*   [walkme.com](https://www.walkme.com/) — Enterprise Class Guidance and Engagement Platform, free plan three walk-thru up to 5 steps/walk.\n*   [Webflow](https://webflow.com) - WYSIWYG website builder with animations and website hosting. Free for two projects.\n*   [Updrafts.app](https://updrafts.app) - WYSIWYG website builder for tailwindcss-based designs. Free for non-commercial usage.\n*   [Zeplin](https://zeplin.io/) — Designer and developer collaboration platform. Show designs, assets, and style guides. Free for one project.\n*   [Pixelixe](https://pixelixe.com/) — Create and edit engaging, unique graphics and images online.\n*   [Responsively App](https://responsively.app) - A free dev tool for faster and more precise responsive web application development.\n*   [xLayers](https://xlayers.dev) - Preview and convert Sketch design files into Angular, React, Vue, LitElement, Stencil, Xamarin, and more (free and open source at [https://github.com/xlayers/xlayers (⭐823)](https://github.com/xlayers/xlayers))\n*   [Grapedrop](https://grapedrop.com/) — Responsive, powerful, SEO-optimized web page builder based on GrapesJS Framework. Free for the first five pages, unlimited custom domains, all features, and simple usage.\n*   [Unicorn Platform](https://unicornplatform.com/) - Effortless landing page builder with hosting. One website for free.\n*   [svgrepo.com](https://www.svgrepo.com/) - Explore, search, and find the best-fitting icons or vectors for your projects using various vector libraries. Download free SVG Vectors for commercial use.\n*   [TeleportHQ](https://teleporthq.io/) - Low-code Front-end Design & Development Platform. TeleportHQ is the collaborative front-end platform to instantly create and publish headless static websites. Three free projects, unlimited collaborators, and free code export.\n*   [Vertopal](https://www.vertopal.com) - Vertopal is a free online platform for converting files to various formats. Including developer converters like JPG to SVG, GIF to APNG, PNG to WEBP, JSON to XML, etc.\n*   [okso.app](https://okso.app) - Minimalistic online drawing app. Allows to create fast sketches and visual notes. Exports sketches to PNG, JPG, SVG, and WEBP. Also installable as PWA. Free to use for everyone (no registration is needed).\n*   [MDBootstrap](https://mdbootstrap.com/) - Free for personal & commercial use Bootstrap, Angular, React, and Vue UI Kits with over 700 components, stunning templates, 1-min installation, extensive tutorials & colossal community.\n*   [hypercolor.dev](https://hypercolor.dev/) -- A curated collection of Tailwind CSS color gradients also provides a variety of generators to create your own.\n*   [iconify.design](https://icon-sets.iconify.design/) -- A collection of over 100 icon packs with a unified interface. Allows you to search for icons across packs and export individual icons as SVGs or for popular web frameworks.\n*   [NextUI](https://nextui.org/) -- Free. Beautiful, fast, and modern React & Next.js UI library.\n*   [Image BG Blurer](https://imagebgblurer.com/) -- Generate a blurred background frame for an image, using that image source as the background blur, for Notion, Trello, Jira, and more tools\n*   [Webstudio](https://webstudio.is/) -- Open-source alternative to Webflow. The free plan offers unlimited websites on their domain. Five websites with custom domains. Ten thousand page views/month. 2 GB asset storage.\n\n### Design Inspiration\n\n*   [awwwards.](https://www.awwwards.com/) - \\[Top websites] A showcase of all the best-designed websites (voted on by designers).\n*   [Mobile Patterns](https://www.mobile-patterns.com/) - \\[Mobile screenshots] A design inspirational library featuring the finest UI UX Patterns (iOS and Android) for designers, developers, and product makers to reference.\n\n### Payment and Billing Integration\n\n*   [Adapty.io](https://adapty.io/) – One-stop solution with open-source SDK for mobile in-app subscription integration to iOS, Android, React Native, Flutter, Unity, or web app. Free up to $10k monthly revenue.\n*   [CoinMarketCap](https://coinmarketcap.com/api/) — Provides cryptocurrency market data including the latest crypto and fiat currency exchange rates. The free tier offers 10K call credits/month.\n*   [CurrencyApi](https://currencyapi.net/) — Live Currency Rates for Physical and Cryptocurrencies, delivered in JSON and XML. The free tier offers 1,250 API requests/month.\n*   [Moesif API Monetization](https://www.moesif.com/) - Generate revenue from APIs via usage-based billing. Connect to Stripe, Chargebee, etc. The free tier offers 30,000 events/month.\n\n### Docker Related\n\n*   [Container Registry Service](https://container-registry.com/) - Harbor based Container Management Solution. The free tier offers 1 GB of storage for private repositories.\n*   [Play with Docker](https://labs.play-with-docker.com/) — A simple, interactive, fun playground to learn Docker.\n\n### Dev Blogging Sites\n\n*   [BearBlog](https://bearblog.dev/) - Minimalist, Markdown-powered blog and website builder.\n*   [Medium](https://medium.com/) — Get more thoughtful about what matters to you.\n*   [AyeDot](https://ayedot.com/) — Share your ideas, knowledge, and stories with the world for Free in the form of Modern multimedia short-format Miniblogs.\n\n### Commenting Platforms\n\n*   [GraphComment](https://graphcomment.com/) - GraphComment is a comments platform that helps you build an active community from the website’s audience.\n*   [Utterances](https://utteranc.es/) - A lightweight comments widget built on GitHub issues. Use GitHub issues for blog comments, wiki pages, and more!\n*   [Remarkbox](https://www.remarkbox.com/) - Open source hosted comments platform, pay what you can for \"One moderator on a few domains with complete control over behavior & appearance\"\n*   [IntenseDebate](https://intensedebate.com/) - A feature-rich comment system for WordPress, Tumblr, Blogger, and many other website platforms.\n\n### Flutter Related and Building IOS Apps without Mac\n\n*   [FlutLab](https://flutlab.io/) - FlutLab is a modern Flutter online IDE and the best place to create, debug, and build cross-platform projects. Build iOS (Without a Mac) and Android apps with Flutter.\n*   [CodeMagic](https://codemagic.io/) - Codemagic is a fully hosted and managed CI/CD for mobile apps. You can build, test, and deploy with a GUI-based CI/CD tool. The free tier offers 500 free minutes/month and a Mac Mini instance with 2.3 GHz and 8 GB of RAM.\n\n### Browser-based hardware emulation written in Javascript\n\n*   [Jor1k](https://s-macke.github.io/jor1k/demos/main.html) —  an OpenRISC virtual machine capable of running Linux with network support.\n*   [v86](https://copy.sh/v86) — an x86 virtual machine capable of running Linux and other OS directly into the browser.\n\n### Privacy Management\n\n*   [Bearer](https://www.bearer.sh/) - Helps implement privacy by design via audits and continuous workflows so that organizations comply with GDPR and other regulations. The free tier is limited to smaller teams and the SaaS version only.\n*   [Osano](https://www.osano.com/) - Consent management and compliance platform with everything from GDPR representation to cookie banners. The free tier offers basic features.\n*   [Iubenda](https://www.iubenda.com/) - Privacy and cookie policies and consent management. The free tier offers limited privacy and cookie policy as well as cookie banners.\n*   [Cookiefirst](https://cookiefirst.com/) - Cookie banners, auditing, and multi-language consent management solution. The free tier offers a one-time scan and a single banner.\n*   [Ketch](https://www.ketch.com/) - Consent management and privacy framework tool. The free tier offers most features with a limited visitor count.\n\n### Miscellaneous\n\n*   [BinShare.net](https://binshare.net) - Create & share code or binaries. Available to share as a beautiful image e.g. for Twitter / Facebook post or as a link e.g. for chats or forums.\n*   [Blynk](https://blynk.io) — A SaaS with API to control, build & evaluate IoT devices. Free Developer Plan with 5 devices, Free Cloud & data storage. Mobile Apps are also available.\n*   [Carbon.now.sh](https://carbon.now.sh) - create and share code snippets in an aesthetic screenshot-like image format. Usually used to aesthetically share/show off code snippets on Twitter or blog posts.\n*   [Codepng](https://www.codepng.app) - Create excellent snapshots from your source code to share on social media.\n*   [Cronhooks](https://cronhooks.io/) - Schedule on-time or recurring webhooks. The free plan allows 5 ad-hoc schedules.\n*   [cron-job.org](https://cron-job.org) - Online cronjobs service. Unlimited jobs are free of charge.\n*   [Domain Forward](https://domain-forward.com/) - A straightforward tool to forward any URL or Domain. Free up to 5 domains and 200k requests per month.\n*   [Format Express](https://www.format-express.dev) - Instant online format for JSON / XML / SQL.\n*   [kandi](https://kandi.openweaver.com/) — Jumpstart Application Development: build custom functions, and use cases, and complete applications faster through code snippets and open-source library reuse.\n*   [newreleases.io](https://newreleases.io/) - Receive notifications on email, Slack, Telegram, Discord, and custom webhooks for new releases from GitHub, GitLab, Bitbucket, Python PyPI, Java Maven, Node.js NPM, Node.js Yarn, Ruby Gems, PHP Packagist, .NET NuGet, Rust Cargo and Docker Hub.\n*   [PDFMonkey](https://www.pdfmonkey.io/) — Manage PDF templates in a dashboard, call the API with dynamic data, and download your PDF. Offers 300 free documents per month.\n*   [Pika Code Screenshots](https://pika.style/templates/code-image) — Create beautiful, customizable screenshots from code snippets and VSCode using the extension.\n*   [QuickType.io](https://quicktype.io/) - Quickly auto-generate models/class/type/interface and serializers from JSON, schema, and GraphQL for working with data quickly & safely in any programming language. Convert JSON into gorgeous, typesafe code in any language.\n*   [RandomKeygen](https://randomkeygen.com/) - A free mobile-friendly tool that offers a variety of randomly generated keys and passwords you can use to secure any application, service, or device.\n*   [redirect.pizza](https://redirect.pizza/) - Easily manage redirects with HTTPS support. The free plan includes 10 sources and 100,000 hits per month.\n*   [SurveyMonkey.com](https://www.surveymonkey.com) — Create online surveys. Analyze the results online. The free plan allows only 10 questions and 100 responses per survey.\n*   [Versionfeeds](https://versionfeeds.com) — Custom RSS feeds for releases of your favorite software. Have the latest versions of your programming languages, libraries, or loved tools in one feed. (The first 3 feeds are free)\n\n### Remote Desktop Tools\n\n*   [RustDesk](https://rustdesk.com/) - Open source virtual/remote desktop infrastructure for everyone!\n\n### Game Development\n\n*   [itch.io](https://itch.io/game-assets) — Free/Paid assets like sprites, tile sets, and character packs.\n*   [Gamefresco.com](https://gamefresco.com/) — Discover, collect, and share free game assets from game artists everywhere.\n*   [OpenGameArt](https://opengameart.org) — OpenSource Game Assets like music, sounds, sprites, and gifs.\n*   [Game Icons](https://game-icons.net/) - Free styleable SVG/PNG icons provided under a CC-BY license.\n*   [LoSpec](https://lospec.com/) — Online tools for creating pixel art and other restrictive digital art, lots of tutorials/pallet list available to choose from for your games\n*   [ArtStation](https://www.artstation.com/) - MarketPlace for Free/Paid 2D, 3D assets & audios, icons, tile sets, game kits. Also, It can be used for showcasing your art portfolio.\n\n### Other Free Resources\n\n*   [RedHat for Developers](https://developers.redhat.com) — Free access to Red Hat products including RHEL, OpenShift, CodeReady, etc. exclusively for developers. Individual plan only. Free e-books are also offered for reference.\n*   [SnapShooter](https://snapshooter.com/) — Backup solution for DigitalOcean, AWS, LightSail, Hetzner, and Exoscale, with support for direct database, file system and application backups to s3 based storage. Provides a free plan with daily backups for one resource.\n*   [Web.Dev](https://web.dev/measure/) — This is a free tool that allows you to see the performance of your website and improve the SEO to get a higher rank list in search engines.\n*   [SmallDev.tools](https://smalldev.tools/) — A free tool for developers that allows you to Encode/Decode various formats, Minify HTML/CSS/Javascript, Beautify, Generate Fake/Testing datasets in JSON/CSV & multiple other formats and many more features. With a delightful interface.\n*   [WrapPixel](https://www.wrappixel.com/) — Download High Quality Free and Premium Admin dashboard template created with Angular, React, VueJs, NextJS, and NuxtJS!\n*   [Utils.fun](https://utils.fun/en) — All offline daily and development tools based on the browser's computing power, including watermark generation, screen recording, encoding and decoding, encryption and decryption, and code formatting, are completely free and do not upload any data to the cloud for processing.\n*   [Free Code Tools](https://freecodetools.org/) — Effective code tools which are 100% free. Markdown editor, Code minifier/beautifier, QR code generator, Open Graph Generator, Twitter card Generator, and more.\n*   [AdminMart](https://adminmart.com/) — High-Quality Free and Premium Admin Dashboard and Website Templates created with Angular, Bootstrap, React, VueJs, NextJS, and NuxtJS!",
      "content_html": "<h3><p>Cloud management solutions</p>\n</h3><ul>\n<li><a href=\"https://www.cloud66.com/\" rel=\"noopener noreferrer\">Cloud 66</a> - Free for personal projects (includes one deployment server, one static site), Cloud 66 gives you everything you need to build, deploy, and grow your applications on any cloud without the headache of the “server stuff.”.</li>\n</ul>\n<ul>\n<li><a href=\"https://scalr.com/\" rel=\"noopener noreferrer\">scalr.com</a> - Scalr is a Terraform Automation and COllaboration (TACO) product used to better collaboration and automation on infrastructure and configurations managed by Terraform. Full Terraform CLI support, OPA integration, and a hierarchical configuration model. No SSO tax. All features are included. Use up to 50 runs/month for free.</li>\n</ul>\n<h3><p>Source Code Repos</p>\n</h3><ul>\n<li><a href=\"https://www.codebasehq.com/\" rel=\"noopener noreferrer\">codebasehq.com</a> — One free project with 100 MB space and two users</li>\n</ul>\n<ul>\n<li><a href=\"https://osdn.net/\" rel=\"noopener noreferrer\">OSDN</a> - OSDN.net is a free-of-charge service for open-source software developers, offering SVN/Git/Mercurial/Bazaar/CVS repositories.</li>\n</ul>\n<ul>\n<li><a href=\"https://pijul.com/\" rel=\"noopener noreferrer\">pijul.com</a> - Unlimited free and open source distributed version control system. Its distinctive feature is based on a sound theory of patches, which makes it easy to learn, use, and distribute. Solves many problems of git/hg/svn/darcs.</li>\n</ul>\n<h3><p>APIs, Data, and ML</p>\n</h3><ul>\n<li><a href=\"https://www.abstractapi.com\" rel=\"noopener noreferrer\">Abstract API</a> — API suite for various use cases, including IP geolocation, gender detection, or email validation.</li>\n</ul>\n<ul>\n<li><a href=\"https://apitemplate.io\" rel=\"noopener noreferrer\">APITemplate.io</a> - Auto-generate images and PDF documents with a simple API or automation tools like Zapier &amp; Airtable. No CSS/HTML is required. The free plan comes with 50 images/month and three templates.</li>\n</ul>\n<ul>\n<li><a href=\"https://beeceptor.com\" rel=\"noopener noreferrer\">Beeceptor</a> - Mock a rest API in seconds, fake API response and much more. Free 50 requests per day, public dashboard, open endpoints (anyone with a dashboard link can view submissions and answers).</li>\n</ul>\n<ul>\n<li><a href=\"https://www.comet.com/site/\" rel=\"noopener noreferrer\">CometML</a> - The MLOps platform for experiment tracking, model production management, model registry, and complete data lineage, covering your workflow from training to production. Free for individuals and academics.</li>\n</ul>\n<ul>\n<li><a href=\"https://craftmypdf.com\" rel=\"noopener noreferrer\">CraftMyPDF</a> - Auto-Generate PDF documents from reusable templates with a drop-and-drop editor and a simple API. The free plan comes with 100 PDFs/month and three templates.</li>\n</ul>\n<ul>\n<li><a href=\"https://curlhub.io\" rel=\"noopener noreferrer\">CurlHub</a> — Proxy service for inspecting and debugging API calls. The free plan includes 10,000 requests per month.</li>\n</ul>\n<ul>\n<li><a href=\"https://currencyscoop.com\" rel=\"noopener noreferrer\">CurrencyScoop</a> - Realtime currency data API for fintech apps. The free plan includes 5,000 calls per month.</li>\n</ul>\n<ul>\n<li><a href=\"https://datafetcher.com\" rel=\"noopener noreferrer\">Data Fetcher</a> - Connect Airtable to any application or API with no code. Postman-like interface for running API requests in Airtable. Pre-built integrations with dozens of apps. The free plan includes 100 runs per month.</li>\n</ul>\n<ul>\n<li><a href=\"https://db-ip.com/api/free\" rel=\"noopener noreferrer\">DB-IP</a> - Free IP geolocation API with 1k request per IP per day.lite database under the CC-BY 4.0 License is free too.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.dbdesigner.net/\" rel=\"noopener noreferrer\">DB Designer</a> — Cloud-based Database schema design and modeling tool with a free starter plan of 2 Database models and ten tables per model.</li>\n</ul>\n<ul>\n<li><a href=\"https://developer.deepar.ai\" rel=\"noopener noreferrer\">DeepAR</a> — Augmented reality face filters for any platform with one SDK. The free plan provides up to 10 monthly active users (MAU) and tracks up to 4 faces</li>\n</ul>\n<ul>\n<li><a href=\"https://dreamfactory.com/\" rel=\"noopener noreferrer\">dreamfactory.com</a> — Open source REST API backend for mobile, web, and IoT applications. Hook up any SQL/NoSQL database, file storage system, or external service, and it instantly creates a comprehensive REST API platform with live documentation and user management.</li>\n</ul>\n<ul>\n<li><a href=\"https://advicement.io\" rel=\"noopener noreferrer\">DynamicDocs</a> - Generate PDF documents with JSON to PDF API based on LaTeX templates. The free plan allows 50 API calls per month and access to a library of templates.</li>\n</ul>\n<ul>\n<li><a href=\"https://exportsdk.com\" rel=\"noopener noreferrer\">Export SDK</a> - PDF generator API with drag-and-drop template editor that provides an SDK and no-code integrations. The free plan has 250 monthly pages, unlimited users, and three templates.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.fraudlabspro.com\" rel=\"noopener noreferrer\">FraudLabs Pro</a> — Screen an order transaction for credit card payment fraud. This REST API will detect all possible fraud traits based on the input parameters of an order. The Free Micro plan has 500 transactions per month.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.geodatasource.com\" rel=\"noopener noreferrer\">GeoDataSource</a> — Location search service looks up city names using latitude and longitude coordinates. Free API queries up to 500 times per month.</li>\n</ul>\n<ul>\n<li><a href=\"https://glitterly.app/\" rel=\"noopener noreferrer\">Glitterly</a> - Programmatically generate dynamic images from base templates. Restful API and nocode integrations. The free tier comes with 50 images/month and five templates.</li>\n</ul>\n<ul>\n<li><a href=\"https://ipaddress.sh\" rel=\"noopener noreferrer\">ipaddress.sh</a> — Simple service to get a public IP address in different <a href=\"https://about.ipaddress.sh/\" rel=\"noopener noreferrer\">formats</a>.</li>\n</ul>\n<ul>\n<li><a href=\"https://ipbase.com\" rel=\"noopener noreferrer\">ipbase.com</a> - IP Geolocation API - Forever free plan that spans 150 monthly requests.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ip2location.com\" rel=\"noopener noreferrer\">IP2Location</a> — Freemium IP geolocation service. LITE database is available for free download. Import the database in the server and perform a local query to determine the city, coordinates, and ISP information.</li>\n</ul>\n<ul>\n<li><a href=\"https://ipapi.co/\" rel=\"noopener noreferrer\">ipapi</a> - IP Address Location API by Kloudend, Inc - A reliable geolocation API built on AWS, trusted by Fortune 500. The free tier offers 30k lookups/month (1k/day) without signup.</li>\n</ul>\n<ul>\n<li><a href=\"https://json2video.com\" rel=\"noopener noreferrer\">JSON2Video</a> - A video editing API to automate video marketing and social media videos, programmatically or with no code.</li>\n</ul>\n<ul>\n<li><a href=\"https://getjsonip.com\" rel=\"noopener noreferrer\">JSON IP</a> — Returns the Public IP address of the client it is requested from. No registration is required for the free tier. Using CORS, data can be requested using client-side JS directly from the browser. Useful for services monitoring change in client and server IPs. Unlimited Requests.</li>\n</ul>\n<ul>\n<li><a href=\"https://konghq.com/\" rel=\"noopener noreferrer\">konghq.com</a> — API Marketplace and powerful private and public API tools. With the free tier, some features such as monitoring, alerting, and support, are limited.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.lightly.ai/\" rel=\"noopener noreferrer\">Lightly</a> — Improve your machine-learning models by using the correct data. Use datasets of up to 1000 samples for free.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.meteosource.com/\" rel=\"noopener noreferrer\">Meteosource Weather API</a> — global weather API for current and forecasted weather data. Forecasts are based on a machine learning combination of more weather models to achieve better accuracy. The free plan comes with 400 calls per day.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.mockfly.dev/\" rel=\"noopener noreferrer\">Mockfly</a> — Mockfly is a trusted development tool for API mocking and feature flag management. Quickly generate and control mock APIs with an intuitive interface. The free tier offers 500 requests per day.</li>\n</ul>\n<ul>\n<li><a href=\"https://mocki.io\" rel=\"noopener noreferrer\">Mocki</a> - A tool that lets you create mock GraphQL and REST APIs synced to a GitHub repository. Simple REST APIs are free to develop and use without signup.</li>\n</ul>\n<ul>\n<li><a href=\"https://mocko.dev/\" rel=\"noopener noreferrer\">Mocko.dev</a> — Proxy your API, choose which endpoints to mock in the cloud and inspect traffic, for free. Speed up your development and integration tests.</li>\n</ul>\n<ul>\n<li><a href=\"https://designer.mocky.io/\" rel=\"noopener noreferrer\">Mocky</a> - A simple web app to generate custom HTTP responses for mocking HTTP requests. Also available as <a href=\"https://github.com/julien-lafont/Mocky\" rel=\"noopener noreferrer\">open source (⭐2.1k)</a>.</li>\n</ul>\n<ul>\n<li><a href=\"https://microenv.com\" rel=\"noopener noreferrer\">microenv.com</a> —  Create fake REST API for developers with the possibility to generate code and app in a docker container.</li>\n</ul>\n<ul>\n<li><a href=\"https://parsehub.com/\" rel=\"noopener noreferrer\">parsehub.com</a> — Extract data from dynamic sites, turn dynamic websites into APIs, five projects free.</li>\n</ul>\n<ul>\n<li><a href=\"https://pdfendpoint.com\" rel=\"noopener noreferrer\">pdfEndpoint.com</a> - Effortlessly convert HTML or URLs to PDF with a simple API. One hundred conversions per month for free.</li>\n</ul>\n<ul>\n<li><a href=\"https://preset.io/\" rel=\"noopener noreferrer\">Preset Cloud</a> - A hosted Apache Superset service. Forever free for teams of up to 5 users, featuring unlimited dashboards and charts, a no-code chart builder, and a collaborative SQL editor.</li>\n</ul>\n<ul>\n<li><a href=\"https://requestbin.com\" rel=\"noopener noreferrer\">RequestBin.com</a> — Create a free endpoint to which you can send HTTP requests. Any HTTP requests sent to that endpoint will be recorded with the associated payload and headers so you can observe recommendations from webhooks and other services.</li>\n</ul>\n<ul>\n<li><a href=\"https://robohash.org/\" rel=\"noopener noreferrer\">ROBOHASH</a> - Web service to generate unique and cool images from any text.</li>\n</ul>\n<ul>\n<li><a href=\"https://scrapersproxy.com\" rel=\"noopener noreferrer\">Scraper's Proxy</a> — Simple HTTP proxy API for scraping. Scrape anonymously without having to worry about restrictions, blocks, or captchas. First 100 successful scrapes per month free including javascript rendering (more available if you contact support).</li>\n</ul>\n<ul>\n<li><a href=\"https://serpapi.com/\" rel=\"noopener noreferrer\">SerpApi</a> - Real-time search engine scraping API. Returns structured JSON results for Google, YouTube, Bing, Baidu, Walmart, and many other machines. The free plan includes 100 successful API calls per month.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.sofodata.com/\" rel=\"noopener noreferrer\">Sofodata</a> - Create secure RESTful APIs from CSV files. Upload a CSV file and instantly access the data via its API allowing faster application development. The free plan includes 2 APIs and 2,500 API calls per month. You don't need a credit card.</li>\n</ul>\n<ul>\n<li><a href=\"https://stoplight.io/\" rel=\"noopener noreferrer\">Stoplight</a> - Saas for collaboratively designing and documenting for APIs. The free plan offers free design, mocking, and documentation tools.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.tiny.cloud\" rel=\"noopener noreferrer\">TinyMCE</a> - rich text editing API. Core features are free for unlimited usage.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.openwebhook.io\" rel=\"noopener noreferrer\">Webhook Store</a> - Tool for storing third-party webhooks and debug them on localhost (ngrok style). Open source and self-hostable. Free personal domain <em>username</em>.github.webhook.store, free public domains <em>anything</em>.webhook.store.</li>\n</ul>\n<ul>\n<li><a href=\"https://zenscrape.com/web-scraping-api\" rel=\"noopener noreferrer\">Zenscrape</a> — Web scraping API with headless browsers, residentials IPs, and straightforward pricing. One thousand free API calls/month and extra credits for students and non-profits.</li>\n</ul>\n<h3><p>Screenshot APIs</p>\n</h3><ul>\n<li><a href=\"https://microlink.io/\" rel=\"noopener noreferrer\">microlink.io</a> – It turns any website into data such as metatags normalization, beauty link previews, scraping capabilities, or screenshots as a service. 250 requests/day every day free.</li>\n</ul>\n<ul>\n<li><a href=\"https://apiflash.com\" rel=\"noopener noreferrer\">ApiFlash</a> — A screenshot API based on Aws Lambda and Chrome. Handles full page, captures timing, and viewport dimensions.</li>\n</ul>\n<ul>\n<li><a href=\"https://screenshotapi.net/\" rel=\"noopener noreferrer\">ScreenshotAPI.net</a> - Screenshot API uses a straightforward API call to generate screenshots of any website. Built to scale and hosted on Google Cloud. Offers 100 free screenshots per month.</li>\n</ul>\n<ul>\n<li><a href=\"https://webshrinker.com\" rel=\"noopener noreferrer\">Webshrinker.com</a> — Web Shrinker provides website screenshots and domain intelligence API services. Free 100 requests/month.</li>\n</ul>\n<h3><p>Tools for Teams and Collaboration</p>\n</h3><ul>\n<li><a href=\"https://3cols.com/\" rel=\"noopener noreferrer\">3Cols</a> - A free cloud-based code snippet manager for personal and collaborative code.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.braidchat.com/\" rel=\"noopener noreferrer\">Braid</a> — Chat app designed for teams. Free for public access group, unlimited users, history, and integrations. also, it provides a self-hostable open-source version.</li>\n</ul>\n<ul>\n<li><a href=\"https://calendly.com\" rel=\"noopener noreferrer\">Calendly</a> — Calendly is the tool for connecting and scheduling meetings. The free plan provides 1 Calendar connection per user and Unlimited sessions. Desktop and Mobile apps are also offered.</li>\n</ul>\n<ul>\n<li><a href=\"https://telegram.org/\" rel=\"noopener noreferrer\">Telegram</a> — Telegram is for everyone who wants fast, reliable messaging and calls. Business users and small teams may like the large groups, usernames, desktop apps, and powerful file-sharing options.</li>\n</ul>\n<ul>\n<li><a href=\"https://duckly.com/\" rel=\"noopener noreferrer\">Duckly</a> — Talk and collaborate in real time with your team. Pair programming with IDE, terminal sharing, voice, video, and screen sharing. Free for small teams.</li>\n</ul>\n<ul>\n<li><a href=\"https://dyte.io\" rel=\"noopener noreferrer\">Dyte</a> - The most developer-friendly live video &amp; audio SDK, featuring collaborative plugins to enhance productivity and engagement. The free tier includes monthly 10,000 minutes of live video/audio usage.</li>\n</ul>\n<ul>\n<li><a href=\"https://fibery.io/\" rel=\"noopener noreferrer\">Fibery</a> — Connected workspace platform. Free for single users, up to 2 GB disk space.</li>\n</ul>\n<ul>\n<li><a href=\"https://gokanban.io\" rel=\"noopener noreferrer\">gokanban.io</a> - Syntax-based, no registration Kanban Board for fast use. Free with no limitations.</li>\n</ul>\n<ul>\n<li><a href=\"https://gitdailies.com\" rel=\"noopener noreferrer\">GitDailies</a> - Daily reports of your team's Commit and Pull Request activity on GitHub. Includes Push visualizer, peer recognition system, and custom alert builder. The free tier has unlimited users, three repos, and 3 alert configs.</li>\n</ul>\n<ul>\n<li><a href=\"https://gitter.im/\" rel=\"noopener noreferrer\">gitter.im</a> — Chat, for GitHub. Unlimited public and private rooms, free for teams of up to 25</li>\n</ul>\n<ul>\n<li><a href=\"https://www.igloosoftware.com/\" rel=\"noopener noreferrer\">Igloo</a> — Internal portal for sharing documents, blogs, calendars, etc. Free for up to 10 users.</li>\n</ul>\n<ul>\n<li><a href=\"https://keybase.io/\" rel=\"noopener noreferrer\">Keybase</a> — Keybase is a FOSS alternative to Slack; it keeps everyone's chats and files safe, from families to communities to companies.</li>\n</ul>\n<ul>\n<li><a href=\"https://meetslack.com\" rel=\"noopener noreferrer\">/meet for Slack</a> - Start Google Meetings directly from Slack by using /meet in any channel, group, or DM. Free without any limitations.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.livecycle.io/\" rel=\"noopener noreferrer\">Livecycle</a> — Livecycle is an inclusive collaboration platform that makes workflows frictionless for cross-functional product teams and open-source projects.</li>\n</ul>\n<ul>\n<li><a href=\"https://meet.jit.si/\" rel=\"noopener noreferrer\">meet.jit.si</a> — One-click video conversations, and screen sharing, for free</li>\n</ul>\n<ul>\n<li><a href=\"https://miro.com/\" rel=\"noopener noreferrer\">Miro</a> - Scalable, secure, cross-device, and enterprise-ready collaboration whiteboard for distributed teams. With a freemium plan.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.notion.so/\" rel=\"noopener noreferrer\">Notion</a> - Notion is a note-taking and collaboration application with markdown support that integrates tasks, wikis, and databases. The company describes the app as an all-in-one workspace for note-taking, project management and task management. In addition to cross-platform apps, it can be accessed via most web browsers.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.nuclino.com\" rel=\"noopener noreferrer\">Nuclino</a> - A lightweight and collaborative wiki for all your team's knowledge, docs, and notes. Free plan with all essential features, up to 50 items, and 5GB storage.</li>\n</ul>\n<ul>\n<li><a href=\"https://onlineinterview.io/\" rel=\"noopener noreferrer\">OnlineInterview.io</a> - Free code interview platform with embedded video chat, drawing board, and online code editor where you can compile and run your code on the browser. You can create a remote interview room with just one click.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.quidlo.com/timesheets\" rel=\"noopener noreferrer\">Quidlo Timesheets</a> - A simple timesheet and time tracking app for teams. The free plan has time tracking and generating reports features for up to 10 users.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.pageshare.dev\" rel=\"noopener noreferrer\">PageShare.dev</a> - Adds visual review capabilities into GitHub Pull Requests with no need to deploy websites. Free for up to 10 pages each month and 100MB of storage in total.</li>\n</ul>\n<ul>\n<li><a href=\"https://pendulums.io/\" rel=\"noopener noreferrer\">Pendulums</a> - Pendulums is a free time tracking tool that helps you manage your time in a better manner with an easy-to-use interface and valuable statistics.</li>\n</ul>\n<ul>\n<li><a href=\"https://raindrop.io\" rel=\"noopener noreferrer\">Raindrop.io</a> - Private and secure bookmarking app for macOS, Windows, Android, iOS, and Web. Free Unlimited Bookmarks and Collaboration.</li>\n</ul>\n<ul>\n<li><a href=\"https://element.io/\" rel=\"noopener noreferrer\">element.io</a> — A decentralized and open-source communication tool built on Matrix. Group chats, direct messaging, encrypted file transfers, voice and video chats, and easy integration with other services.</li>\n</ul>\n<ul>\n<li><a href=\"https://rocket.chat/\" rel=\"noopener noreferrer\">Rocket.Chat</a> - Open-source communication platform with Omnichannel features, Matrix Federation, Bridge with others apps, Unlimited messaging, and Full messaging history.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.seafile.com/\" rel=\"noopener noreferrer\">seafile.com</a> — Private or cloud storage, file sharing, sync, discussions. The cloud version has just 1 GB</li>\n</ul>\n<ul>\n<li><a href=\"https://www.statuspile.com/\" rel=\"noopener noreferrer\">StatusPile</a> - A status page of status pages. Could you track the status pages of your upstream providers?</li>\n</ul>\n<ul>\n<li><a href=\"https://stickies.app/\" rel=\"noopener noreferrer\">Stickies</a> - Visual collaboration app used for brainstorming, content curation, and notes. Free for up to 3 Walls, unlimited users, and 1 GB storage.</li>\n</ul>\n<ul>\n<li><a href=\"https://teamhood.com/\" rel=\"noopener noreferrer\">Teamhood</a> - Free Project, Task, and Issue-tracking software. Supports Kanban with Swimlanes and full Scrum implementation. Has integrated time tracking. Free for five users and three project portfolios.</li>\n</ul>\n<ul>\n<li><a href=\"https://teamplify.com\" rel=\"noopener noreferrer\">Teamplify</a> - improve team development processes with Team Analytics and Smart Daily Standup. Includes full-featured Time Off management for remote-first teams. Free for small groups of up to 5 users.</li>\n</ul>\n<ul>\n<li><a href=\"https://teletype.oorja.io/\" rel=\"noopener noreferrer\">TeleType</a> — share terminals, voice, code, whiteboard, and more. no sign-in is required for end-to-end encrypted collaboration for developers.</li>\n</ul>\n<ul>\n<li><a href=\"https://twist.com\" rel=\"noopener noreferrer\">twist.com</a> — An asynchronous-friendly team communication app where conversations stay organized and on-topic. Free and Unlimited plans are available. Discounts are provided for eligible teams.</li>\n</ul>\n<ul>\n<li><a href=\"https://tldraw.com\" rel=\"noopener noreferrer\">tldraw.com</a> —  Free open-source white-boarding and diagramming tool with intelligent arrows, snapping, sticky notes, and SVG export features. Multiplayer mode for collaborative editing. Free official VS Code extension available as well.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.typetalk.com/\" rel=\"noopener noreferrer\">typetalk.com</a> — Share and discuss ideas with your team through instant messaging on the web or your mobile</li>\n</ul>\n<ul>\n<li><a href=\"https://whereby.com/\" rel=\"noopener noreferrer\">whereby.com</a> — One-click video conversations, for free (formerly known as appear.in)</li>\n</ul>\n<ul>\n<li><a href=\"https://windmill.dev/\" rel=\"noopener noreferrer\">windmill.dev</a> - Windmill is an open-source developer platform to quickly build production-grade multi-step automation and internal apps from minimal Python and Typescript scripts. As a free user, you can create and be a member of at most three non-premium workspaces.</li>\n</ul>\n<ul>\n<li><a href=\"https://vadoo.tv/\" rel=\"noopener noreferrer\">vadoo.tv</a> — Video hosting and marketing made simple. Upload videos with a single click. Record, manage, share &amp; more. The free tier provides up to 10 videos, 1 GB of storage, and 10 GB of bandwidth/per month</li>\n</ul>\n<ul>\n<li><a href=\"https://userforge.com/\" rel=\"noopener noreferrer\">userforge.com</a> - Interconnected online personas, user stories and context mapping.  Helps keep design and dev in sync free for up to 3 personas and two collaborators.</li>\n</ul>\n<ul>\n<li><a href=\"https://wistia.com/\" rel=\"noopener noreferrer\">wistia.com</a> — Video hosting with viewer analytics, HD video delivery, and marketing tools to help understand your visitors, 25 videos, and Wistia branded player</li>\n</ul>\n<ul>\n<li><a href=\"https://www.wormhol.org/\" rel=\"noopener noreferrer\">wormhol.org</a> — Straightforward file sharing service. Share unlimited files up to 5GB with as many peers as you want.</li>\n</ul>\n<ul>\n<li><a href=\"https://zoom.us/\" rel=\"noopener noreferrer\">zoom.us</a> — Secure Video and Web conferencing add-ons available. The free plan is limited to 40 minutes.</li>\n</ul>\n<ul>\n<li><a href=\"https://zulip.com/\" rel=\"noopener noreferrer\">Zulip</a> — Real-time chat with a unique email-like threading model. The free plan includes 10,000 messages of search history and File storage up to 5 GB. also, it provides a self-hostable open-source version.</li>\n</ul>\n<ul>\n<li><a href=\"https://robocorp.com\" rel=\"noopener noreferrer\">robocorp.com</a> - Open-source stack for powering Automation Ops. Try out Cloud features and implement simple automation for free. Robot work 240 min/month, 10 Assistant runs, Storage of 100 MB.</li>\n</ul>\n<ul>\n<li><a href=\"https://fleep.io/\" rel=\"noopener noreferrer\">Fleep.io</a> — Fleep an alternative to Slack. It has a free plan for small teams with full message history, unlimited 1:1 conversations, 1 group conversation, and 1 GB file storage.</li>\n</ul>\n<ul>\n<li><a href=\"https://chanty.com/\" rel=\"noopener noreferrer\">Chanty.com</a> — Chanty is another alternative to Slack. It has a free forever plan for small teams (up to 10) with unlimited public and private conversations, searchable history, unlimited 1:1 audio calls, unlimited voice messages, ten integrations, and 20 GB storage per team.</li>\n</ul>\n<ul>\n<li><a href=\"https://ruttl.com/\" rel=\"noopener noreferrer\">ruttl.com</a> — The best all-in-one feedback tool to collect digital feedback and review websites, PDFs, and images.</li>\n</ul>\n<ul>\n<li><a href=\"https://mattermost.com/\" rel=\"noopener noreferrer\">Mattermost</a> — Secure collaboration for technical teams. Free plan with unlimited channels, playbooks, boards, users, 10GB storage, and more.</li>\n</ul>\n<h3><p>CMS</p>\n</h3><ul>\n<li><a href=\"https://www.acquia.com/\" rel=\"noopener noreferrer\">acquia.com</a> — Hosting for Drupal sites. Free tier for developers. Free development tools (such as Acquia Dev Desktop) are also available.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.contentful.com/\" rel=\"noopener noreferrer\">Contentful</a> — Headless CMS. Content management and delivery APIs in the cloud. Comes with one free Community space that includes five users, 25K records, 48 Content Types, 2 locales.</li>\n</ul>\n<ul>\n<li><a href=\"https://crystallize.com\" rel=\"noopener noreferrer\">Crystallize</a> — Headless PIM with ecommerce support. Built-in GraphQL API. The free version includes unlimited users, 1000 catalog items, 5 GB/month bandwidth, and 25k/month API calls.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.datocms.com/\" rel=\"noopener noreferrer\">DatoCMS</a> - Offers free tier for small projects. DatoCMS is a GraphQL-based CMS. On the lower tier, you have 100k/month calls.</li>\n</ul>\n<ul>\n<li><a href=\"https://directus.io\" rel=\"noopener noreferrer\">Directus</a> — Headless CMS. A completely free and open-source platform for managing assets and database content on-prem or in the Cloud. There are no limitations or paywalls.</li>\n</ul>\n<ul>\n<li><a href=\"https://frontaid.io/\" rel=\"noopener noreferrer\">FrontAid</a> — Headless CMS that stores JSON content directly in your Git repository. No restrictions.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.kontent.ai\" rel=\"noopener noreferrer\">kontent.ai</a> - A Content-as-a-Service platform that gives you all the headless CMS benefits while empowering marketers at the same time. The developer plan provides two users with unlimited projects with two environments for each, 500 content items, two languages with Delivery and Management API, and Custom elements support. You can use more detailed plans to meet your needs.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.prismic.io/\" rel=\"noopener noreferrer\">Prismic</a> — Headless CMS. Content management interface with fully hosted and scalable API. The Community Plan provides unlimited API calls, documents, custom types, assets, and locales to one user. Everything that you need for your next project. Bigger free plans are available for Open Content/Open Source projects.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.sanity.io/\" rel=\"noopener noreferrer\">Sanity.io</a> - Platform for structured content with an open-source editing environment and a real-time hosted data store. Unlimited projects. Unlimited admin users, three non-admin users, two datasets, 500K API CDN requests, 10GB bandwidth, and 5GB assets included for free per project.</li>\n</ul>\n<ul>\n<li><a href=\"https://sensenet.com\" rel=\"noopener noreferrer\">sensenet</a> - API-first headless CMS providing enterprise-grade solutions for businesses of all sizes. The Developer plan provides three users, 500 content items, three built-in roles, 25+5 content types, fully accessible REST API, document preview generation, and Office Online editing.</li>\n</ul>\n<ul>\n<li><a href=\"https://tina.io/\" rel=\"noopener noreferrer\">TinaCMS</a> — Replacing Forestry.io. Open source Git-backed headless CMS that supports Markdown, MDX, and JSON. The basic offer is free with two users available.</li>\n</ul>\n<ul>\n<li><a href=\"https://squidex.io/\" rel=\"noopener noreferrer\">Squidex</a> - Offers free tier for small projects. API / GraphQL first. Open source and based on event sourcing (versing every change automatically).</li>\n</ul>\n<ul>\n<li><a href=\"https://instawp.com/\" rel=\"noopener noreferrer\">InstaWP</a> - Launch a WordPress site in a few seconds. A free tier with 5 Active Sites, 500 MB Space, 48 hrs Site Expiry.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.storyblok.com\" rel=\"noopener noreferrer\">Storyblok</a> - A Headless CMS for developers and marketers that works with all modern frameworks. The Community (free) tier offers Management API, Visual Editor, ten sources, Custom Field Types, Internationalization (unlimited languages/locales), Asset Manager (up to 2500 assets), Image Optimizing Service, Search Query, Webhook + 250GB Traffic/month included.</li>\n</ul>\n<h3><p>Code Generation</p>\n</h3><ul>\n<li><a href=\"https://appinvento.io/\" rel=\"noopener noreferrer\">Appinvento</a> — AppInvento is a free No code app builder. In the automatically generated backend code, users have complete access to the source code and unlimited APIs and routes, allowing for extensive integration. The free plan includes three projects, five tables, and a Google add-on.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.postsharp.net/metalama\" rel=\"noopener noreferrer\">Metalama</a> - Only for C#. Metalama generates the boilerplate of the code on the fly during compilation so that your source code remains clean. It is free for open-source projects, and its commercial-friendly free tier includes three aspects.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.tabnine.com/\" rel=\"noopener noreferrer\">tabnine.com</a> — Tabnine helps developers create better software faster by providing insights learned from all the code in the world. Plugin available.</li>\n</ul>\n<h3><p>Code Quality</p>\n</h3><ul>\n<li><a href=\"https://beanstalkapp.com/\" rel=\"noopener noreferrer\">beanstalkapp.com</a> — A complete workflow to write, review, and deploy code), a free account for one user, and one repository with 100 MB of storage</li>\n</ul>\n<ul>\n<li><a href=\"https://www.codacy.com/\" rel=\"noopener noreferrer\">codacy.com</a> — Automated code reviews for PHP, Python, Ruby, Java, JavaScript, Scala, CSS, and CoffeeScript, free for unlimited public and private repositories</li>\n</ul>\n<ul>\n<li><a href=\"https://www.codeac.io/infrastructure-as-code.html?ref=free-for-dev\" rel=\"noopener noreferrer\">Codeac.io</a> - Automated Infrastructure as Code review tool for DevOps integrates with GitHub, Bitbucket, and GitLab (even self-hosted). In addition to standard languages, it also analyzes Ansible, Terraform, CloudFormation, Kubernetes, and more. (open-source free)</li>\n</ul>\n<ul>\n<li><a href=\"https://codebeat.co\" rel=\"noopener noreferrer\">CodeBeat</a> — Automated Code Review Platform available for many languages. Free forever for public repositories with Slack and e-mail integration.</li>\n</ul>\n<ul>\n<li><a href=\"https://codecov.io/\" rel=\"noopener noreferrer\">codecov.io</a> — Code coverage tool (SaaS), free for Open Source and one free private repo</li>\n</ul>\n<ul>\n<li><a href=\"https://www.codefactor.io\" rel=\"noopener noreferrer\">CodeFactor</a> — Automated Code Review for Git. The free version includes unlimited users, public repositories, and one private repo.</li>\n</ul>\n<ul>\n<li><a href=\"https://dareboost.com\" rel=\"noopener noreferrer\">dareboost</a> - 5 free analysis reports for web performance, accessibility, and security each month</li>\n</ul>\n<ul>\n<li><a href=\"https://www.deepcode.ai\" rel=\"noopener noreferrer\">deepcode.ai</a> — DeepCode finds bugs, security vulnerabilities, performance and API issues based on AI. DeepCode's speed of analysis allows us to analyze your code in real time and deliver results when you hit the save button in your IDE. Supported languages are Java, C/C++, JavaScript, Python, and TypeScript. Integrations with GitHub, BitBucket, and GitLab. Free for open source and private repos and up to 30 developers.</li>\n</ul>\n<ul>\n<li><a href=\"https://deepsource.io/\" rel=\"noopener noreferrer\">DeepSource</a> - DeepSource continuously analyzes source code changes, finding and fixing issues categorized under security, performance, anti-patterns, bug-risks, documentation, and style. Native integration with GitHub, GitLab, and Bitbucket.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.eversql.com/\" rel=\"noopener noreferrer\">eversql.com</a> — EverSQL - The #1 platform for database optimization. Gain critical insights into your database and SQL queries automatically.</li>\n</ul>\n<ul>\n<li><a href=\"https://reviewable.io/\" rel=\"noopener noreferrer\">reviewable.io</a> — Code review for GitHub repositories, free for public or personal repos.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.webceo.com/\" rel=\"noopener noreferrer\">webceo.com</a> — SEO tools but with also code verifications and different types of devices</li>\n</ul>\n<h3><p>Code Search and Browsing</p>\n</h3><ul>\n<li><a href=\"https://namae.dev/\" rel=\"noopener noreferrer\">Namae</a> - Search various websites like GitHub, Gitlab, Heroku, Netlify, and many more for the availability of your project name.</li>\n</ul>\n<ul>\n<li><a href=\"https://codekeep.io\" rel=\"noopener noreferrer\">CodeKeep</a> - Google Keep for Code Snippets. Organize, Discover, and share code snippets, featuring a powerful code screenshot tool with preset templates and a linking feature.</li>\n</ul>\n<h3><p>CI and CD</p>\n</h3><ul>\n<li><a href=\"https://argonaut.dev/\" rel=\"noopener noreferrer\">Argonaut</a> - Deploy apps and infrastructure on your cloud in minutes. Support for custom and third-party app deployments on Kubernetes and Lambda environments. The free tier allows unlimited apps and deployments for 5 domains and 2 users.</li>\n</ul>\n<ul>\n<li><a href=\"https://buddy.works/\" rel=\"noopener noreferrer\">buddy.works</a> — A CI/CD with five free projects and one concurrent run (120 executions/month)</li>\n</ul>\n<ul>\n<li><a href=\"https://www.bytebase.com/\" rel=\"noopener noreferrer\">bytebase.com</a> — Database CI/CD and DevOps. Free under 20 users and ten database instances</li>\n</ul>\n<ul>\n<li><a href=\"https://circleci.com/\" rel=\"noopener noreferrer\">CircleCI</a> — Comprehensive free plan with all features included in a hosted CI/CD service for GitHub, GitLab, and BitBucket repositories. Multiple resource classes, Docker, Windows, Mac OS, ARM executors, local runners, test splitting, Docker Layer Caching, and other advanced CI/CD features. Free for up to 6000 minutes/month execution time, unlimited collaborators, 30 parallel jobs in private projects, and up to 80,000 free build minutes for Open Source projects.</li>\n</ul>\n<ul>\n<li><a href=\"https://codefresh.io\" rel=\"noopener noreferrer\">codefresh.io</a> — Free-for-Life plan: 1 build, one environment, shared servers, unlimited public repos</li>\n</ul>\n<ul>\n<li><a href=\"https://codeship.com/\" rel=\"noopener noreferrer\">codeship.com</a> — 100 private builds/month, five private projects, unlimited for Open Source</li>\n</ul>\n<ul>\n<li><a href=\"https://www.deploybot.com/\" rel=\"noopener noreferrer\">deploybot.com</a> — 1 repository with ten deployments, free for Open Source</li>\n</ul>\n<ul>\n<li><a href=\"https://www.deployhq.com/\" rel=\"noopener noreferrer\">deployhq.com</a> — 1 project with ten daily deployments (30 build minutes/month)</li>\n</ul>\n<ul>\n<li><a href=\"https://cloud.drone.io/\" rel=\"noopener noreferrer\">drone</a> - Drone Cloud enables developers to run Continuous Delivery pipelines across multiple architectures - including x86 and Arm (both 32-bit and 64-bit) - all in one place</li>\n</ul>\n<ul>\n<li><a href=\"https://layerci.com\" rel=\"noopener noreferrer\">LayerCI</a> — CI for full stack projects. One full stack preview environment with 5GB memory &amp; 3 CPUs.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.make.com/en\" rel=\"noopener noreferrer\">Make</a> — The workflow automation tool lets you connect apps and automate workflows using UI. It supports many apps and the most popular APIs. Free for public GitHub repositories, and free tier with 100 Mb, 1000 Operations, and 15 minutes of minimum interval.</li>\n</ul>\n<ul>\n<li><a href=\"https://spacelift.io/\" rel=\"noopener noreferrer\">Spacelift</a> - Management platform for Infrastructure as Code. Free plan features: IaC collaboration, Terraform module registry, ChatOps integration, Continuous resource compliance with Open Policy Agent, SSO with SAML 2.0, and access to public worker pools: up to 200 minutes/month</li>\n</ul>\n<ul>\n<li><a href=\"https://microtica.com/\" rel=\"noopener noreferrer\">microtica.com</a> - Startup environments with ready-made infrastructure components, deploy apps on AWS for free, and support your production workloads. The free tier includes 1 Environment (on your AWS account), 2 Kubernetes Services, 100 build minutes per month, and 20 monthly deployments.</li>\n</ul>\n<h3><p>Testing</p>\n</h3><ul>\n<li><a href=\"https://apptim.com\" rel=\"noopener noreferrer\">Apptim</a> — A mobile testing tool that enables people without performance engineering skills to evaluate an app's performance and user experience (UX). A desktop version using your own device is 100% FREE, with unlimited tests on both iOS and Android.</li>\n</ul>\n<ul>\n<li><a href=\"https://bencher.dev/\" rel=\"noopener noreferrer\">Bencher</a> - A continuous benchmarking tool suite to catch CI performance regressions. Free for all public projects.</li>\n</ul>\n<ul>\n<li><a href=\"https://cypress.preflight.com/\" rel=\"noopener noreferrer\">Cypress Recorder by Preflight</a> - Create AI-powered Cypress Tests/POM models on your browser. It's open-source, except for the AI part. It's free for five monthly test creations with Self-healing scripts, Email, and Visual testing.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.everystep-automation.com/\" rel=\"noopener noreferrer\">everystep-automation.com</a> — Records and replays all steps made in a web browser and creates scripts, free with fewer options</li>\n</ul>\n<ul>\n<li><a href=\"https://katalon.com\" rel=\"noopener noreferrer\">katalon.com</a> - Provides a testing platform that can help teams of all sizes at different levels of testing maturity, including  Katalon Studio, TestOps (+ Visual Testing free), TestCloud, and Katalon Recorder.</li>\n</ul>\n<ul>\n<li><a href=\"https://keploy.io/\" rel=\"noopener noreferrer\">Keploy</a> - Keploy is a functional testing toolkit for developers. Recording API calls generates E2E tests for APIs (KTests) and mocks or stubs(KMocks). It is free for Open Source projects.</li>\n</ul>\n<ul>\n<li><a href=\"https://vaadin.com\" rel=\"noopener noreferrer\">Vaadin</a> — Build scalable UIs in Java or TypeScript, and use the integrated tooling, components, and design system to iterate faster, design better, and simplify the development process. Unlimited Projects with five years of free maintenance.</li>\n</ul>\n<ul>\n<li><a href=\"https://webhook-test.com\" rel=\"noopener noreferrer\">webhook-test.com</a> - Debug and inspect webhooks and HTTP requests with a unique URL during integration. Completely free, you can create unlimited URLs and receive recommendations.</li>\n</ul>\n<h3><p>Security and PKI</p>\n</h3><ul>\n<li><a href=\"https://hostedscan.com\" rel=\"noopener noreferrer\">hostedscan.com</a> — Online vulnerability scanner for web applications, servers, and networks. Ten free scans per month.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.opswat.com/\" rel=\"noopener noreferrer\">opswat.com</a> — Security Monitoring of computers, devices, applications, configurations, Free 25 users and 30 days history users.</li>\n</ul>\n<ul>\n<li><a href=\"https://openapi.security/\" rel=\"noopener noreferrer\">openapi.security</a> - Free tool to quickly check the security of any OpenAPI / Swagger-based API. You don't need to sign up.</li>\n</ul>\n<ul>\n<li><a href=\"https://threatconnect.com\" rel=\"noopener noreferrer\">threatconnect.com</a> — Threat intelligence: It is designed for individual researchers, analysts, and organizations starting to learn about cyber threat intelligence. Free up to 3 Users</li>\n</ul>\n<h3><p>Authentication, Authorization, and User Management</p>\n</h3><ul>\n<li><a href=\"https://wso2.com/asgardeo\" rel=\"noopener noreferrer\">asgardeo.io</a> - Seamless Integration of SSO, MFA, passwordless auth and more. Includes SDKs for frontend and backend apps. Free up to 1000 MAUs and five identity providers.</li>\n</ul>\n<h3><p>Management System</p>\n</h3><ul>\n<li><a href=\"https://esper.io\" rel=\"noopener noreferrer\">Esper</a> — MDM and MAM for Android Devices with DevOps. One hundred devices free with one user license and 25 MB Application Storage.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.jamf.com/\" rel=\"noopener noreferrer\">jamf.com</a> —  Device management for iPads, iPhones, and Macs, three devices free</li>\n</ul>\n<ul>\n<li><a href=\"https://miradore.com\" rel=\"noopener noreferrer\">Miradore</a> — Device Management service. Stay up-to-date with your device fleet and secure unlimited devices for free. The free plan offers basic features.</li>\n</ul>\n<ul>\n<li><a href=\"https://ploi.io/\" rel=\"noopener noreferrer\">ploi.io</a> - Server management tool to easily manage and deploy your servers &amp; sites. Free for one server.</li>\n</ul>\n<h3><p>Log Management</p>\n</h3><ul>\n<li><a href=\"https://logentries.com/\" rel=\"noopener noreferrer\">logentries.com</a> — Free up to 5 GB/month with seven days retention</li>\n</ul>\n<ul>\n<li><a href=\"https://www.loggly.com/\" rel=\"noopener noreferrer\">loggly.com</a> — Free for a single user, 200MB/day with seven days retention</li>\n</ul>\n<ul>\n<li><a href=\"https://papertrailapp.com/\" rel=\"noopener noreferrer\">papertrailapp.com</a> — 48 hours search, seven days archive, 50 MB/month</li>\n</ul>\n<ul>\n<li><a href=\"https://sematext.com/logsene\" rel=\"noopener noreferrer\">sematext.com</a> — Free up to 500 MB/day, seven days retention</li>\n</ul>\n<ul>\n<li><a href=\"https://www.sumologic.com/\" rel=\"noopener noreferrer\">sumologic.com</a> — Free up to 500 MB/day, seven days retention</li>\n</ul>\n<ul>\n<li><a href=\"https://logtail.com/\" rel=\"noopener noreferrer\">logtail.com</a> — ClickHouse-based SQL-compatible log management. Free up to 1 GB per month, three days retention.</li>\n</ul>\n<h3><p>Translation Management</p>\n</h3><ul>\n<li><a href=\"https://localeum.com\" rel=\"noopener noreferrer\">Localeum</a> - Free up to 1000 strings, one user, unlimited languages, unlimited projects</li>\n</ul>\n<ul>\n<li><a href=\"https://localise.biz/\" rel=\"noopener noreferrer\">Loco</a> — Free up to 2000 translations, Unlimited translators, ten languages/project, 1000 translatable assets/project</li>\n</ul>\n<ul>\n<li><a href=\"https://translized.com\" rel=\"noopener noreferrer\">Translized</a> - Free up to 1000 strings, one user, unlimited languages, unlimited projects</li>\n</ul>\n<h3><p>Monitoring</p>\n</h3><ul>\n<li><a href=\"https://cronitor.io/\" rel=\"noopener noreferrer\">cronitor.io</a> - Performance insights and uptime monitoring for cron jobs, websites, APIs and more. A free tier with five monitors.</li>\n</ul>\n<ul>\n<li><a href=\"https://deadmanssnitch.com/\" rel=\"noopener noreferrer\">deadmanssnitch.com</a> — Monitoring for cron jobs. One free snitch (monitor), more if you refer others to sign up</li>\n</ul>\n<ul>\n<li><a href=\"https://economize.cloud\" rel=\"noopener noreferrer\">economize.cloud</a> — Economize helps demystify cloud infrastructure costs by organizing cloud resources to optimize and report the same. Free for up to $5,000 spent on Google Cloud Platform every month.</li>\n</ul>\n<ul>\n<li><a href=\"https://grafana.com/products/cloud/\" rel=\"noopener noreferrer\">Grafana Cloud</a> - Grafana Cloud is a composable observability platform that integrates metrics and logs with Grafana. Free: 3 users, ten dashboards, 100 alerts, metrics storage in Prometheus and Graphite (10,000 series, 14 days retention), logs storage in Loki (50 GB of logs, 14 days retention)</li>\n</ul>\n<ul>\n<li><a href=\"https://www.netdata.cloud/\" rel=\"noopener noreferrer\">netdata.cloud</a> — Netdata is an open-source tool to collect real-time metrics. It's a growing product and can also be found on GitHub!</li>\n</ul>\n<ul>\n<li><a href=\"https://www.newrelic.com\" rel=\"noopener noreferrer\">newrelic.com</a> — New Relic observability platform built to help engineers create more perfect software. From monoliths to serverless, you can instrument everything and then analyze, troubleshoot, and optimize your entire software stack. The free tier offers 100GB/month of free data ingest, one free full-access user, and unlimited free primary users.</li>\n</ul>\n<ul>\n<li><a href=\"https://onlineornot.com/\" rel=\"noopener noreferrer\">OnlineOrNot.com</a> - OnlineOrNot provides uptime monitoring for websites and APIs, monitoring for cron jobs and scheduled tasks. Also provides status pages. The first five checks with a 3-minute interval are free. The free tier sends alerts via Slack, Discord, and Email.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.paessler.com/\" rel=\"noopener noreferrer\">paessler.com</a> — Powerful infrastructure and network monitoring solution, including alerting, strong visualization capabilities, and basic reporting. Free up to 100 sensors.</li>\n</ul>\n<ul>\n<li><a href=\"https://sematext.com/\" rel=\"noopener noreferrer\">sematext.com</a> — Free for 24-hour metrics, unlimited servers, ten custom metrics, 500,000 custom metrics data points, unlimited dashboards, users, etc.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.stathat.com/\" rel=\"noopener noreferrer\">stathat.com</a> — Get started with ten stats for free, no expiration</li>\n</ul>\n<ul>\n<li><a href=\"https://uptimetoolbox.com/\" rel=\"noopener noreferrer\">uptimetoolbox.com</a> — Free monitoring for five websites, 60-second intervals, public statuspage.</li>\n</ul>\n<ul>\n<li><a href=\"https://robomiri.com/\" rel=\"noopener noreferrer\">RoboMiri.com</a> - RoboMiri is a stable uptime monitor that offers a wide range of monitors: cronjob, keyword, website, port, ping. Twenty-five uptime checks with 3-minute interval checks for free. Alerts via Phone Call, SMS, Email, and Webhooks.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.wachete.com\" rel=\"noopener noreferrer\">Wachete</a> - monitor five pages, checks every 24 hours.</li>\n</ul>\n<h3><p>Crash and Exception Handling</p>\n</h3><ul>\n<li><a href=\"https://memfault.com\" rel=\"noopener noreferrer\">memfault.com</a> — Cloud device observability and debugging platform. 100 devices free for <a href=\"https://app.memfault.com/register-nordic\" rel=\"noopener noreferrer\">Nordic</a>, <a href=\"https://app.memfault.com/register-nxp\" rel=\"noopener noreferrer\">NXP</a>, and <a href=\"https://app.memfault.com/register-laird\" rel=\"noopener noreferrer\">Laird</a> devices.</li>\n</ul>\n<ul>\n<li><a href=\"https://sentry.io/\" rel=\"noopener noreferrer\">sentry.io</a> — Sentry tracks app exceptions in real-time and has a small free plan. Free for 5k errors per month/ 1 user, unrestricted use if self-hosted</li>\n</ul>\n<h3><p>Email</p>\n</h3><ul>\n<li><a href=\"https://bump.email/\" rel=\"noopener noreferrer\">Bump</a> - Free 10 Bump email addresses, one custom domain</li>\n</ul>\n<ul>\n<li><a href=\"https://emaillabs.io/en\" rel=\"noopener noreferrer\">EmailLabs.io</a> — Send up to 9,000 Emails for free every month, up to 300 emails daily.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.emailjs.com/\" rel=\"noopener noreferrer\">EmailJS</a> – This is not an entire email server; this is just an email client that you can use to send emails right from the client without exposing your credentials, the free tier has 200 monthly requests, 2 email templates, Requests up to 50Kb, Limited contacts history.</li>\n</ul>\n<ul>\n<li><a href=\"https://improvmx.com\" rel=\"noopener noreferrer\">ImprovMX</a> – Free email forwarding.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.eforw.com\" rel=\"noopener noreferrer\">EForw</a> – Free email forwarding for one domain. Receive and send emails from your domain.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.mail-tester.com\" rel=\"noopener noreferrer\">mail-tester.com</a> — Test if the email's DNS/SPF/DKIM/DMARC settings are correct, 20 free/month.</li>\n</ul>\n<ul>\n<li><a href=\"https://mailcatcher.me/\" rel=\"noopener noreferrer\">mailcatcher.me</a> — Catches mail and serves it through a web interface.</li>\n</ul>\n<ul>\n<li><a href=\"https://mailchimp.com/\" rel=\"noopener noreferrer\">Mailchimp</a> — 500 subscribers and 1,000 emails/month free.</li>\n</ul>\n<ul>\n<li><a href=\"https://mailtrap.io/\" rel=\"noopener noreferrer\">Mailtrap.io</a> — Fake SMTP server for development, free plan with one inbox, 100 messages, no team member, two emails/second, no forward rules.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.mail7.io/\" rel=\"noopener noreferrer\">Mail7.io</a> — Free Temp Email Addresses for QA Developers. Create email addresses instantly using Web Interface or API.</li>\n</ul>\n<ul>\n<li><a href=\"https://outlook.live.com/owa/\" rel=\"noopener noreferrer\">Outlook.com</a> - Free personal email and calendar.</li>\n</ul>\n<ul>\n<li><a href=\"https://pepipost.com\" rel=\"noopener noreferrer\">pepipost.com</a> — 30k emails free for the first month, then the first 100 emails/day free.</li>\n</ul>\n<ul>\n<li><a href=\"https://postmarkapp.com/\" rel=\"noopener noreferrer\">Postmark</a> - 100 emails/month free, unlimited DMARC weekly digests.</li>\n</ul>\n<h3><p>Feature Toggles Management Platforms</p>\n</h3><ul>\n<li><a href=\"https://configcat.com\" rel=\"noopener noreferrer\">ConfigCat</a> - ConfigCat is a developer-centric feature flag service with unlimited team size, excellent support, and a reasonable price tag. Free plan up to 10 flags, two environments, 1 product, and 5 Million requests per month.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.toggled.dev\" rel=\"noopener noreferrer\">Toggled.dev</a> - Enterprise-ready, scalable multi-regional feature toggles management platform. Free plan up to 10 flags, two environments, unlimited requests. SDK, analytics dashboard, release calendar, Slack notifications, and all other features are included in the endless free plan.</li>\n</ul>\n<h3><p>Font</p>\n</h3><ul>\n<li><a href=\"https://www.fontsquirrel.com/\" rel=\"noopener noreferrer\">Font Squirrel</a> - Freeware fonts licensed for commercial work. Hand-selected these typefaces and presented them in an easy-to-use format.</li>\n</ul>\n<ul>\n<li><a href=\"https://fonts.google.com/\" rel=\"noopener noreferrer\">Google Fonts</a> - Many free fonts are easy and quick to install on a website via a download or a link to Google's CDN.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.fontshare.com/\" rel=\"noopener noreferrer\">Fontshare</a> - is a free fonts service. It’s a growing collection of professional-grade fonts, 100% free for personal and commercial use.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.fontskey.com/\" rel=\"noopener noreferrer\">FontsKey</a> - Provides free and commercial paid fonts for personal use and can enter text for quick filtering.</li>\n</ul>\n<h3><p>Forms</p>\n</h3><ul>\n<li><a href=\"https://feathery.io\" rel=\"noopener noreferrer\">Feathery</a> - Powerful, developer-friendly form builder. Build signup &amp; login, user onboarding, payment flows, complex financial applications, and more. The free plan allows up to 250 submissions/month and five active forms.</li>\n</ul>\n<ul>\n<li><a href=\"https://form-data.com\" rel=\"noopener noreferrer\">Form-Data</a> - No-code forms backend. Spam filter, email notification and auto-respond, webhooks, zapier, redirects, AJAX or POST, and more. The free plan offers unlimited forms, 20 submissions/month, and an additional 2000 submissions with Form-Data badge.</li>\n</ul>\n<ul>\n<li><a href=\"https://formcarry.com\" rel=\"noopener noreferrer\">Formcarry.com</a> - HTTP POST Form endpoint, Free plan allows 100 monthly submissions.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.formingo.co/\" rel=\"noopener noreferrer\">formingo.co</a>- Easy HTML forms for static websites. You can start for free without registering an account. The free plan allows 500 monthly submissions and a customizable reply-to email address.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.formkeep.com/\" rel=\"noopener noreferrer\">FormKeep.com</a> - Unlimited forms with 50 monthly submissions, spam protection, email notification, and a drag-and-drop designer that can export HTML. Additional features include custom field rules, teams, and integrations to Google Sheets, Slack, ActiveCampaign, and Zapier.</li>\n</ul>\n<ul>\n<li><a href=\"https://herotofu.com/\" rel=\"noopener noreferrer\">HeroTofu.com</a> - Forms backend with bot detection and encrypted archive. Forward submissions via UI to email, Slack, or Zapier. Use your own front end. No server code is required. The free plan gives unlimited forms and 100 submissions per month.</li>\n</ul>\n<ul>\n<li><a href=\"https://tally.so/\" rel=\"noopener noreferrer\">Tally.so</a> - 99% of all the features are free. The free tier lets you have: unlimited forms, unlimited submissions, email notifications, form logic, collect payments, file upload, custom thank you page, and many more.</li>\n</ul>\n<ul>\n<li><a href=\"https://hyperforms.app/\" rel=\"noopener noreferrer\">Hyperforms.app</a> — Create a form to email and more in seconds and without backend code. The Personal account gives you up to 50 monthly form submissions for free.</li>\n</ul>\n<ul>\n<li><a href=\"https://kwes.io/\" rel=\"noopener noreferrer\">Kwes.io</a> - Feature rich form endpoint. Works great with static sites. The free plan includes up to 1 website with up to 50 monthly submissions.</li>\n</ul>\n<ul>\n<li><a href=\"https://pageclip.co/\" rel=\"noopener noreferrer\">Pageclip</a> - The free plan allows one site, one form, and 1,000 monthly submissions.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.staticforms.xyz/\" rel=\"noopener noreferrer\">staticforms.xyz</a> - Integrate HTML forms easily without any server-side code for free. After the user submits the form, an email with the form content will be sent to your registered address.</li>\n</ul>\n<ul>\n<li><a href=\"https://stepform.io\" rel=\"noopener noreferrer\">stepFORM.io</a> - Quiz and Form Builder. The free plan has five forms, up to 3 steps per form, and 50 monthly responses.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.typeform.com/\" rel=\"noopener noreferrer\">Typeform.com</a> — Include beautifully designed forms on websites.  The free plan allows only ten fields per form and 100 monthly responses.</li>\n</ul>\n<ul>\n<li><a href=\"https://waiverstevie.com\" rel=\"noopener noreferrer\">WaiverStevie.com</a> - Electronic Signature platform with a REST API. You can receive notifications with webhooks. Free plan watermarks signed documents but allow unlimited envelopes + signatures.</li>\n</ul>\n<ul>\n<li><a href=\"https://webask.io\" rel=\"noopener noreferrer\">WebAsk</a> - Survey and Form Builder. The free plan has three surveys per account, 100 monthly responses, and ten elements per survey.</li>\n</ul>\n<ul>\n<li><a href=\"https://simplepdf.eu/embed\" rel=\"noopener noreferrer\">SimplePDF.eu</a> - Embed a PDF editor on your website and turn any PDF into a fillable form. The free plan allows unlimited PDFs with three submissions per PDF.</li>\n</ul>\n<h3><p>CDN and Protection</p>\n</h3><ul>\n<li><a href=\"https://stellate.co/\" rel=\"noopener noreferrer\">Stellate</a> - Stellate is a blazing-fast, reliable CDN for your GraphQL API and free for two services.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.jsdelivr.com/\" rel=\"noopener noreferrer\">jsdelivr.com</a> — A free, fast, and reliable open-source CDN. Supports npm, GitHub, WordPress, Deno, and more.</li>\n</ul>\n<ul>\n<li><a href=\"https://toranproxy.com/\" rel=\"noopener noreferrer\">toranproxy.com</a> — Proxy for Packagist and GitHub. Never fail CD. Free for personal use, one developer, no support</li>\n</ul>\n<h3><p>PaaS</p>\n</h3><ul>\n<li><a href=\"https://anvil.works\" rel=\"noopener noreferrer\">anvil.works</a> - Web app development with nothing but Python. Free tier with unlimited apps and 30-second timeouts.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.configure.it/\" rel=\"noopener noreferrer\">configure.it</a> — Mobile app development platform, free for two projects, limited features but no resource limits</li>\n</ul>\n<ul>\n<li><a href=\"https://gigalixir.com/\" rel=\"noopener noreferrer\">gigalixir.com</a> - Gigalixir provides one free instance that never sleeps and a free-tier PostgreSQL database limited to 2 connections, 10, 000 rows and no backups for Elixir/Phoenix apps.</li>\n</ul>\n<ul>\n<li><a href=\"https://glitch.com/\" rel=\"noopener noreferrer\">Glitch</a> — Free public hosting with code sharing and real-time collaboration features. The free plan has a 1000-hours/month limit.</li>\n</ul>\n<ul>\n<li><a href=\"https://pipedream.com\" rel=\"noopener noreferrer\">pipedream.com</a> - An integration platform built for developers. Develop any workflow based on any trigger. Workflows are code you can run <a href=\"https://docs.pipedream.com/pricing/\" rel=\"noopener noreferrer\">for free</a>. No server or cloud resources to manage.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.meteor.com/cloud\" rel=\"noopener noreferrer\">Meteor Cloud</a> — Galaxy hosting. Meteor's platform-as-a-service for Meteor apps includes free MongoDB Shared Hosting and automatic SSL.</li>\n</ul>\n<ul>\n<li><a href=\"https://northflank.com\" rel=\"noopener noreferrer\">Northflank</a> — Build and deploy microservices, jobs, and managed databases with a powerful UI, API &amp; CLI. Seamlessly scale containers from version control and external Docker registries. The free tier includes two services, two cron jobs and 1 database.</li>\n</ul>\n<ul>\n<li><a href=\"https://zeabur.com\" rel=\"noopener noreferrer\">Zeabur</a> - Deploy your services with one click. Free for three services, with US$ 5 free credits per month.</li>\n</ul>\n<h3><p>BaaS</p>\n</h3><ul>\n<li><a href=\"https://www.activepieces.com\" rel=\"noopener noreferrer\">Activepieces</a> - Build automation flows to connect several apps together in your app's backend. For example, send a Slack message or add a Google Sheet row when an event fires in your app. Free up to 5,000 tasks per month.</li>\n</ul>\n<ul>\n<li><a href=\"https://developers.bmc.com/site/global/bmc_helix_platform/program/overview/index.gsp\" rel=\"noopener noreferrer\">BMC Developer Program</a> — The BMC Developer Program provides documentation and resources to build and deploy digital innovations for your enterprise. Access to a comprehensive, personal sandbox that includes the platform, SDK, and a library of components that can be used to build and tailor apps.</li>\n</ul>\n<ul>\n<li><a href=\"https://convex.dev/\" rel=\"noopener noreferrer\">convex.dev</a> - Reactive backend as a service, hosting your data (documents with relationships &amp; serializable ACID transactions), serverless functions, and WebSockets to stream updates to various clients. Free for small projects - up to 1M records, 5M monthly function calls.</li>\n</ul>\n<ul>\n<li><a href=\"https://paraio.com\" rel=\"noopener noreferrer\">paraio.com</a> — Backend service API with flexible authentication, full-text search and caching. Free for one app, 1GB of app data.</li>\n</ul>\n<ul>\n<li><a href=\"https://zapier.com/\" rel=\"noopener noreferrer\">zapier.com</a> — Connect the apps you use to automate tasks. Five zaps every 15 minutes and 100 tasks/month</li>\n</ul>\n<ul>\n<li><a href=\"https://integrately.com\" rel=\"noopener noreferrer\">Integrately</a> — Automate tedious tasks with a single click. Free 100 Tasks, 15 Minute\nUpdate Time, five active automations, webhooks.</li>\n</ul>\n<h3><p>Web Hosting</p>\n</h3><ul>\n<li><a href=\"https://www.dappling.network/\" rel=\"noopener noreferrer\">dAppling Network</a> - Decentralized web hosting platform for Web3 frontends focusing on increasing uptime and security and providing an additional access point for users.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.digitalocean.com/pricing\" rel=\"noopener noreferrer\">DigitalOcean</a> - Build and deploy three static sites for free on the App Platform Starter tier.</li>\n</ul>\n<ul>\n<li><a href=\"https://preview.fenixwebserver.com\" rel=\"noopener noreferrer\">Fenix Web Server</a> - A developer desktop app for hosting sites locally and sharing them publically (in real-time). Work however you like, using its beautiful user interface, API, and/or CLI.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.lecturify.net/index.en.html\" rel=\"noopener noreferrer\">Lecturify</a> - Web hosting with SFPT access for file upload and download, php available.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.netlify.com/\" rel=\"noopener noreferrer\">Netlify</a> — Builds, deploys and hosts static site/app free for 100 GB data and 100 GB/month bandwidth.</li>\n</ul>\n<ul>\n<li><a href=\"https://pantheon.io/\" rel=\"noopener noreferrer\">pantheon.io</a> — Drupal and WordPress hosting, automated DevOps, and scalable infrastructure. Free for developers and agencies. No custom domain.</li>\n</ul>\n<ul>\n<li><a href=\"https://readthedocs.org/\" rel=\"noopener noreferrer\">readthedocs.org</a> — Free documentation hosting with versioning, PDF generation, and more</li>\n</ul>\n<ul>\n<li><a href=\"https://sourceforge.net/\" rel=\"noopener noreferrer\">SourceForge</a> — Find, Create, and Publish Open Source software for free</li>\n</ul>\n<ul>\n<li><a href=\"https://tilda.cc/\" rel=\"noopener noreferrer\">tilda.cc</a> — One site, 50 pages, 50 MB storage, only the main pre-defined blocks among 170+ available, no fonts, no favicon, and no custom domain</li>\n</ul>\n<ul>\n<li><a href=\"https://versoly.com/\" rel=\"noopener noreferrer\">Versoly</a> — SaaS-focused website builder - unlimited websites, 70+ blocks, five templates, custom CSS, favicon, SEO and forms. No custom domain.</li>\n</ul>\n<ul>\n<li><a href=\"https://qoddi.com\" rel=\"noopener noreferrer\">Qoddi</a> - PaaS service similar to Heroku with a developer-centric approach and all-inclusive features. Free tier for static assets, staging, and developer apps.</li>\n</ul>\n<ul>\n<li><a href=\"https://freeflarum.com/\" rel=\"noopener noreferrer\">FreeFlarum</a> - Community-powered free Flarum hosting for up to 250 users (donate to remove the watermark from the footer).</li>\n</ul>\n<ul>\n<li><a href=\"https://mdbgo.com/\" rel=\"noopener noreferrer\">MDB GO</a> - Free hosting for one project with two weeks Container TTL, 500 MB RAM per project, SFTP - 1G disk space.</li>\n</ul>\n<ul>\n<li><a href=\"https://patr.cloud/\" rel=\"noopener noreferrer\">Patr Cloud</a> — An easy-to-use cloud platform, among its paid services it offers to host three static sites for free.</li>\n</ul>\n<h3><p>DNS</p>\n</h3><ul>\n<li><a href=\"https://developers.cloudflare.com/1.1.1.1/\" rel=\"noopener noreferrer\">1.1.1.1</a> - Free public DNS Resolver, which is fast and secure (encrypt your DNS query), provided by Cloudflare. Useful to bypass your internet provider's DNS blocking, prevent DNS query spying, and <a href=\"https://developers.cloudflare.com/1.1.1.1/1.1.1.1-for-families\" rel=\"noopener noreferrer\">to block adult &amp; malware content</a>. It can also be used <a href=\"https://developers.cloudflare.com/1.1.1.1/encrypted-dns/dns-over-https/make-api-requests\" rel=\"noopener noreferrer\">via API</a>. Note: Just a DNS resolver, not a DNS hoster.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.1984.is/product/freedns/\" rel=\"noopener noreferrer\">1984.is</a> — Free DNS service with API and lots of other free DNS features included.</li>\n</ul>\n<ul>\n<li><a href=\"https://freedns.afraid.org/\" rel=\"noopener noreferrer\">freedns.afraid.org</a> — Free DNS hosting. Also, provide free subdomains based on numerous public user <a href=\"https://freedns.afraid.org/domain/registry/\" rel=\"noopener noreferrer\">contributed domains</a>. Get free subdomains from the \"Subdomains\" menu after signing up.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.luadns.com/\" rel=\"noopener noreferrer\">luadns.com</a> — Free DNS hosting, three domains, all features with reasonable limits</li>\n</ul>\n<ul>\n<li><a href=\"https://www.namecheap.com/domains/freedns/\" rel=\"noopener noreferrer\">namecheap.com</a> — Free DNS. No limit on the number of domains</li>\n</ul>\n<ul>\n<li><a href=\"https://nextdns.io\" rel=\"noopener noreferrer\">nextdns.io</a> - DNS-based firewall, 300K free queries monthly</li>\n</ul>\n<ul>\n<li><a href=\"https://www.noip.com/\" rel=\"noopener noreferrer\">noip</a> — a dynamic DNS service that allows up to 3 hostnames free with confirmation every 30 days</li>\n</ul>\n<ul>\n<li><a href=\"https://zilore.com/en/dns\" rel=\"noopener noreferrer\">zilore.com</a> — Free DNS hosting for 5 domains.</li>\n</ul>\n<ul>\n<li><a href=\"https://zonewatcher.com\" rel=\"noopener noreferrer\">zonewatcher.com</a> — Automatic backups and DNS change monitoring. One domain free</li>\n</ul>\n<h3><p>IaaS</p>\n</h3><ul>\n<li><a href=\"https://filebase.com/\" rel=\"noopener noreferrer\">filebase.com</a> - S3 Compatible Object Storage Powered by Blockchain. 5 GB free storage for an unlimited duration.</li>\n</ul>\n<ul>\n<li><a href=\"https://c2.synology.com/en-us/pricing/object-storage\" rel=\"noopener noreferrer\">C2 Object Storage</a> - S3 compatibility object storage. 15 GB free storage and 15 GB downloads per month.</li>\n</ul>\n<h3><p>Storage and Media Processing</p>\n</h3><ul>\n<li><a href=\"https://resmush.it\" rel=\"noopener noreferrer\">resmush.it</a> — reSmush.it is a FREE API that provides image optimization. reSmush.it has been implemented on the most common CMS such as WordPress, Drupal, or Magento. reSmush.it is the most used image optimization API with more than seven billion images already treated, and it is still Free of charge.</li>\n</ul>\n<h3><p>Design and UI</p>\n</h3><ul>\n<li><a href=\"https://floatui.com/\" rel=\"noopener noreferrer\">Float UI</a> - free web development tool for quickly creating modern, responsive websites with sleek design, even for non-designers.</li>\n</ul>\n<ul>\n<li><a href=\"https://backlight.dev/\" rel=\"noopener noreferrer\">Backlight</a> — With collaboration between developers and designers at heart, Backlight is a complete coding platform where teams build, document, publish, scale, and maintain Design Systems. The free plan allows up to 3 editors to work on one design system with unlimited viewers.</li>\n</ul>\n<ul>\n<li><a href=\"https://boxy-svg.com/app\" rel=\"noopener noreferrer\">BoxySVG</a> — A free installable Web app for drawing SVGs and exporting in SVG, PNG, jpeg, and other formats.</li>\n</ul>\n<ul>\n<li><a href=\"https://circumicons.com\" rel=\"noopener noreferrer\">Circum Icons</a> - Consistent open-source icons such as SVG for React, Vue, and Svelte.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.cleverbrush.com/\" rel=\"noopener noreferrer\">clevebrush.com</a> — Free Graphics Design / Photo Collage App. Also, they offer paid integration of it as a component.</li>\n</ul>\n<ul>\n<li><a href=\"https://cloudconvert.com/\" rel=\"noopener noreferrer\">cloudconvert.com</a> — Convert anything to anything. Two hundred eight supported formats including videos and gifs.</li>\n</ul>\n<ul>\n<li><a href=\"https://branition.com/colors\" rel=\"noopener noreferrer\">Branition</a> - Hand-curated color pallets best fitted for brands.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.css-gradient.com/\" rel=\"noopener noreferrer\">css-gradient.com</a> - Free tool to quickly generate custom cross-browser CSS gradients. In RGB and HEX format.</li>\n</ul>\n<ul>\n<li><a href=\"https://easyvectors.com/\" rel=\"noopener noreferrer\">easyvectors.com</a> — EasyVectors.com is a free SVG vector art stock. Download the best vector graphics absolutely for free.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.figma.com\" rel=\"noopener noreferrer\">figma.com</a> — Online, collaborative design tool for teams; free tier includes unlimited files and viewers with a max of 2 editors and three projects.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.framer.com/\" rel=\"noopener noreferrer\">framer.com</a> - Framer helps you iterate and animate interface ideas for your next app, website, or product—starting with powerful layouts. For anyone validating Framer as a professional prototyping tool: unlimited viewers, up to 2 editors, and up to 3 projects.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.landen.co\" rel=\"noopener noreferrer\">landen.co</a> — Generate, edit, and publish beautiful websites and landing pages for your startup. All without code. The free tier allows you to have one website, fully customizable and published on the web.</li>\n</ul>\n<ul>\n<li><a href=\"https://picsum.photos/\" rel=\"noopener noreferrer\">Lorem Picsum</a> - A Free tool, easy to use, stylish placeholders. After our URL, add your desired image size (width &amp; height), and you'll get a random image.</li>\n</ul>\n<ul>\n<li><a href=\"https://lottiefiles.com/\" rel=\"noopener noreferrer\">LottieFiles</a> - The world’s largest online platform for the world’s most miniature animation format for designers, developers, and more. Access Lottie animation tools and plugins for Android, iOS, and Web.</li>\n</ul>\n<ul>\n<li><a href=\"https://marvelapp.com/\" rel=\"noopener noreferrer\">marvelapp.com</a> — Design, prototyping, and collaboration, free plan limited to one user and project.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.mindmup.com/\" rel=\"noopener noreferrer\">Mindmup.com</a> — Unlimited mind maps for free and store them in the cloud. Your mind maps are available everywhere, instantly, from any device.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.mockplus.com/idoc\" rel=\"noopener noreferrer\">Mockplus iDoc</a> - Mockplus iDoc is a powerful design collaboration &amp; handoff tool. Free Plan includes three users and five projects with all features available.</li>\n</ul>\n<ul>\n<li><a href=\"https://octopus.do\" rel=\"noopener noreferrer\">Octopus.do</a> — Visual sitemap builder. Build your website structure in real time and rapidly share it to collaborate with your team or clients.</li>\n</ul>\n<ul>\n<li><a href=\"https://penpot.app\" rel=\"noopener noreferrer\">Penpot</a> - Web-based, open-source design and prototyping tool. Supports SVG. Completely free.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.pexels.com/\" rel=\"noopener noreferrer\">pexels.com</a> - Free stock photos for commercial use. Has a free API that allows you to search photos by keywords.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.plasmic.app/\" rel=\"noopener noreferrer\">Plasmic</a> - A fast, easy-to-use, robust web design tool and page builder that integrates into your codebase. Build responsive pages or complex components; optionally extend with code; and publish to production sites and apps.</li>\n</ul>\n<ul>\n<li><a href=\"https://pravatar.cc/\" rel=\"noopener noreferrer\">Pravatar</a> - Generate a random/placeholder fake avatar whose URL can be directly hot-linked in your web/app.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.proto.io\" rel=\"noopener noreferrer\">Proto.io</a> - Create fully interactive UI prototypes without coding. The free tier is available when the free trial ends. The free tier includes one user, one project, five prototypes, 100MB of online storage, and a preview of the proto.io app.</li>\n</ul>\n<ul>\n<li><a href=\"https://rive.app\" rel=\"noopener noreferrer\">Rive</a> — Create and ship beautiful animations to any platform. Free forever for Individuals. The service is an editor that also hosts all the graphics on their servers. They also provide runtimes for many platforms to run representations made using Rive.</li>\n</ul>\n<ul>\n<li><a href=\"https://storyset.com/\" rel=\"noopener noreferrer\">storyset.com</a> — Create incredible free customized illustrations for your project using this tool.</li>\n</ul>\n<ul>\n<li><a href=\"https://tabler-icons.io/\" rel=\"noopener noreferrer\">tabler-icons.io</a> — Over 1500 free copy-and-paste SVG editable icons.</li>\n</ul>\n<ul>\n<li><a href=\"https://ui-avatars.com/\" rel=\"noopener noreferrer\">UI Avatars</a> - Generate avatars with initials from names. The URLs can be directly hot-linked in your web/app. Support config parameters via the URL.</li>\n</ul>\n<ul>\n<li><a href=\"https://undraw.co/\" rel=\"noopener noreferrer\">unDraw</a> - A constantly updated collection of beautiful SVG images that you can use completely free without attribution.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.walkme.com/\" rel=\"noopener noreferrer\">walkme.com</a> — Enterprise Class Guidance and Engagement Platform, free plan three walk-thru up to 5 steps/walk.</li>\n</ul>\n<ul>\n<li><a href=\"https://webflow.com\" rel=\"noopener noreferrer\">Webflow</a> - WYSIWYG website builder with animations and website hosting. Free for two projects.</li>\n</ul>\n<ul>\n<li><a href=\"https://updrafts.app\" rel=\"noopener noreferrer\">Updrafts.app</a> - WYSIWYG website builder for tailwindcss-based designs. Free for non-commercial usage.</li>\n</ul>\n<ul>\n<li><a href=\"https://zeplin.io/\" rel=\"noopener noreferrer\">Zeplin</a> — Designer and developer collaboration platform. Show designs, assets, and style guides. Free for one project.</li>\n</ul>\n<ul>\n<li><a href=\"https://pixelixe.com/\" rel=\"noopener noreferrer\">Pixelixe</a> — Create and edit engaging, unique graphics and images online.</li>\n</ul>\n<ul>\n<li><a href=\"https://responsively.app\" rel=\"noopener noreferrer\">Responsively App</a> - A free dev tool for faster and more precise responsive web application development.</li>\n</ul>\n<ul>\n<li><a href=\"https://xlayers.dev\" rel=\"noopener noreferrer\">xLayers</a> - Preview and convert Sketch design files into Angular, React, Vue, LitElement, Stencil, Xamarin, and more (free and open source at <a href=\"https://github.com/xlayers/xlayers\" rel=\"noopener noreferrer\">https://github.com/xlayers/xlayers (⭐823)</a>)</li>\n</ul>\n<ul>\n<li><a href=\"https://grapedrop.com/\" rel=\"noopener noreferrer\">Grapedrop</a> — Responsive, powerful, SEO-optimized web page builder based on GrapesJS Framework. Free for the first five pages, unlimited custom domains, all features, and simple usage.</li>\n</ul>\n<ul>\n<li><a href=\"https://unicornplatform.com/\" rel=\"noopener noreferrer\">Unicorn Platform</a> - Effortless landing page builder with hosting. One website for free.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.svgrepo.com/\" rel=\"noopener noreferrer\">svgrepo.com</a> - Explore, search, and find the best-fitting icons or vectors for your projects using various vector libraries. Download free SVG Vectors for commercial use.</li>\n</ul>\n<ul>\n<li><a href=\"https://teleporthq.io/\" rel=\"noopener noreferrer\">TeleportHQ</a> - Low-code Front-end Design &amp; Development Platform. TeleportHQ is the collaborative front-end platform to instantly create and publish headless static websites. Three free projects, unlimited collaborators, and free code export.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.vertopal.com\" rel=\"noopener noreferrer\">Vertopal</a> - Vertopal is a free online platform for converting files to various formats. Including developer converters like JPG to SVG, GIF to APNG, PNG to WEBP, JSON to XML, etc.</li>\n</ul>\n<ul>\n<li><a href=\"https://okso.app\" rel=\"noopener noreferrer\">okso.app</a> - Minimalistic online drawing app. Allows to create fast sketches and visual notes. Exports sketches to PNG, JPG, SVG, and WEBP. Also installable as PWA. Free to use for everyone (no registration is needed).</li>\n</ul>\n<ul>\n<li><a href=\"https://mdbootstrap.com/\" rel=\"noopener noreferrer\">MDBootstrap</a> - Free for personal &amp; commercial use Bootstrap, Angular, React, and Vue UI Kits with over 700 components, stunning templates, 1-min installation, extensive tutorials &amp; colossal community.</li>\n</ul>\n<ul>\n<li><a href=\"https://hypercolor.dev/\" rel=\"noopener noreferrer\">hypercolor.dev</a> -- A curated collection of Tailwind CSS color gradients also provides a variety of generators to create your own.</li>\n</ul>\n<ul>\n<li><a href=\"https://icon-sets.iconify.design/\" rel=\"noopener noreferrer\">iconify.design</a> -- A collection of over 100 icon packs with a unified interface. Allows you to search for icons across packs and export individual icons as SVGs or for popular web frameworks.</li>\n</ul>\n<ul>\n<li><a href=\"https://nextui.org/\" rel=\"noopener noreferrer\">NextUI</a> -- Free. Beautiful, fast, and modern React &amp; Next.js UI library.</li>\n</ul>\n<ul>\n<li><a href=\"https://imagebgblurer.com/\" rel=\"noopener noreferrer\">Image BG Blurer</a> -- Generate a blurred background frame for an image, using that image source as the background blur, for Notion, Trello, Jira, and more tools</li>\n</ul>\n<ul>\n<li><a href=\"https://webstudio.is/\" rel=\"noopener noreferrer\">Webstudio</a> -- Open-source alternative to Webflow. The free plan offers unlimited websites on their domain. Five websites with custom domains. Ten thousand page views/month. 2 GB asset storage.</li>\n</ul>\n<h3><p>Design Inspiration</p>\n</h3><ul>\n<li><a href=\"https://www.awwwards.com/\" rel=\"noopener noreferrer\">awwwards.</a> - [Top websites] A showcase of all the best-designed websites (voted on by designers).</li>\n</ul>\n<ul>\n<li><a href=\"https://www.mobile-patterns.com/\" rel=\"noopener noreferrer\">Mobile Patterns</a> - [Mobile screenshots] A design inspirational library featuring the finest UI UX Patterns (iOS and Android) for designers, developers, and product makers to reference.</li>\n</ul>\n<h3><p>Payment and Billing Integration</p>\n</h3><ul>\n<li><a href=\"https://adapty.io/\" rel=\"noopener noreferrer\">Adapty.io</a> – One-stop solution with open-source SDK for mobile in-app subscription integration to iOS, Android, React Native, Flutter, Unity, or web app. Free up to $10k monthly revenue.</li>\n</ul>\n<ul>\n<li><a href=\"https://coinmarketcap.com/api/\" rel=\"noopener noreferrer\">CoinMarketCap</a> — Provides cryptocurrency market data including the latest crypto and fiat currency exchange rates. The free tier offers 10K call credits/month.</li>\n</ul>\n<ul>\n<li><a href=\"https://currencyapi.net/\" rel=\"noopener noreferrer\">CurrencyApi</a> — Live Currency Rates for Physical and Cryptocurrencies, delivered in JSON and XML. The free tier offers 1,250 API requests/month.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.moesif.com/\" rel=\"noopener noreferrer\">Moesif API Monetization</a> - Generate revenue from APIs via usage-based billing. Connect to Stripe, Chargebee, etc. The free tier offers 30,000 events/month.</li>\n</ul>\n<h3><p>Docker Related</p>\n</h3><ul>\n<li><a href=\"https://container-registry.com/\" rel=\"noopener noreferrer\">Container Registry Service</a> - Harbor based Container Management Solution. The free tier offers 1 GB of storage for private repositories.</li>\n</ul>\n<ul>\n<li><a href=\"https://labs.play-with-docker.com/\" rel=\"noopener noreferrer\">Play with Docker</a> — A simple, interactive, fun playground to learn Docker.</li>\n</ul>\n<h3><p>Dev Blogging Sites</p>\n</h3><ul>\n<li><a href=\"https://bearblog.dev/\" rel=\"noopener noreferrer\">BearBlog</a> - Minimalist, Markdown-powered blog and website builder.</li>\n</ul>\n<ul>\n<li><a href=\"https://medium.com/\" rel=\"noopener noreferrer\">Medium</a> — Get more thoughtful about what matters to you.</li>\n</ul>\n<ul>\n<li><a href=\"https://ayedot.com/\" rel=\"noopener noreferrer\">AyeDot</a> — Share your ideas, knowledge, and stories with the world for Free in the form of Modern multimedia short-format Miniblogs.</li>\n</ul>\n<h3><p>Commenting Platforms</p>\n</h3><ul>\n<li><a href=\"https://graphcomment.com/\" rel=\"noopener noreferrer\">GraphComment</a> - GraphComment is a comments platform that helps you build an active community from the website’s audience.</li>\n</ul>\n<ul>\n<li><a href=\"https://utteranc.es/\" rel=\"noopener noreferrer\">Utterances</a> - A lightweight comments widget built on GitHub issues. Use GitHub issues for blog comments, wiki pages, and more!</li>\n</ul>\n<ul>\n<li><a href=\"https://www.remarkbox.com/\" rel=\"noopener noreferrer\">Remarkbox</a> - Open source hosted comments platform, pay what you can for \"One moderator on a few domains with complete control over behavior &amp; appearance\"</li>\n</ul>\n<ul>\n<li><a href=\"https://intensedebate.com/\" rel=\"noopener noreferrer\">IntenseDebate</a> - A feature-rich comment system for WordPress, Tumblr, Blogger, and many other website platforms.</li>\n</ul>\n<h3><p>Flutter Related and Building IOS Apps without Mac</p>\n</h3><ul>\n<li><a href=\"https://flutlab.io/\" rel=\"noopener noreferrer\">FlutLab</a> - FlutLab is a modern Flutter online IDE and the best place to create, debug, and build cross-platform projects. Build iOS (Without a Mac) and Android apps with Flutter.</li>\n</ul>\n<ul>\n<li><a href=\"https://codemagic.io/\" rel=\"noopener noreferrer\">CodeMagic</a> - Codemagic is a fully hosted and managed CI/CD for mobile apps. You can build, test, and deploy with a GUI-based CI/CD tool. The free tier offers 500 free minutes/month and a Mac Mini instance with 2.3 GHz and 8 GB of RAM.</li>\n</ul>\n<h3><p>Browser-based hardware emulation written in Javascript</p>\n</h3><ul>\n<li><a href=\"https://s-macke.github.io/jor1k/demos/main.html\" rel=\"noopener noreferrer\">Jor1k</a> —  an OpenRISC virtual machine capable of running Linux with network support.</li>\n</ul>\n<ul>\n<li><a href=\"https://copy.sh/v86\" rel=\"noopener noreferrer\">v86</a> — an x86 virtual machine capable of running Linux and other OS directly into the browser.</li>\n</ul>\n<h3><p>Privacy Management</p>\n</h3><ul>\n<li><a href=\"https://www.bearer.sh/\" rel=\"noopener noreferrer\">Bearer</a> - Helps implement privacy by design via audits and continuous workflows so that organizations comply with GDPR and other regulations. The free tier is limited to smaller teams and the SaaS version only.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.osano.com/\" rel=\"noopener noreferrer\">Osano</a> - Consent management and compliance platform with everything from GDPR representation to cookie banners. The free tier offers basic features.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.iubenda.com/\" rel=\"noopener noreferrer\">Iubenda</a> - Privacy and cookie policies and consent management. The free tier offers limited privacy and cookie policy as well as cookie banners.</li>\n</ul>\n<ul>\n<li><a href=\"https://cookiefirst.com/\" rel=\"noopener noreferrer\">Cookiefirst</a> - Cookie banners, auditing, and multi-language consent management solution. The free tier offers a one-time scan and a single banner.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ketch.com/\" rel=\"noopener noreferrer\">Ketch</a> - Consent management and privacy framework tool. The free tier offers most features with a limited visitor count.</li>\n</ul>\n<h3><p>Miscellaneous</p>\n</h3><ul>\n<li><a href=\"https://binshare.net\" rel=\"noopener noreferrer\">BinShare.net</a> - Create &amp; share code or binaries. Available to share as a beautiful image e.g. for Twitter / Facebook post or as a link e.g. for chats or forums.</li>\n</ul>\n<ul>\n<li><a href=\"https://blynk.io\" rel=\"noopener noreferrer\">Blynk</a> — A SaaS with API to control, build &amp; evaluate IoT devices. Free Developer Plan with 5 devices, Free Cloud &amp; data storage. Mobile Apps are also available.</li>\n</ul>\n<ul>\n<li><a href=\"https://carbon.now.sh\" rel=\"noopener noreferrer\">Carbon.now.sh</a> - create and share code snippets in an aesthetic screenshot-like image format. Usually used to aesthetically share/show off code snippets on Twitter or blog posts.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.codepng.app\" rel=\"noopener noreferrer\">Codepng</a> - Create excellent snapshots from your source code to share on social media.</li>\n</ul>\n<ul>\n<li><a href=\"https://cronhooks.io/\" rel=\"noopener noreferrer\">Cronhooks</a> - Schedule on-time or recurring webhooks. The free plan allows 5 ad-hoc schedules.</li>\n</ul>\n<ul>\n<li><a href=\"https://cron-job.org\" rel=\"noopener noreferrer\">cron-job.org</a> - Online cronjobs service. Unlimited jobs are free of charge.</li>\n</ul>\n<ul>\n<li><a href=\"https://domain-forward.com/\" rel=\"noopener noreferrer\">Domain Forward</a> - A straightforward tool to forward any URL or Domain. Free up to 5 domains and 200k requests per month.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.format-express.dev\" rel=\"noopener noreferrer\">Format Express</a> - Instant online format for JSON / XML / SQL.</li>\n</ul>\n<ul>\n<li><a href=\"https://kandi.openweaver.com/\" rel=\"noopener noreferrer\">kandi</a> — Jumpstart Application Development: build custom functions, and use cases, and complete applications faster through code snippets and open-source library reuse.</li>\n</ul>\n<ul>\n<li><a href=\"https://newreleases.io/\" rel=\"noopener noreferrer\">newreleases.io</a> - Receive notifications on email, Slack, Telegram, Discord, and custom webhooks for new releases from GitHub, GitLab, Bitbucket, Python PyPI, Java Maven, Node.js NPM, Node.js Yarn, Ruby Gems, PHP Packagist, .NET NuGet, Rust Cargo and Docker Hub.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.pdfmonkey.io/\" rel=\"noopener noreferrer\">PDFMonkey</a> — Manage PDF templates in a dashboard, call the API with dynamic data, and download your PDF. Offers 300 free documents per month.</li>\n</ul>\n<ul>\n<li><a href=\"https://pika.style/templates/code-image\" rel=\"noopener noreferrer\">Pika Code Screenshots</a> — Create beautiful, customizable screenshots from code snippets and VSCode using the extension.</li>\n</ul>\n<ul>\n<li><a href=\"https://quicktype.io/\" rel=\"noopener noreferrer\">QuickType.io</a> - Quickly auto-generate models/class/type/interface and serializers from JSON, schema, and GraphQL for working with data quickly &amp; safely in any programming language. Convert JSON into gorgeous, typesafe code in any language.</li>\n</ul>\n<ul>\n<li><a href=\"https://randomkeygen.com/\" rel=\"noopener noreferrer\">RandomKeygen</a> - A free mobile-friendly tool that offers a variety of randomly generated keys and passwords you can use to secure any application, service, or device.</li>\n</ul>\n<ul>\n<li><a href=\"https://redirect.pizza/\" rel=\"noopener noreferrer\">redirect.pizza</a> - Easily manage redirects with HTTPS support. The free plan includes 10 sources and 100,000 hits per month.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.surveymonkey.com\" rel=\"noopener noreferrer\">SurveyMonkey.com</a> — Create online surveys. Analyze the results online. The free plan allows only 10 questions and 100 responses per survey.</li>\n</ul>\n<ul>\n<li><a href=\"https://versionfeeds.com\" rel=\"noopener noreferrer\">Versionfeeds</a> — Custom RSS feeds for releases of your favorite software. Have the latest versions of your programming languages, libraries, or loved tools in one feed. (The first 3 feeds are free)</li>\n</ul>\n<h3><p>Remote Desktop Tools</p>\n</h3><ul>\n<li><a href=\"https://rustdesk.com/\" rel=\"noopener noreferrer\">RustDesk</a> - Open source virtual/remote desktop infrastructure for everyone!</li>\n</ul>\n<h3><p>Game Development</p>\n</h3><ul>\n<li><a href=\"https://itch.io/game-assets\" rel=\"noopener noreferrer\">itch.io</a> — Free/Paid assets like sprites, tile sets, and character packs.</li>\n</ul>\n<ul>\n<li><a href=\"https://gamefresco.com/\" rel=\"noopener noreferrer\">Gamefresco.com</a> — Discover, collect, and share free game assets from game artists everywhere.</li>\n</ul>\n<ul>\n<li><a href=\"https://opengameart.org\" rel=\"noopener noreferrer\">OpenGameArt</a> — OpenSource Game Assets like music, sounds, sprites, and gifs.</li>\n</ul>\n<ul>\n<li><a href=\"https://game-icons.net/\" rel=\"noopener noreferrer\">Game Icons</a> - Free styleable SVG/PNG icons provided under a CC-BY license.</li>\n</ul>\n<ul>\n<li><a href=\"https://lospec.com/\" rel=\"noopener noreferrer\">LoSpec</a> — Online tools for creating pixel art and other restrictive digital art, lots of tutorials/pallet list available to choose from for your games</li>\n</ul>\n<ul>\n<li><a href=\"https://www.artstation.com/\" rel=\"noopener noreferrer\">ArtStation</a> - MarketPlace for Free/Paid 2D, 3D assets &amp; audios, icons, tile sets, game kits. Also, It can be used for showcasing your art portfolio.</li>\n</ul>\n<h3><p>Other Free Resources</p>\n</h3><ul>\n<li><a href=\"https://developers.redhat.com\" rel=\"noopener noreferrer\">RedHat for Developers</a> — Free access to Red Hat products including RHEL, OpenShift, CodeReady, etc. exclusively for developers. Individual plan only. Free e-books are also offered for reference.</li>\n</ul>\n<ul>\n<li><a href=\"https://snapshooter.com/\" rel=\"noopener noreferrer\">SnapShooter</a> — Backup solution for DigitalOcean, AWS, LightSail, Hetzner, and Exoscale, with support for direct database, file system and application backups to s3 based storage. Provides a free plan with daily backups for one resource.</li>\n</ul>\n<ul>\n<li><a href=\"https://web.dev/measure/\" rel=\"noopener noreferrer\">Web.Dev</a> — This is a free tool that allows you to see the performance of your website and improve the SEO to get a higher rank list in search engines.</li>\n</ul>\n<ul>\n<li><a href=\"https://smalldev.tools/\" rel=\"noopener noreferrer\">SmallDev.tools</a> — A free tool for developers that allows you to Encode/Decode various formats, Minify HTML/CSS/Javascript, Beautify, Generate Fake/Testing datasets in JSON/CSV &amp; multiple other formats and many more features. With a delightful interface.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.wrappixel.com/\" rel=\"noopener noreferrer\">WrapPixel</a> — Download High Quality Free and Premium Admin dashboard template created with Angular, React, VueJs, NextJS, and NuxtJS!</li>\n</ul>\n<ul>\n<li><a href=\"https://utils.fun/en\" rel=\"noopener noreferrer\">Utils.fun</a> — All offline daily and development tools based on the browser's computing power, including watermark generation, screen recording, encoding and decoding, encryption and decryption, and code formatting, are completely free and do not upload any data to the cloud for processing.</li>\n</ul>\n<ul>\n<li><a href=\"https://freecodetools.org/\" rel=\"noopener noreferrer\">Free Code Tools</a> — Effective code tools which are 100% free. Markdown editor, Code minifier/beautifier, QR code generator, Open Graph Generator, Twitter card Generator, and more.</li>\n</ul>\n<ul>\n<li><a href=\"https://adminmart.com/\" rel=\"noopener noreferrer\">AdminMart</a> — High-Quality Free and Premium Admin Dashboard and Website Templates created with Angular, Bootstrap, React, VueJs, NextJS, and NuxtJS!</li>\n</ul>\n",
      "date_published": "2023-09-29T22:34:30.000Z",
      "date_modified": "2023-09-29T22:34:30.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/wilsonfreitas/awesome-quant/",
      "title": "Awesome Quant",
      "_slug": "wilsonfreitas/awesome-quant/",
      "_filepath": "/content/wilsonfreitas/awesome-quant/README.md",
      "url": "https://www.trackawesomelist.com/wilsonfreitas/awesome-quant/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Reproducing Works, Training & Books / Data Visualization\n\n*   [MesoSim Options Trading Strategy Library (⭐11)](https://github.com/deltaray-io/strategy-library) - Free and public Options Trading strategy library for MesoSim.",
      "content_html": "<h3><p>Reproducing Works, Training &amp; Books / Data Visualization</p>\n</h3><ul>\n<li><a href=\"https://github.com/deltaray-io/strategy-library\" rel=\"noopener noreferrer\">MesoSim Options Trading Strategy Library (⭐11)</a> - Free and public Options Trading strategy library for MesoSim.</li>\n</ul>\n",
      "date_published": "2023-09-29T19:20:33.000Z",
      "date_modified": "2023-09-29T19:20:33.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/vitejs/awesome-vite/",
      "title": "Awesome Vite",
      "_slug": "vitejs/awesome-vite/",
      "_filepath": "/content/vitejs/awesome-vite/README.md",
      "url": "https://www.trackawesomelist.com/vitejs/awesome-vite/",
      "summary": "2 awesome projects updated",
      "content_text": "\n\n### Templates / Vanilla\n\n*   [vite-starter-markup-template (⭐58)](https://github.com/Grinch3214/vite-starter-markup-template) - Starter template for Markup.\n\n### Templates / React\n\n*   [vite-react-chakra-starter (⭐112)](https://github.com/sozonome/vite-react-chakra-starter) - Starter template for creating React App with TypeScript and Chakra UI. Configured with ESLint, Prettier, and Husky.\n*   [vite-react-tailwind-starter (⭐62)](https://github.com/sozonome/vite-react-tailwind-starter) - Starter template for creating React App with TypeScript and Tailwind CSS with Shadcn UI. Configured with ESLint, Prettier, and Husky.",
      "content_html": "<h3><p>Templates / Vanilla</p>\n</h3><ul>\n<li><a href=\"https://github.com/Grinch3214/vite-starter-markup-template\" rel=\"noopener noreferrer\">vite-starter-markup-template (⭐58)</a> - Starter template for Markup.</li>\n</ul>\n<h3><p>Templates / React</p>\n</h3><ul>\n<li><a href=\"https://github.com/sozonome/vite-react-chakra-starter\" rel=\"noopener noreferrer\">vite-react-chakra-starter (⭐112)</a> - Starter template for creating React App with TypeScript and Chakra UI. Configured with ESLint, Prettier, and Husky.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/sozonome/vite-react-tailwind-starter\" rel=\"noopener noreferrer\">vite-react-tailwind-starter (⭐62)</a> - Starter template for creating React App with TypeScript and Tailwind CSS with Shadcn UI. Configured with ESLint, Prettier, and Husky.</li>\n</ul>\n",
      "date_published": "2023-09-29T16:01:47.000Z",
      "date_modified": "2023-09-29T19:25:14.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/rockerBOO/awesome-neovim/",
      "title": "Awesome Neovim",
      "_slug": "rockerBOO/awesome-neovim/",
      "_filepath": "/content/rockerBOO/awesome-neovim/README.md",
      "url": "https://www.trackawesomelist.com/rockerBOO/awesome-neovim/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Colorscheme Creation / Diagnostics\n\n*   [roobert/palette.nvim (⭐81)](https://github.com/roobert/palette.nvim) - A beautiful, versatile, systematic, theme system.",
      "content_html": "<h3><p>Colorscheme Creation / Diagnostics</p>\n</h3><ul>\n<li><a href=\"https://github.com/roobert/palette.nvim\" rel=\"noopener noreferrer\">roobert/palette.nvim (⭐81)</a> - A beautiful, versatile, systematic, theme system.</li>\n</ul>\n",
      "date_published": "2023-09-29T14:24:44.000Z",
      "date_modified": "2023-09-29T14:24:44.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/kdeldycke/awesome-billing/",
      "title": "Awesome Billing",
      "_slug": "kdeldycke/awesome-billing/",
      "_filepath": "/content/kdeldycke/awesome-billing/README.md",
      "url": "https://www.trackawesomelist.com/kdeldycke/awesome-billing/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Cost Forecast / Market Research\n\n*   [Time Series Prediction - A short introduction for pragmatists](https://www.liip.ch/en/blog/time-series-prediction-a-short-comparison-of-best-practices) - Great introduction on how time series can be used to evaluate business problems.\n*   [Darts (⭐8.7k)](https://github.com/unit8co/darts) - Python library for user-friendly forecasting and anomaly detection on time series. It wraps a huge number of models, including [Prophet](https://facebook.github.io/prophet/). Great for experiments, but bear in mind that all the [models in Darts expects](https://news.ycombinator.com/item?id=37665435) that your data comes at a very regular interval, and make a lot of assumptions about their shape.",
      "content_html": "<h3><p>Cost Forecast / Market Research</p>\n</h3><ul>\n<li><a href=\"https://www.liip.ch/en/blog/time-series-prediction-a-short-comparison-of-best-practices\" rel=\"noopener noreferrer\">Time Series Prediction - A short introduction for pragmatists</a> - Great introduction on how time series can be used to evaluate business problems.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/unit8co/darts\" rel=\"noopener noreferrer\">Darts (⭐8.7k)</a> - Python library for user-friendly forecasting and anomaly detection on time series. It wraps a huge number of models, including <a href=\"https://facebook.github.io/prophet/\" rel=\"noopener noreferrer\">Prophet</a>. Great for experiments, but bear in mind that all the <a href=\"https://news.ycombinator.com/item?id=37665435\" rel=\"noopener noreferrer\">models in Darts expects</a> that your data comes at a very regular interval, and make a lot of assumptions about their shape.</li>\n</ul>\n",
      "date_published": "2023-09-29T13:40:01.000Z",
      "date_modified": "2023-09-29T13:40:01.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/h4cc/awesome-elixir/",
      "title": "Awesome Elixir",
      "_slug": "h4cc/awesome-elixir/",
      "_filepath": "/content/h4cc/awesome-elixir/README.md",
      "url": "https://www.trackawesomelist.com/h4cc/awesome-elixir/",
      "summary": "2 awesome projects updated",
      "content_text": "\n\n### Actors\n\n*   [spawn (⭐325)](https://github.com/eigr/spawn) - Elixir poliglot actors service mesh.\n\n### Books\n\n*   [Async Elixir (⭐171)](https://github.com/Arp-G/async-elixir) - Dive into Elixir's world of concurrency and processes with this interactive Livebook.",
      "content_html": "<h3><p>Actors</p>\n</h3><ul>\n<li><a href=\"https://github.com/eigr/spawn\" rel=\"noopener noreferrer\">spawn (⭐325)</a> - Elixir poliglot actors service mesh.</li>\n</ul>\n<h3><p>Books</p>\n</h3><ul>\n<li><a href=\"https://github.com/Arp-G/async-elixir\" rel=\"noopener noreferrer\">Async Elixir (⭐171)</a> - Dive into Elixir's world of concurrency and processes with this interactive Livebook.</li>\n</ul>\n",
      "date_published": "2023-09-29T10:01:17.000Z",
      "date_modified": "2023-09-29T15:34:42.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/AdrienTorris/awesome-blazor/",
      "title": "Awesome Blazor",
      "_slug": "AdrienTorris/awesome-blazor/",
      "_filepath": "/content/AdrienTorris/awesome-blazor/README.md",
      "url": "https://www.trackawesomelist.com/AdrienTorris/awesome-blazor/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Videos / Others\n\n*   [Beautiful Blazor UI Everywhere with Telerik](https://www.youtube.com/watch?v=PQe-q8faMOI) - ![duration](https://img.shields.io/badge/Duration:%20-27%20min-%230094FF?style=flat-square\\&cacheSeconds=maxAge\\&logo=youtube) August 22, 2023 - Becky is joined by Sam Basu from Progress showing off the latest controls for Blazor and Blazor Hybrid apps with Telerik UI.\n*   [New Blazor Rendering Mode Features in .NET 8.0](https://www.youtube.com/watch?v=VDyN8SnevzI) - ![duration](https://img.shields.io/badge/Duration:%20-11%20min-%230094FF?style=flat-square\\&cacheSeconds=maxAge\\&logo=youtube) August 14, 2023 - In this video we'll explore how to integrate the new Blazor Server Side rendering capabilities in .NET 8.0 with the traditional Blazor WebAssembly and Blazor Server (SignalR) hosting models for a rich client-side experience. We'll explore the differences between these different options, how to seamlessly implement each option where it makes sense, and discuss different architecture approaches with Blazor in ASP.NET Core 8.0.\n*   [What's New in Blazor for .NET 8](https://www.youtube.com/watch?v=QD2-DwuOfKM) - ![duration](https://img.shields.io/badge/Duration:%20-66%20min-%230094FF?style=flat-square\\&cacheSeconds=maxAge\\&logo=youtube) August 4, 2023 - Come find out about the future of Blazor in .NET 8! We'll explore all the upcoming features and improvements, including our effort to create a unified full stack web UI programming model that combines the strengths of client and server. We hope to see you there.\n*   [What is the Future of Blazor? Should I Learn Blazor?](https://www.youtube.com/watch?v=OUUlO8fQOfE) - ![duration](https://img.shields.io/badge/Duration:%20-23%20min-%230094FF?style=flat-square\\&cacheSeconds=maxAge\\&logo=youtube) July 27, 2023 - Should I learn a JavaScript framework or concentrate on mastering Blazor? What is the future of Blazor? Is Microsoft invested in making Blazor great? We will answer these questions in today's Dev Questions episode.\n*   [Burke Learns Blazor - Let's build the API!](https://www.youtube.com/watch?v=9OSpY3Yi5ic) - ![duration](https://img.shields.io/badge/Duration:%20-103%20min-%230094FF?style=flat-square\\&cacheSeconds=maxAge\\&logo=youtube) June 30 - Last week we got the API started - let's finish it up and start on the UI. [Url list](https://www.theurlist.com/burke-learns-blazor).\n*   [Burke learns Blazor by porting a Vue.js app to Blazor](https://www.youtube.com/watch?v=fetGhhVYsLY) - ![duration](https://img.shields.io/badge/Duration:%20-86%20min-%230094FF?style=flat-square\\&cacheSeconds=maxAge\\&logo=youtube) June 15, 2021 - This summer, Burke and Jon are porting theurlist.com to Blazor - a real world JavaScript application written in Vue.js. Join them each week as they use Visual Studio, Visual Studio Code and GitHub Copilot to rebuild this app and try to tackle every frontend issue you might encounter along the way. [Community links](https://www.theurlist.com/burke-learns-blazor).\n*   [Running Blazor in Production, Lessons Learned](https://www.youtube.com/watch?v=6ctA95pZJoc) - ![duration](https://img.shields.io/badge/Duration:%20-55%20min-%230094FF?style=flat-square\\&cacheSeconds=maxAge\\&logo=youtube) May 24, 2023 - Since we started using Blazor in 2019, it's been an excellent tool for our team of C# developers. Even when Blazor was brand new, we used it in our latest project, which really helped us. Seeing other people in our field, I can say that Blazor was a key to our project's success. Our journey with Blazor has mostly been easy, but we have still learned a lot along the way. In this video, I will share some tips and lessons we have picked up. I will also discuss how to make smart choices and avoid problems when you're changing your existing project to use Blazor.\n*   [Running Blazor in production, lessons learned - Jimmy Engström - NDC London 2023](https://www.youtube.com/watch?v=bZdYpYQb958) - ![duration](https://img.shields.io/badge/Duration:%20-57%20min-%230094FF?style=flat-square\\&cacheSeconds=maxAge\\&logo=youtube) May 19, 2023 - We have been running Blazor in production for over two years now. Everyone in our team is a C# developer, so when we went into our latest project Blazor was a natural choice, even though Blazor was only a week old. Looking at my peers working in the same space, I am convinced that it saved our project by switching to Blazor. Even though it has been mostly smooth sailing we have learned a lot during the years. In this session, Jimmy Engström will give you some of the tips, tricks, and learnings we have collected over the years, when to choose what, and how to avoid pitfalls converting your exiting project to Blazor.",
      "content_html": "<h3><p>Videos / Others</p>\n</h3><ul>\n<li><a href=\"https://www.youtube.com/watch?v=PQe-q8faMOI\" rel=\"noopener noreferrer\">Beautiful Blazor UI Everywhere with Telerik</a> - <img src=\"https://img.shields.io/badge/Duration:%20-27%20min-%230094FF?style=flat-square&amp;cacheSeconds=maxAge&amp;logo=youtube\" alt=\"duration\" /> August 22, 2023 - Becky is joined by Sam Basu from Progress showing off the latest controls for Blazor and Blazor Hybrid apps with Telerik UI.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=VDyN8SnevzI\" rel=\"noopener noreferrer\">New Blazor Rendering Mode Features in .NET 8.0</a> - <img src=\"https://img.shields.io/badge/Duration:%20-11%20min-%230094FF?style=flat-square&amp;cacheSeconds=maxAge&amp;logo=youtube\" alt=\"duration\" /> August 14, 2023 - In this video we'll explore how to integrate the new Blazor Server Side rendering capabilities in .NET 8.0 with the traditional Blazor WebAssembly and Blazor Server (SignalR) hosting models for a rich client-side experience. We'll explore the differences between these different options, how to seamlessly implement each option where it makes sense, and discuss different architecture approaches with Blazor in ASP.NET Core 8.0.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=QD2-DwuOfKM\" rel=\"noopener noreferrer\">What's New in Blazor for .NET 8</a> - <img src=\"https://img.shields.io/badge/Duration:%20-66%20min-%230094FF?style=flat-square&amp;cacheSeconds=maxAge&amp;logo=youtube\" alt=\"duration\" /> August 4, 2023 - Come find out about the future of Blazor in .NET 8! We'll explore all the upcoming features and improvements, including our effort to create a unified full stack web UI programming model that combines the strengths of client and server. We hope to see you there.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=OUUlO8fQOfE\" rel=\"noopener noreferrer\">What is the Future of Blazor? Should I Learn Blazor?</a> - <img src=\"https://img.shields.io/badge/Duration:%20-23%20min-%230094FF?style=flat-square&amp;cacheSeconds=maxAge&amp;logo=youtube\" alt=\"duration\" /> July 27, 2023 - Should I learn a JavaScript framework or concentrate on mastering Blazor? What is the future of Blazor? Is Microsoft invested in making Blazor great? We will answer these questions in today's Dev Questions episode.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=9OSpY3Yi5ic\" rel=\"noopener noreferrer\">Burke Learns Blazor - Let's build the API!</a> - <img src=\"https://img.shields.io/badge/Duration:%20-103%20min-%230094FF?style=flat-square&amp;cacheSeconds=maxAge&amp;logo=youtube\" alt=\"duration\" /> June 30 - Last week we got the API started - let's finish it up and start on the UI. <a href=\"https://www.theurlist.com/burke-learns-blazor\" rel=\"noopener noreferrer\">Url list</a>.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=fetGhhVYsLY\" rel=\"noopener noreferrer\">Burke learns Blazor by porting a Vue.js app to Blazor</a> - <img src=\"https://img.shields.io/badge/Duration:%20-86%20min-%230094FF?style=flat-square&amp;cacheSeconds=maxAge&amp;logo=youtube\" alt=\"duration\" /> June 15, 2021 - This summer, Burke and Jon are porting theurlist.com to Blazor - a real world JavaScript application written in Vue.js. Join them each week as they use Visual Studio, Visual Studio Code and GitHub Copilot to rebuild this app and try to tackle every frontend issue you might encounter along the way. <a href=\"https://www.theurlist.com/burke-learns-blazor\" rel=\"noopener noreferrer\">Community links</a>.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=6ctA95pZJoc\" rel=\"noopener noreferrer\">Running Blazor in Production, Lessons Learned</a> - <img src=\"https://img.shields.io/badge/Duration:%20-55%20min-%230094FF?style=flat-square&amp;cacheSeconds=maxAge&amp;logo=youtube\" alt=\"duration\" /> May 24, 2023 - Since we started using Blazor in 2019, it's been an excellent tool for our team of C# developers. Even when Blazor was brand new, we used it in our latest project, which really helped us. Seeing other people in our field, I can say that Blazor was a key to our project's success. Our journey with Blazor has mostly been easy, but we have still learned a lot along the way. In this video, I will share some tips and lessons we have picked up. I will also discuss how to make smart choices and avoid problems when you're changing your existing project to use Blazor.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=bZdYpYQb958\" rel=\"noopener noreferrer\">Running Blazor in production, lessons learned - Jimmy Engström - NDC London 2023</a> - <img src=\"https://img.shields.io/badge/Duration:%20-57%20min-%230094FF?style=flat-square&amp;cacheSeconds=maxAge&amp;logo=youtube\" alt=\"duration\" /> May 19, 2023 - We have been running Blazor in production for over two years now. Everyone in our team is a C# developer, so when we went into our latest project Blazor was a natural choice, even though Blazor was only a week old. Looking at my peers working in the same space, I am convinced that it saved our project by switching to Blazor. Even though it has been mostly smooth sailing we have learned a lot during the years. In this session, Jimmy Engström will give you some of the tips, tricks, and learnings we have collected over the years, when to choose what, and how to avoid pitfalls converting your exiting project to Blazor.</li>\n</ul>\n",
      "date_published": "2023-09-29T07:45:29.000Z",
      "date_modified": "2023-09-29T07:45:29.000Z"
    }
  ]
}
