{
  "version": "https://jsonfeed.org/version/1",
  "icon": "https://www.trackawesomelist.com/icon.png",
  "favicon": "https://www.trackawesomelist.com/favicon.ico",
  "language": "en",
  "title": "Track Awesome Wpo Updates Daily",
  "_seo_title": "Track Awesome Wpo (davidsonfellipe/awesome-wpo) Updates Daily - Track Awesome List",
  "_site_title": "Track Awesome List",
  "description": ":pencil: A curated list of Web Performance Optimization. Everyone can contribute here!",
  "home_page_url": "https://www.trackawesomelist.com/davidsonfellipe/awesome-wpo/",
  "feed_url": "https://www.trackawesomelist.com/davidsonfellipe/awesome-wpo/feed.json",
  "items": [
    {
      "id": "https://www.trackawesomelist.com/2025/02/13/",
      "title": "Awesome Wpo Updates on Feb 13, 2025",
      "_short_title": "Feb 13, 2025",
      "_slug": "2025/02/13/",
      "summary": "1 awesome projects updated on Feb 13, 2025",
      "_filepath": "/content/2025/02/13/README.md",
      "url": "https://www.trackawesomelist.com/2025/02/13/",
      "date_published": "2025-02-13T05:27:01.000Z",
      "date_modified": "2025-02-13T05:27:01.000Z",
      "content_text": "\n\n### Image Optimizers / Meetups\n\n*   [Optimizt (⭐135)](https://github.com/343dev/optimizt) - CLI image optimization tool. It can compress PNG, JPEG, GIF and SVG lossy and lossless, and also create AVIF and WebP versions for raster images.",
      "content_html": "<h3><p>Image Optimizers / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/343dev/optimizt\" rel=\"noopener noreferrer\">Optimizt (⭐135)</a> - CLI image optimization tool. It can compress PNG, JPEG, GIF and SVG lossy and lossless, and also create AVIF and WebP versions for raster images.</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2025/01/19/",
      "title": "Awesome Wpo Updates on Jan 19, 2025",
      "_short_title": "Jan 19, 2025",
      "_slug": "2025/01/19/",
      "summary": "1 awesome projects updated on Jan 19, 2025",
      "_filepath": "/content/2025/01/19/README.md",
      "url": "https://www.trackawesomelist.com/2025/01/19/",
      "date_published": "2025-01-19T22:37:22.000Z",
      "date_modified": "2025-01-19T22:37:22.000Z",
      "content_text": "\n\n### Image Optimizers / Meetups\n\n*   [ResponsiveImage](https://responsive-image.dev/) - Generate optimized images (WebP, AVIF) and LQIP placeholders using Vite or webpack plugins and render responsive image markup with an image component for multiple frameworks.",
      "content_html": "<h3><p>Image Optimizers / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://responsive-image.dev/\" rel=\"noopener noreferrer\">ResponsiveImage</a> - Generate optimized images (WebP, AVIF) and LQIP placeholders using Vite or webpack plugins and render responsive image markup with an image component for multiple frameworks.</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2024/04/25/",
      "title": "Awesome Wpo Updates on Apr 25, 2024",
      "_short_title": "Apr 25, 2024",
      "_slug": "2024/04/25/",
      "summary": "4 awesome projects updated on Apr 25, 2024",
      "_filepath": "/content/2024/04/25/README.md",
      "url": "https://www.trackawesomelist.com/2024/04/25/",
      "date_published": "2024-04-25T20:38:53.000Z",
      "date_modified": "2024-04-25T20:38:53.000Z",
      "content_text": "\n\n### Analyzers - API / Meetups\n\n*   [Datadog APM](https://www.datadoghq.com/product/apm/) - End-to-end distributed tracing and APM at scale, correlated to all telemetry.\n\n### Image Optimizers / Meetups\n\n*   [Shortpixel](https://shortpixel.com/online-image-compression) - Compress Your Image by removing unnecessary bytes of the image and Convert it into WebP/AVIF\n*   [Tapnesh-CLI (⭐21)](https://github.com/JafarAkhondali/Tapnesh) - Tapnesh is a CLI tool that will optimize all your images in parallel easily and efficiently!\n\n### Web server Modules / Meetups\n\n*   [imteekay/web-performance-research (⭐972)](https://github.com/imteekay/web-performance-research) - Research in Web Performance",
      "content_html": "<h3><p>Analyzers - API / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://www.datadoghq.com/product/apm/\" rel=\"noopener noreferrer\">Datadog APM</a> - End-to-end distributed tracing and APM at scale, correlated to all telemetry.</li>\n</ul>\n<h3><p>Image Optimizers / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://shortpixel.com/online-image-compression\" rel=\"noopener noreferrer\">Shortpixel</a> - Compress Your Image by removing unnecessary bytes of the image and Convert it into WebP/AVIF</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/JafarAkhondali/Tapnesh\" rel=\"noopener noreferrer\">Tapnesh-CLI (⭐21)</a> - Tapnesh is a CLI tool that will optimize all your images in parallel easily and efficiently!</li>\n</ul>\n<h3><p>Web server Modules / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/imteekay/web-performance-research\" rel=\"noopener noreferrer\">imteekay/web-performance-research (⭐972)</a> - Research in Web Performance</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2023/07/26/",
      "title": "Awesome Wpo Updates on Jul 26, 2023",
      "_short_title": "Jul 26, 2023",
      "_slug": "2023/07/26/",
      "summary": "57 awesome projects updated on Jul 26, 2023",
      "_filepath": "/content/2023/07/26/README.md",
      "url": "https://www.trackawesomelist.com/2023/07/26/",
      "date_published": "2023-07-26T17:26:16.000Z",
      "date_modified": "2023-07-26T17:26:16.000Z",
      "content_text": "\n\n### Events / Conferences\n\n*   [performance.now()](https://perfnow.nl/) – The performance.now() conference will return to Amsterdam! We're a single-track conference with fourteen world-class speakers, covering today’s most important web performance insights.\n\n### Analyzers / Meetups\n\n*   [YSlow (⭐2.2k)](https://github.com/marcelduran/yslow) - YSlow analyzes web pages and suggests ways to improve their performance based on a set of rules for high-performance web pages.\n*   [Grunt-WebPageTest (⭐35)](https://github.com/sideroad/grunt-wpt) - Grunt plugin for continuous measurement of WebPageTest. ([Demo](http://sideroad.github.io/sample-wpt-page/))\n*   [Yandex.Tank (⭐2.5k)](https://github.com/yandex/yandex-tank) - An extensible open-source load testing tool for advanced Linux users which is especially good as a part of an automated load testing suite.\n*   [Yellow Lab Tools](http://yellowlab.tools) - Online quick and easy tool that audits frontend bad practices, reveals performance issues, and profiles JavaScript.\n\n### Analyzers - API / Meetups\n\n*   [RoboMiri](https://robomiri.com) - RoboMiri is a stable Uptime Monitor that offers a wide range of monitors: cronjob, keyword, website, port, ping. 25 uptime checks with 3 minutes interval checks for free. Alerts via Phone Call, SMS, Email, and WebHook.\n*   [StatusList](https://statuslist.app) - Uptime, performance monitoring with debug details, and hosted status page in one simple dashboard.\n\n### Bundle Analyzer / Meetups\n\n*   [Webpack bundle analyzer (⭐13k)](https://github.com/webpack-contrib/webpack-bundle-analyzer) - webpack plugin and CLI utility that represents bundle content as a convenient interactive zoomable treemap.\n\n### Benchmark - JavaScript / Meetups\n\n*   [Matcha (⭐563)](https://github.com/logicalparadox/matcha) - Matcha allows you to design experiments that will measure the performance of your code. It is recommended that each bench focus on a specific point of impact in your application.\n*   [Timing.js (⭐1.5k)](https://github.com/addyosmani/timing.js) - Timing.js is a small set of helpers for working with the Navigation Timing API to identify where your application is spending its time. Useful as a standalone script, DevTools Snippet, or bookmarklet.\n\n### Bookmarklets / Meetups\n\n*   [Yahoo YSlow for Mobile/Bookmarklet](https://developer.yahoo.com/yslow/) - YSlow analyzes web pages and suggests ways to improve their performance based on a set of rules for high-performance web pages.\n\n### CDN / Meetups\n\n*   [Cloudflare CDN](https://www.cloudflare.com/cdn/) - A content delivery network that uses next-gen tech to deliver fast, reliable, CDN services\n*   [PageCDN](https://pagecdn.com/lib) - A state-of-the-art opensource CDN with aggressive content optimization using brotli-11 compression, HTTP/2 server push, better HTTP/2 multiplexing, and more. Supports 100s of libraries and 2000+ WordPress themes already. Easy to use, easy to link, and very fast.\n*   [jsDelivr (⭐5.9k)](https://github.com/jsdelivr/jsdelivr) - Similar to Google Hosted Libraries, jsDelivr is an open-source CDN that allows developers to host their own projects and anyone to link to our hosted files on their sites.\n*   [CDNjs](https://cdnjs.com/) - An open-source CDN for JavaScript and CSS sponsored by CloudFlare that hosts everything from jQuery and Modernizr to Bootstrap.\n*   :ru: [Yandex CDN](https://tech.yandex.ru/jslibs/) - Yandex Content Delivery Network hosts popular third-party JavaScript and CSS libraries (best for use in Russia).\n\n### Generators / Meetups\n\n*   [AtBuild (⭐35)](https://github.com/jarred-sumner/atbuild) - JavaScript code generation tool that lets you write JavaScript that outputs JavaScript. Good for unrolling loops and writing libraries that compile away the runtime\n*   [Glue (⭐2.5k)](https://github.com/jorgebastida/glue) - Glue is a simple command-line tool to generate sprites:\n*   [Pitomba-spriter (⭐19)](https://github.com/pitomba/spriter) - Spriter is a simple and flexible dynamic sprite generator for CSS, using Python. It can process CSS both synchronous and asynchronous as it provides classes to be used in your Python code and also a watcher that listens to your filesystem and changes CSS and sprite as soon as a static is changed.\n*   [Grunt-spritesmith (⭐1.1k)](https://github.com/Ensighten/grunt-spritesmith) - Grunt task for converting a set of images into a sprite sheet and corresponding CSS variables.\n*   [Grunt-sprite-css-replace](https://www.npmjs.com/package/grunt-sprite-css-replace) - Grunt task that generates a sprite from images referenced in a style sheet and then updates the references with the new sprite image and positions.\n*   [Grunt-svg-sprite](https://www.npmjs.com/package/grunt-svg-sprite) - SVG sprites & stacks galore — Grunt plugin wrapping around svg-sprite that reads in a bunch of SVG files, optimizes them and creates SVG sprites and CSS resources in various flavors.\n*   [Gulp-sprite (⭐15)](https://github.com/aslansky/gulp-sprite) - gulp task for creating an image sprite and the corresponding style sheets for Gulp.\n*   [Gulp-svg-sprites (⭐331)](https://github.com/shakyShane/gulp-svg-sprites) - gulp task for creating SVG sprites.\n*   [SvgToCSS (⭐2)](https://github.com/kajyr/SvgToCSS) - Optimizes and renders SVG files in CSS / Sass sprites.\n*   [Assetgraph-sprite (⭐36)](https://github.com/assetgraph/assetgraph-sprite) - Assetgraph transform for auto-generating sprites based on the CSS dependency graph.\n*   [Sprite Cow](http://www.spritecow.com/) - Sprite Cow helps you get the background-position, width, and height of sprites within a spritesheet as a nice bit of copyable CSS.\n*   [ZeroSprites](http://zerosprites.com/) - ZeroSprites is a CSS sprites generator aimed at area minimization using algorithms used in the field of VLSI floorplanning.\n*   [CSS Sprite Generator](http://css.spritegen.com/) - CSS sprites allow you to combine multiple images into a single file.\n*   [Sprity (⭐478)](https://github.com/sprity/sprity) - A modular image sprite generator with a lot of features: supports retina sprites, supports different output formats, generates sprites and proper style files out of a directory of images, etc...\n*   [Sprite Factory (⭐620)](https://github.com/jakesgordon/sprite-factory) - The sprite factory is a ruby library that can be used to generate CSS sprites. It combines individual image files from a directory into a single unified sprite image and creates an appropriate CSS style sheet for use in your web application.\n\n### Image Optimizers / Meetups\n\n*   [Sharp (⭐31k)](https://github.com/lovell/sharp) - The typical use case for this high-speed Node.js module is to convert large images of many formats to smaller, web-friendly JPEG, PNG, and WebP images of varying dimensions.\n*   [ExifCleaner](https://exifcleaner.com) - GUI app to remove EXIF metadata from images and video files with drag and drop. Free and open source.\n*   [Imageoptim](https://imageoptim.com/) - Free app that makes images take up less disk space and load faster, without sacrificing quality. It optimizes compression parameters, and removes junk metadata and unnecessary color profiles.\n*   [Grunt-imageoptim (⭐479)](https://github.com/JamieMason/grunt-imageoptim) - Make ImageOptim, ImageAlpha, and JPEGmini part of your automated build process.\n\n### Lazyloaders / Meetups\n\n*   [lozad.js (⭐7.5k)](https://github.com/ApoorvSaxena/lozad.js) - Highly performant, light \\~0.9kb, and configurable lazy loader in pure JS with no dependencies for responsive images, iframes, and more\n\n### Loaders / Meetups\n\n*   [InstantClick (⭐5.5k)](https://github.com/dieulot/instantclick) - InstantClick makes the following links in your site instant.\n*   [JIT (⭐509)](https://github.com/shootaroo/jit-grunt) - A JIT (Just In Time) plugin loader for Grunt. The load time of Grunt does not slow down even if there are many plugins.\n\n### Metrics Monitor / Meetups\n\n*   [Bench (⭐25)](https://github.com/jmervine/bench) - Using Phantomas (a PhantomJS-backed client performance metrics scrapper). Benchmark a page, store results in MongoDB, and display results via the built-in server.\n*   [Keepfast (⭐105)](https://github.com/keepfast/keepfast) - Tool to monitor indicators related to the performance of a web page.\n*   [Pingdom site Speed Test](http://tools.pingdom.com/fpt/) - Test the load time of that page, analyze it, and find bottlenecks.\n*   [WebPageTest](http://www.webpagetest.org/) - Run a free site speed test from multiple locations around the globe using real browsers (IE and Chrome) and at real consumer connection speeds. You can run simple tests or perform advanced testing including multi-step transactions, video capture, content blocking and much more. Your results will provide rich diagnostic information including resource-loading waterfall charts, Page Speed optimization checks and suggestions for improvements.\n*   [Sitespeed.io](https://www.sitespeed.io/documentation/) - Sitespeed.io is an open-source tool that will check your site against web performance best practice rules and use the Navigation Timing API to collect metrics. It will create XML & HTML output of the result.\n\n### Metrics Monitor - EMAIL / Meetups\n\n*   [WebPerformance Report](https://webperformancereport.com/) - Web performance report every week in your inbox. Get a Personalized Report on the Status of the E-commerce or Website that you want to monitor in terms of Web performance and Web optimization, Core Web Vitals are included.\n\n### Minifiers - HTML / Meetups\n\n*   [HTMLCompressor](https://code.google.com/archive/p/htmlcompressor/) - HtmlCompressor is a small, fast, and very easy to use Java library that minifies given HTML or XML source by removing extra whitespaces, comments, and other unneeded characters without breaking the content structure. As a result page become smaller in size and load faster. A command-line version of the compressor is also available.\n*   [Minimize (⭐161)](https://github.com/Swaagie/minimize) - Minimize is an HTML minifier based on the node-htmlparser,currently, HTML minifier is only usable server-side. Client-side minification will be added in a future release.\n\n### Minifiers - JS & CSS / Meetups\n\n*   [CSSO (⭐3.8k)](https://github.com/css/csso) - CSS minimizer unlike others. In addition to usual minification techniques, it can perform structural optimization of CSS files, resulting in smaller file size compared to other minifiers.\n*   [Clean-css (⭐4.2k)](https://github.com/jakubpawlowicz/clean-css) - A fast, efficient, and well-tested CSS minifier for node.js.\n\n### Miscellaneous / Meetups\n\n*   [HTTPinvoke (⭐343)](https://github.com/jakutis/httpinvoke)- A no-dependencies HTTP client library for browsers and Node.js with a promise-based or Node.js-style callback-based API to progress events, text, and binary file upload and download, partial response body, request and response headers, status code.\n*   [Lazysizes (⭐18k)](https://github.com/aFarkas/lazysizes) - High-performance lazy loader for images (responsive and normal), iframes, and scripts, that detects any visibility changes triggered through user interaction, CSS or JavaScript without configuration.\n*   [Perf-Tooling](http://perf-tooling.today/) - Perf Tooling is a shared resource to keep track of new and existing performance tools.\n\n### SVG / Meetups\n\n*   [SVG Cleaner (⭐1.7k)](https://github.com/RazrFalcon/SVGCleaner) - SVG Cleaner could help you to clean up your SVG files from unnecessary data. It has a lot of options for cleanup and optimization, works in batch mode, and provides threaded processing on multicore processors.\n\n### Web server Benchmarks / Meetups\n\n*   [Locust](http://locust.io) - An open-source load testing tool. Define user behaviour with Python code, and swarm your system with millions of simultaneous users.\n*   [Autoperf (⭐178)](https://github.com/igrigorik/autoperf) - Autoperf is a ruby driver for httperf, designed to help you automate load and performance testing of any web application - for a single endpoint, or through log replay.\n*   [k6](https://k6.io/) - An open-source load testing tool built for developers. Easy to integrate into CI pipelines. Tests are written in ES6 JS and you can test APIs, microservices and sites using HTTP/1.1, HTTP/2 and WebSocket.\n\n### Web server Modules / Meetups\n\n*   [Page Visibility](http://www.w3.org/TR/page-visibility/) - This specification defines a means for site developers to programmatically determine the current visibility state of the page in order to develop power and CPU-efficient web applications.\n*   [User Timing](http://www.w3.org/TR/user-timing/) - This specification defines an interface to help web developers measure the performance of their applications by giving them access to high-precision timestamps.",
      "content_html": "<h3><p>Events / Conferences</p>\n</h3>\n<ul>\n<li><a href=\"https://perfnow.nl/\" rel=\"noopener noreferrer\">performance.now()</a> – The performance.now() conference will return to Amsterdam! We're a single-track conference with fourteen world-class speakers, covering today’s most important web performance insights.</li>\n</ul>\n<h3><p>Analyzers / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/marcelduran/yslow\" rel=\"noopener noreferrer\">YSlow (⭐2.2k)</a> - YSlow analyzes web pages and suggests ways to improve their performance based on a set of rules for high-performance web pages.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/sideroad/grunt-wpt\" rel=\"noopener noreferrer\">Grunt-WebPageTest (⭐35)</a> - Grunt plugin for continuous measurement of WebPageTest. (<a href=\"http://sideroad.github.io/sample-wpt-page/\" rel=\"noopener noreferrer\">Demo</a>)</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/yandex/yandex-tank\" rel=\"noopener noreferrer\">Yandex.Tank (⭐2.5k)</a> - An extensible open-source load testing tool for advanced Linux users which is especially good as a part of an automated load testing suite.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://yellowlab.tools\" rel=\"noopener noreferrer\">Yellow Lab Tools</a> - Online quick and easy tool that audits frontend bad practices, reveals performance issues, and profiles JavaScript.</li>\n</ul>\n<h3><p>Analyzers - API / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://robomiri.com\" rel=\"noopener noreferrer\">RoboMiri</a> - RoboMiri is a stable Uptime Monitor that offers a wide range of monitors: cronjob, keyword, website, port, ping. 25 uptime checks with 3 minutes interval checks for free. Alerts via Phone Call, SMS, Email, and WebHook.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://statuslist.app\" rel=\"noopener noreferrer\">StatusList</a> - Uptime, performance monitoring with debug details, and hosted status page in one simple dashboard.</li>\n</ul>\n<h3><p>Bundle Analyzer / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/webpack-contrib/webpack-bundle-analyzer\" rel=\"noopener noreferrer\">Webpack bundle analyzer (⭐13k)</a> - webpack plugin and CLI utility that represents bundle content as a convenient interactive zoomable treemap.</li>\n</ul>\n<h3><p>Benchmark - JavaScript / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/logicalparadox/matcha\" rel=\"noopener noreferrer\">Matcha (⭐563)</a> - Matcha allows you to design experiments that will measure the performance of your code. It is recommended that each bench focus on a specific point of impact in your application.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/addyosmani/timing.js\" rel=\"noopener noreferrer\">Timing.js (⭐1.5k)</a> - Timing.js is a small set of helpers for working with the Navigation Timing API to identify where your application is spending its time. Useful as a standalone script, DevTools Snippet, or bookmarklet.</li>\n</ul>\n<h3><p>Bookmarklets / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://developer.yahoo.com/yslow/\" rel=\"noopener noreferrer\">Yahoo YSlow for Mobile/Bookmarklet</a> - YSlow analyzes web pages and suggests ways to improve their performance based on a set of rules for high-performance web pages.</li>\n</ul>\n<h3><p>CDN / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://www.cloudflare.com/cdn/\" rel=\"noopener noreferrer\">Cloudflare CDN</a> - A content delivery network that uses next-gen tech to deliver fast, reliable, CDN services</li>\n</ul>\n\n<ul>\n<li><a href=\"https://pagecdn.com/lib\" rel=\"noopener noreferrer\">PageCDN</a> - A state-of-the-art opensource CDN with aggressive content optimization using brotli-11 compression, HTTP/2 server push, better HTTP/2 multiplexing, and more. Supports 100s of libraries and 2000+ WordPress themes already. Easy to use, easy to link, and very fast.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/jsdelivr/jsdelivr\" rel=\"noopener noreferrer\">jsDelivr (⭐5.9k)</a> - Similar to Google Hosted Libraries, jsDelivr is an open-source CDN that allows developers to host their own projects and anyone to link to our hosted files on their sites.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://cdnjs.com/\" rel=\"noopener noreferrer\">CDNjs</a> - An open-source CDN for JavaScript and CSS sponsored by CloudFlare that hosts everything from jQuery and Modernizr to Bootstrap.</li>\n</ul>\n\n<ul>\n<li>🇷🇺 <a href=\"https://tech.yandex.ru/jslibs/\" rel=\"noopener noreferrer\">Yandex CDN</a> - Yandex Content Delivery Network hosts popular third-party JavaScript and CSS libraries (best for use in Russia).</li>\n</ul>\n<h3><p>Generators / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/jarred-sumner/atbuild\" rel=\"noopener noreferrer\">AtBuild (⭐35)</a> - JavaScript code generation tool that lets you write JavaScript that outputs JavaScript. Good for unrolling loops and writing libraries that compile away the runtime</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/jorgebastida/glue\" rel=\"noopener noreferrer\">Glue (⭐2.5k)</a> - Glue is a simple command-line tool to generate sprites:</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/pitomba/spriter\" rel=\"noopener noreferrer\">Pitomba-spriter (⭐19)</a> - Spriter is a simple and flexible dynamic sprite generator for CSS, using Python. It can process CSS both synchronous and asynchronous as it provides classes to be used in your Python code and also a watcher that listens to your filesystem and changes CSS and sprite as soon as a static is changed.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/Ensighten/grunt-spritesmith\" rel=\"noopener noreferrer\">Grunt-spritesmith (⭐1.1k)</a> - Grunt task for converting a set of images into a sprite sheet and corresponding CSS variables.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.npmjs.com/package/grunt-sprite-css-replace\" rel=\"noopener noreferrer\">Grunt-sprite-css-replace</a> - Grunt task that generates a sprite from images referenced in a style sheet and then updates the references with the new sprite image and positions.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.npmjs.com/package/grunt-svg-sprite\" rel=\"noopener noreferrer\">Grunt-svg-sprite</a> - SVG sprites &amp; stacks galore — Grunt plugin wrapping around svg-sprite that reads in a bunch of SVG files, optimizes them and creates SVG sprites and CSS resources in various flavors.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/aslansky/gulp-sprite\" rel=\"noopener noreferrer\">Gulp-sprite (⭐15)</a> - gulp task for creating an image sprite and the corresponding style sheets for Gulp.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/shakyShane/gulp-svg-sprites\" rel=\"noopener noreferrer\">Gulp-svg-sprites (⭐331)</a> - gulp task for creating SVG sprites.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/kajyr/SvgToCSS\" rel=\"noopener noreferrer\">SvgToCSS (⭐2)</a> - Optimizes and renders SVG files in CSS / Sass sprites.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/assetgraph/assetgraph-sprite\" rel=\"noopener noreferrer\">Assetgraph-sprite (⭐36)</a> - Assetgraph transform for auto-generating sprites based on the CSS dependency graph.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://www.spritecow.com/\" rel=\"noopener noreferrer\">Sprite Cow</a> - Sprite Cow helps you get the background-position, width, and height of sprites within a spritesheet as a nice bit of copyable CSS.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://zerosprites.com/\" rel=\"noopener noreferrer\">ZeroSprites</a> - ZeroSprites is a CSS sprites generator aimed at area minimization using algorithms used in the field of VLSI floorplanning.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://css.spritegen.com/\" rel=\"noopener noreferrer\">CSS Sprite Generator</a> - CSS sprites allow you to combine multiple images into a single file.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/sprity/sprity\" rel=\"noopener noreferrer\">Sprity (⭐478)</a> - A modular image sprite generator with a lot of features: supports retina sprites, supports different output formats, generates sprites and proper style files out of a directory of images, etc...</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/jakesgordon/sprite-factory\" rel=\"noopener noreferrer\">Sprite Factory (⭐620)</a> - The sprite factory is a ruby library that can be used to generate CSS sprites. It combines individual image files from a directory into a single unified sprite image and creates an appropriate CSS style sheet for use in your web application.</li>\n</ul>\n<h3><p>Image Optimizers / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/lovell/sharp\" rel=\"noopener noreferrer\">Sharp (⭐31k)</a> - The typical use case for this high-speed Node.js module is to convert large images of many formats to smaller, web-friendly JPEG, PNG, and WebP images of varying dimensions.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://exifcleaner.com\" rel=\"noopener noreferrer\">ExifCleaner</a> - GUI app to remove EXIF metadata from images and video files with drag and drop. Free and open source.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://imageoptim.com/\" rel=\"noopener noreferrer\">Imageoptim</a> - Free app that makes images take up less disk space and load faster, without sacrificing quality. It optimizes compression parameters, and removes junk metadata and unnecessary color profiles.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/JamieMason/grunt-imageoptim\" rel=\"noopener noreferrer\">Grunt-imageoptim (⭐479)</a> - Make ImageOptim, ImageAlpha, and JPEGmini part of your automated build process.</li>\n</ul>\n<h3><p>Lazyloaders / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/ApoorvSaxena/lozad.js\" rel=\"noopener noreferrer\">lozad.js (⭐7.5k)</a> - Highly performant, light ~0.9kb, and configurable lazy loader in pure JS with no dependencies for responsive images, iframes, and more</li>\n</ul>\n<h3><p>Loaders / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/dieulot/instantclick\" rel=\"noopener noreferrer\">InstantClick (⭐5.5k)</a> - InstantClick makes the following links in your site instant.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/shootaroo/jit-grunt\" rel=\"noopener noreferrer\">JIT (⭐509)</a> - A JIT (Just In Time) plugin loader for Grunt. The load time of Grunt does not slow down even if there are many plugins.</li>\n</ul>\n<h3><p>Metrics Monitor / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/jmervine/bench\" rel=\"noopener noreferrer\">Bench (⭐25)</a> - Using Phantomas (a PhantomJS-backed client performance metrics scrapper). Benchmark a page, store results in MongoDB, and display results via the built-in server.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/keepfast/keepfast\" rel=\"noopener noreferrer\">Keepfast (⭐105)</a> - Tool to monitor indicators related to the performance of a web page.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://tools.pingdom.com/fpt/\" rel=\"noopener noreferrer\">Pingdom site Speed Test</a> - Test the load time of that page, analyze it, and find bottlenecks.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://www.webpagetest.org/\" rel=\"noopener noreferrer\">WebPageTest</a> - Run a free site speed test from multiple locations around the globe using real browsers (IE and Chrome) and at real consumer connection speeds. You can run simple tests or perform advanced testing including multi-step transactions, video capture, content blocking and much more. Your results will provide rich diagnostic information including resource-loading waterfall charts, Page Speed optimization checks and suggestions for improvements.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.sitespeed.io/documentation/\" rel=\"noopener noreferrer\">Sitespeed.io</a> - Sitespeed.io is an open-source tool that will check your site against web performance best practice rules and use the Navigation Timing API to collect metrics. It will create XML &amp; HTML output of the result.</li>\n</ul>\n<h3><p>Metrics Monitor - EMAIL / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://webperformancereport.com/\" rel=\"noopener noreferrer\">WebPerformance Report</a> - Web performance report every week in your inbox. Get a Personalized Report on the Status of the E-commerce or Website that you want to monitor in terms of Web performance and Web optimization, Core Web Vitals are included.</li>\n</ul>\n<h3><p>Minifiers - HTML / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://code.google.com/archive/p/htmlcompressor/\" rel=\"noopener noreferrer\">HTMLCompressor</a> - HtmlCompressor is a small, fast, and very easy to use Java library that minifies given HTML or XML source by removing extra whitespaces, comments, and other unneeded characters without breaking the content structure. As a result page become smaller in size and load faster. A command-line version of the compressor is also available.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/Swaagie/minimize\" rel=\"noopener noreferrer\">Minimize (⭐161)</a> - Minimize is an HTML minifier based on the node-htmlparser,currently, HTML minifier is only usable server-side. Client-side minification will be added in a future release.</li>\n</ul>\n<h3><p>Minifiers - JS &amp; CSS / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/css/csso\" rel=\"noopener noreferrer\">CSSO (⭐3.8k)</a> - CSS minimizer unlike others. In addition to usual minification techniques, it can perform structural optimization of CSS files, resulting in smaller file size compared to other minifiers.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/jakubpawlowicz/clean-css\" rel=\"noopener noreferrer\">Clean-css (⭐4.2k)</a> - A fast, efficient, and well-tested CSS minifier for node.js.</li>\n</ul>\n<h3><p>Miscellaneous / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/jakutis/httpinvoke\" rel=\"noopener noreferrer\">HTTPinvoke (⭐343)</a>- A no-dependencies HTTP client library for browsers and Node.js with a promise-based or Node.js-style callback-based API to progress events, text, and binary file upload and download, partial response body, request and response headers, status code.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/aFarkas/lazysizes\" rel=\"noopener noreferrer\">Lazysizes (⭐18k)</a> - High-performance lazy loader for images (responsive and normal), iframes, and scripts, that detects any visibility changes triggered through user interaction, CSS or JavaScript without configuration.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://perf-tooling.today/\" rel=\"noopener noreferrer\">Perf-Tooling</a> - Perf Tooling is a shared resource to keep track of new and existing performance tools.</li>\n</ul>\n<h3><p>SVG / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/RazrFalcon/SVGCleaner\" rel=\"noopener noreferrer\">SVG Cleaner (⭐1.7k)</a> - SVG Cleaner could help you to clean up your SVG files from unnecessary data. It has a lot of options for cleanup and optimization, works in batch mode, and provides threaded processing on multicore processors.</li>\n</ul>\n<h3><p>Web server Benchmarks / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"http://locust.io\" rel=\"noopener noreferrer\">Locust</a> - An open-source load testing tool. Define user behaviour with Python code, and swarm your system with millions of simultaneous users.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/igrigorik/autoperf\" rel=\"noopener noreferrer\">Autoperf (⭐178)</a> - Autoperf is a ruby driver for httperf, designed to help you automate load and performance testing of any web application - for a single endpoint, or through log replay.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://k6.io/\" rel=\"noopener noreferrer\">k6</a> - An open-source load testing tool built for developers. Easy to integrate into CI pipelines. Tests are written in ES6 JS and you can test APIs, microservices and sites using HTTP/1.1, HTTP/2 and WebSocket.</li>\n</ul>\n<h3><p>Web server Modules / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"http://www.w3.org/TR/page-visibility/\" rel=\"noopener noreferrer\">Page Visibility</a> - This specification defines a means for site developers to programmatically determine the current visibility state of the page in order to develop power and CPU-efficient web applications.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://www.w3.org/TR/user-timing/\" rel=\"noopener noreferrer\">User Timing</a> - This specification defines an interface to help web developers measure the performance of their applications by giving them access to high-precision timestamps.</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2023/06/19/",
      "title": "Awesome Wpo Updates on Jun 19, 2023",
      "_short_title": "Jun 19, 2023",
      "_slug": "2023/06/19/",
      "summary": "1 awesome projects updated on Jun 19, 2023",
      "_filepath": "/content/2023/06/19/README.md",
      "url": "https://www.trackawesomelist.com/2023/06/19/",
      "date_published": "2023-06-19T18:08:50.000Z",
      "date_modified": "2023-06-19T18:08:50.000Z",
      "content_text": "\n\n### Analyzers / Meetups\n\n*   [Lightest App](https://lightest.app/) - Webpage load time is extremely important for conversion and revenue. Visualize web performance against competitors.",
      "content_html": "<h3><p>Analyzers / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://lightest.app/\" rel=\"noopener noreferrer\">Lightest App</a> - Webpage load time is extremely important for conversion and revenue. Visualize web performance against competitors.</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2023/05/02/",
      "title": "Awesome Wpo Updates on May 02, 2023",
      "_short_title": "May 02, 2023",
      "_slug": "2023/05/02/",
      "summary": "1 awesome projects updated on May 02, 2023",
      "_filepath": "/content/2023/05/02/README.md",
      "url": "https://www.trackawesomelist.com/2023/05/02/",
      "date_published": "2023-05-02T04:49:57.000Z",
      "date_modified": "2023-05-02T04:49:57.000Z",
      "content_text": "\n\n### Events / Conferences\n\n*   [We Love Speed](https://www.welovespeed.com/) – We Love Speed ​​was born from the desire to share knowledge and experiences in web performance as widely as possible.",
      "content_html": "<h3><p>Events / Conferences</p>\n</h3>\n<ul>\n<li><a href=\"https://www.welovespeed.com/\" rel=\"noopener noreferrer\">We Love Speed</a> – We Love Speed ​​was born from the desire to share knowledge and experiences in web performance as widely as possible.</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2022/02/07/",
      "title": "Awesome Wpo Updates on Feb 07, 2022",
      "_short_title": "Feb 07, 2022",
      "_slug": "2022/02/07/",
      "summary": "3 awesome projects updated on Feb 07, 2022",
      "_filepath": "/content/2022/02/07/README.md",
      "url": "https://www.trackawesomelist.com/2022/02/07/",
      "date_published": "2022-02-07T02:39:44.000Z",
      "date_modified": "2022-02-07T02:43:41.000Z",
      "content_text": "\n\n### Analyzers - API / Meetups\n\n*   [BetterUptime](https://betteruptime.com) - A good website monitoring tool (bundling status page, incident notification)\n*   [Pingdom](https://pingdom.com) - A tool to get the uptime of your website (with probes from different locations)\n*   [UptimeRobot](https://uptimerobot.com) - Another uptime monitoring tool (with a generous free plan)",
      "content_html": "<h3><p>Analyzers - API / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://betteruptime.com\" rel=\"noopener noreferrer\">BetterUptime</a> - A good website monitoring tool (bundling status page, incident notification)</li>\n</ul>\n\n<ul>\n<li><a href=\"https://pingdom.com\" rel=\"noopener noreferrer\">Pingdom</a> - A tool to get the uptime of your website (with probes from different locations)</li>\n</ul>\n\n<ul>\n<li><a href=\"https://uptimerobot.com\" rel=\"noopener noreferrer\">UptimeRobot</a> - Another uptime monitoring tool (with a generous free plan)</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2021/11/21/",
      "title": "Awesome Wpo Updates on Nov 21, 2021",
      "_short_title": "Nov 21, 2021",
      "_slug": "2021/11/21/",
      "summary": "1 awesome projects updated on Nov 21, 2021",
      "_filepath": "/content/2021/11/21/README.md",
      "url": "https://www.trackawesomelist.com/2021/11/21/",
      "date_published": "2021-11-21T05:44:56.000Z",
      "date_modified": "2021-11-21T05:44:56.000Z",
      "content_text": "\n\n### CDN / Meetups\n\n*   [Amazon CloudFront](https://aws.amazon.com/cloudfront/) - A content delivery network by Amazon that integrates nicely with other Amazon services or can be used standalone.",
      "content_html": "<h3><p>CDN / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://aws.amazon.com/cloudfront/\" rel=\"noopener noreferrer\">Amazon CloudFront</a> - A content delivery network by Amazon that integrates nicely with other Amazon services or can be used standalone.</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2021/10/17/",
      "title": "Awesome Wpo Updates on Oct 17, 2021",
      "_short_title": "Oct 17, 2021",
      "_slug": "2021/10/17/",
      "summary": "2 awesome projects updated on Oct 17, 2021",
      "_filepath": "/content/2021/10/17/README.md",
      "url": "https://www.trackawesomelist.com/2021/10/17/",
      "date_published": "2021-10-17T00:56:29.000Z",
      "date_modified": "2021-10-17T00:56:29.000Z",
      "content_text": "\n\n### Books\n\n*   [Image Optimization](https://www.smashingmagazine.com/printed-books/image-optimization/) - Addy Osmani\n\n### Events / Conferences\n\n*   [PWA Summit](https://pwasummit.org/) – A free, online, single-track conference focused on helping everyone succeed with Progressive Web Apps.",
      "content_html": "<h3><p>Books</p>\n</h3>\n<ul>\n<li><a href=\"https://www.smashingmagazine.com/printed-books/image-optimization/\" rel=\"noopener noreferrer\">Image Optimization</a> - Addy Osmani</li>\n</ul>\n<h3><p>Events / Conferences</p>\n</h3>\n<ul>\n<li><a href=\"https://pwasummit.org/\" rel=\"noopener noreferrer\">PWA Summit</a> – A free, online, single-track conference focused on helping everyone succeed with Progressive Web Apps.</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2021/03/31/",
      "title": "Awesome Wpo Updates on Mar 31, 2021",
      "_short_title": "Mar 31, 2021",
      "_slug": "2021/03/31/",
      "summary": "1 awesome projects updated on Mar 31, 2021",
      "_filepath": "/content/2021/03/31/README.md",
      "url": "https://www.trackawesomelist.com/2021/03/31/",
      "date_published": "2021-03-31T13:49:56.000Z",
      "date_modified": "2021-03-31T13:49:56.000Z",
      "content_text": "\n\n### Bundle Analyzer / Meetups\n\n*   [BundleStats (⭐635)](https://github.com/relative-ci/bundle-stats) - Generate bundle report(bundle size, assets, modules, packages) and compare the results between different builds",
      "content_html": "<h3><p>Bundle Analyzer / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/relative-ci/bundle-stats\" rel=\"noopener noreferrer\">BundleStats (⭐635)</a> - Generate bundle report(bundle size, assets, modules, packages) and compare the results between different builds</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2020/11/13/",
      "title": "Awesome Wpo Updates on Nov 13, 2020",
      "_short_title": "Nov 13, 2020",
      "_slug": "2020/11/13/",
      "summary": "1 awesome projects updated on Nov 13, 2020",
      "_filepath": "/content/2020/11/13/README.md",
      "url": "https://www.trackawesomelist.com/2020/11/13/",
      "date_published": "2020-11-13T11:34:04.000Z",
      "date_modified": "2020-11-13T11:34:04.000Z",
      "content_text": "\n\n### Metrics Monitor / Meetups\n\n*   [Bytes Matter Real User Monitoring](https://www.bytesmatter.io) - Full featured Real User Monitoring solution. Free tier for smaller sites. Includes monitoring for Google's Core Web Vitals.",
      "content_html": "<h3><p>Metrics Monitor / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://www.bytesmatter.io\" rel=\"noopener noreferrer\">Bytes Matter Real User Monitoring</a> - Full featured Real User Monitoring solution. Free tier for smaller sites. Includes monitoring for Google's Core Web Vitals.</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2020/10/27/",
      "title": "Awesome Wpo Updates on Oct 27, 2020",
      "_short_title": "Oct 27, 2020",
      "_slug": "2020/10/27/",
      "summary": "1 awesome projects updated on Oct 27, 2020",
      "_filepath": "/content/2020/10/27/README.md",
      "url": "https://www.trackawesomelist.com/2020/10/27/",
      "date_published": "2020-10-27T00:20:17.000Z",
      "date_modified": "2020-10-27T00:20:17.000Z",
      "content_text": "\n\n### Benchmark - JavaScript / Meetups\n\n*   [JSPerf](http://jsperf.com/) - jsPerf aims to provide an easy way to create and share test cases, comparing the performance of different JavaScript snippets by running benchmarks. `Temporarily out, follow this issue for updates: https://github.com/jsperf/jsperf.com/issues/537`",
      "content_html": "<h3><p>Benchmark - JavaScript / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"http://jsperf.com/\" rel=\"noopener noreferrer\">JSPerf</a> - jsPerf aims to provide an easy way to create and share test cases, comparing the performance of different JavaScript snippets by running benchmarks. <code>Temporarily out, follow this issue for updates: https://github.com/jsperf/jsperf.com/issues/537</code></li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2020/10/24/",
      "title": "Awesome Wpo Updates on Oct 24, 2020",
      "_short_title": "Oct 24, 2020",
      "_slug": "2020/10/24/",
      "summary": "1 awesome projects updated on Oct 24, 2020",
      "_filepath": "/content/2020/10/24/README.md",
      "url": "https://www.trackawesomelist.com/2020/10/24/",
      "date_published": "2020-10-24T04:53:49.000Z",
      "date_modified": "2020-10-24T04:53:49.000Z",
      "content_text": "\n\n### Events / Conferences\n\n*   [#PerfMatters](https://perfmattersconf.com/) – #PerfMatters Conference is the ONLINE web performance conference by internationally renowned performance developers.",
      "content_html": "<h3><p>Events / Conferences</p>\n</h3>\n<ul>\n<li><a href=\"https://perfmattersconf.com/\" rel=\"noopener noreferrer\">#PerfMatters</a> – #PerfMatters Conference is the ONLINE web performance conference by internationally renowned performance developers.</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2020/10/21/",
      "title": "Awesome Wpo Updates on Oct 21, 2020",
      "_short_title": "Oct 21, 2020",
      "_slug": "2020/10/21/",
      "summary": "1 awesome projects updated on Oct 21, 2020",
      "_filepath": "/content/2020/10/21/README.md",
      "url": "https://www.trackawesomelist.com/2020/10/21/",
      "date_published": "2020-10-21T10:04:12.000Z",
      "date_modified": "2020-10-21T10:04:12.000Z",
      "content_text": "\n\n### Case studies\n\n*   [Google Developers Case Studies](https://developers.google.com/web/showcase) - Learn why and how other developers have used the web to create amazing web experiences for their users.",
      "content_html": "<h3><p>Case studies</p>\n</h3>\n<ul>\n<li><a href=\"https://developers.google.com/web/showcase\" rel=\"noopener noreferrer\">Google Developers Case Studies</a> - Learn why and how other developers have used the web to create amazing web experiences for their users.</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2020/08/04/",
      "title": "Awesome Wpo Updates on Aug 04, 2020",
      "_short_title": "Aug 04, 2020",
      "_slug": "2020/08/04/",
      "summary": "1 awesome projects updated on Aug 04, 2020",
      "_filepath": "/content/2020/08/04/README.md",
      "url": "https://www.trackawesomelist.com/2020/08/04/",
      "date_published": "2020-08-04T13:13:48.000Z",
      "date_modified": "2020-08-04T13:13:48.000Z",
      "content_text": "\n\n### Analyzers / Meetups\n\n*   [Screpy](https://screpy.com) - AI-Based SEO Analysis & Monitoring Tool",
      "content_html": "<h3><p>Analyzers / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://screpy.com\" rel=\"noopener noreferrer\">Screpy</a> - AI-Based SEO Analysis &amp; Monitoring Tool</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2020/06/14/",
      "title": "Awesome Wpo Updates on Jun 14, 2020",
      "_short_title": "Jun 14, 2020",
      "_slug": "2020/06/14/",
      "summary": "1 awesome projects updated on Jun 14, 2020",
      "_filepath": "/content/2020/06/14/README.md",
      "url": "https://www.trackawesomelist.com/2020/06/14/",
      "date_published": "2020-06-14T22:53:05.000Z",
      "date_modified": "2020-06-14T22:53:05.000Z",
      "content_text": "\n\n### Image Optimizers / Meetups\n\n*   [ImageKit.io](https://imagekit.io) - Intelligent real-time image optimizations, image transformations with a global delivery network and storage.",
      "content_html": "<h3><p>Image Optimizers / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://imagekit.io\" rel=\"noopener noreferrer\">ImageKit.io</a> - Intelligent real-time image optimizations, image transformations with a global delivery network and storage.</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2020/06/01/",
      "title": "Awesome Wpo Updates on Jun 01, 2020",
      "_short_title": "Jun 01, 2020",
      "_slug": "2020/06/01/",
      "summary": "162 awesome projects updated on Jun 01, 2020",
      "_filepath": "/content/2020/06/01/README.md",
      "url": "https://www.trackawesomelist.com/2020/06/01/",
      "date_published": "2020-06-01T00:49:34.000Z",
      "date_modified": "2020-06-01T01:31:14.000Z",
      "content_text": "\n\n### Books\n\n*   [HTTP/2 in Action by Barry Pollard](https://www.manning.com/books/http2-in-action) - Barry Pollard\n*   [Web Performance in Action by Jeremy Wagner](https://www.manning.com/books/web-performance-in-action) - Jeremy L. Wagner\n*   [Book of Speed](https://www.bookofspeed.com/) - Stoyan Stefanov\n*   [Designing for Performance: Weighing Aesthetics and Speed](http://designingforperformance.com/) - Lara Callender Hogan\n*   [Even Faster Web Sites: Performance Best Practices for Web Developers](http://shop.oreilly.com/product/9780596522315.do) - Steve Souders\n*   [High Performance Browser Networking: What every web developer should know about networking and web performance](http://shop.oreilly.com/product/0636920028048.do) - Ilya Grigorik\n*   [High Performance JavaScript](http://shop.oreilly.com/product/9780596802806.do) - Nicholas C. Zakas\n*   [High Performance Web Sites: Essential Knowledge for frontend Engineers](http://books.google.de/books/about/High_Performance_Web_Sites.html?id=jRVlgNDOr60C\\&redir_esc=y) - Steve Souders\n*   [High Performance Responsive Design: Building Faster Sites Across Devices](http://shop.oreilly.com/product/0636920033103.do) – Tom Barker\n*   [Lean sites](https://www.sitepoint.com/premium/books/lean-websites) – Barbara Bermes\n*   [Time Is Money: The Business Value of Web Performance](http://shop.oreilly.com/product/0636920041450.do) – Tammy Everts\n*   [Using WebPagetest](http://shop.oreilly.com/product/0636920033592.do) - Rick Viscomi, Andy Davies, Marcel Duran\n*   [Web Page Size, Speed, and Performance](http://www.oreilly.com/webops-perf/free/webpage-size-speed-perf.csp) - Terrence Dorsey\n*   [Web Performance Daybook Volume 2](https://www.amazon.com/Web-Performance-Daybook-Stoyan-Stefanov-ebook/dp/B008CQA8BA/) - Stoyan Stefanov\n*   [Web Performance Tuning](http://shop.oreilly.com/product/9780596001728.do) - Patrick Killelea\n*   [You Don't Know JS: Async & Performance](https://www.oreilly.com/library/view/you-dont-know/9781491905197/) - Kyle Simpson\n*   [Linux, Apache, MySQL, PHP Performance end-to-end](https://play.google.com/store/books/details/Colin_McKinnon_Linux_Apache_MySQL_PHP_Performance?id=Z3ciBgAAQBAJ) - Colin McKinnon\n*   [Web Components in Action](https://www.manning.com/books/web-components-in-action) - Ben Farrell\n\n### Case studies\n\n*   [WPOStats](https://wpostats.com/) - Case studies and experiments demonstrating the impact of web performance optimization (WPO) on user experience and business metrics.\n\n### Documentation\n\n*   [Browser Diet](https://browserdiet.com/en/) - A collaborative guide about frontend performance.\n*   [PageSpeed Insights Rules](https://developers.google.com/speed/docs/insights/rules) - A guide created by PageSpeed Team.\n    Deprecated. This is deprecated and will be shut down in May 2019. Version 5 is the latest and provides both real-world data from the Chrome User Experience Report and lab data from Lighthouse.\n*   [Best Practices for Speeding Up Your site](https://developer.yahoo.com/performance/rules.html) - The list includes 35 best practices divided into 7 categories, created by Yahoo! Exceptional Performance team.\n\n### Events / Conferences\n\n*   [Velocity](http://conferences.oreilly.com/velocity) – At Velocity, web operations, performance, and DevOps professionals learn to build fast, resilient, and highly available sites and apps.\n\n### Analyzers / Meetups\n\n*   [Web.dev](https://web.dev/) - Get the web's modern capabilities on your own sites and apps with useful guidance and analysis from web.dev.\n*   [Confess (⭐872)](https://github.com/jamesgpearce/confess) - Uses PhantomJS to headlessly analyze web pages and generate manifests.\n*   [DebugBear](https://www.debugbear.com/) - DebugBear is a site monitoring tool based on Lighthouse. See how your scores and metrics changed over time, with a focus on understanding what caused each change. DebugBear is a paid product with a free 30-day trial.\n*   [Page Speed](https://developers.google.com/speed/pagespeed/) - The PageSpeed family of tools is designed to help you optimize the performance of your site. PageSpeed Insights products will help you identify performance best practices that can be applied to your site, and PageSpeed optimization tools can help you automate the process.\n*   [Lighthouse (⭐29k)](https://github.com/GoogleChrome/lighthouse) - Auditing and performance metrics tool for Progressive Web Applications.\n*   [YSlow for PhantomJS](http://yslow.org/phantomjs/) - YSlow for PhantomJS also introduces new output formats for automated test frameworks: TAP (Test Anything Protocol) and JUnit.\n*   [Grunt-yslow (⭐91)](https://github.com/andyshora/grunt-yslow) - Grunt task for testing page performance using PhantomJS, a headless WebKit browser.\n*   [Grunt-perfbudget (⭐855)](https://github.com/tkadlec/grunt-perfbudget) - A Grunt.js task for enforcing a performance budget ([more on performance budgets](https://timkadlec.com/2013/01/setting-a-performance-budget/)).\n*   [Web Tracing Framework (⭐2.6k)](https://github.com/google/tracing-framework) - Web Tracing Framework is a set of libraries, tools, and visualizers for the tracing and investigation of complex web applications\n*   [Pagelocity](http://pagelocity.com/) - A web performance optimization and analysis tool.\n*   [Varvy](https://varvy.com/pagespeed/) - Test your site to see if it follows the Google guidelines for speed.\n*   [Web Bloat Score Calculator](http://www.webbloatscore.com/) - Compare size of a page to a compressed image of the same page\n*   [Speed Racer (⭐1.9k)](https://github.com/ngryman/speedracer) - Collect performance metrics for your library/application using Chrome headless.\n*   [Speedrank](https://speedrank.app/) - Speedrank monitors the performance of your site in the background. It displays Lighthouse reports over time and delivers recommendations for improvement. Speedrank is a paid product with 14-day-trial.\n\n### Analyzers - API / Meetups\n\n*   [Node-yslowjs (⭐9)](https://github.com/jmervine/node-yslowjs) - YSlow\\.js on Node.js is a simple Node.js wrapper for programmatically running phantomjs yslow\\.js.\n*   [PSI (⭐3.1k)](https://github.com/addyosmani/psi) - PageSpeed Insights for Node.js - with reporting.\n\n### Bundle Analyzer / Meetups\n\n*   [Bundlesize (⭐4.5k)](https://github.com/siddharthkp/bundlesize) - Keep your bundle size in check.\n*   [source-map-explorer (⭐3.9k)](https://github.com/danvk/source-map-explorer) - Analyze and debug bundle space usage through source maps.\n*   [Bundlephobia](https://bundlephobia.com/) - Helps you find the performance impact of adding an npm package to your frontend bundle.\n*   [Disc](http://hughsk.io/disc/) - Visualise the module tree of browserify project bundles and track down bloat.\n*   [Lasso-analyzer (⭐4)](https://github.com/ajay2507/lasso-analyzer) - analyze and Visualise project bundles created by Lasso.\n*   [Packtracker.io](https://packtracker.io) - Check your webpack bundle stats on every pull request, and track them over time.\n*   [Compression webpack plugin (⭐1.4k)](https://github.com/webpack-contrib/compression-webpack-plugin) - Prepare compressed versions of assets to serve them with Content-Encoding.\n\n### Benchmark - CSS / Meetups\n\n*   [CSS-perf (⭐571)](https://github.com/mdo/css-perf) - Completely unscientific way of testing CSS performance. Most of these tests will revolve around methodologies and techniques for determining effective CSS architecture. Put another way, I want to know what works best given a particular comparison of CSS strategies.\n\n### Benchmark - JavaScript / Meetups\n\n*   [Benchmark.js](http://benchmarkjs.com/) - A robust benchmarking library that works on nearly all JavaScript platforms, supports high-resolution timers, and returns statistically significant results.\n*   [JSlitmus (⭐166)](https://github.com/broofa/jslitmus) - JSLitmus is a lightweight tool for creating ad-hoc JavaScript benchmark tests.\n*   [Stats.js (⭐8.9k)](https://github.com/mrdoob/stats.js) - This class provides a simple info box that will help you monitor your code performance.\n*   [PerfTests (⭐1)](https://github.com/kogarashisan/PerfTests) - Performance tests of JavaScript inheritance models.\n*   [Memory-stats.js (⭐2.1k)](https://github.com/paulirish/memory-stats.js) - minimal monitor for JS Heap Size via performance memory.\n\n### Benchmark - PHP / Meetups\n\n*   [PHPench (⭐53)](https://github.com/mre/PHPench) - PHPench creates a graphical output for a PHP benchmark. Plot the runtime of any function in realtime with GnuPlot and create an image out of the result.\n*   [php-bench (⭐13)](https://github.com/jacobbednarz/php-bench) - Benchmark and profile PHP code blocks whilst measuring the performance footprint.\n\n### Bookmarklets / Meetups\n\n*   [PerfMap (⭐3.8k)](https://github.com/zeman/perfmap) - A bookmarklet to create a frontend performance heatmap of resources loaded in the browser using the Resource Timing API.\n*   [DOM Monster (⭐560)](https://github.com/madrobby/dom-monster) - A cross-platform, cross-browser bookmarklet that will analyze the DOM & other features of the page you're on, and give you its bill of health.\n*   [CSS Stress](http://andy.edinborough.org/CSS-Stress-Testing-and-Performance-Profiling) - CSS Stress is a Testing and Performance Profiling.\n*   [Performance-Bookmarklet (⭐1.2k)](https://github.com/micmro/performance-bookmarklet) - Analyze the current page through the Resource Timing API, Navigation Timing API and User-Timing - Sort of a light live WebPageTest. As [Chrome Extension](https://chrome.google.com/webstore/detail/performance-analyser/djgfmlohefpomchfabngccpbaflcahjf?hl=en) and [Firefox Add-on](https://addons.mozilla.org/en-us/firefox/addon/performance-analyser/?src=cb-dl-created) under the name Performance-Analyser.\n\n### CDN / Meetups\n\n*   [Google Hosted Libraries](https://developers.google.com/speed/libraries/) - Google Hosted Libraries is a content distribution network for the most popular, open-source JavaScript libraries.\n*   [jQuery](http://code.jquery.com/) - jQuery CDN – Latest Stable Versions, powered by MaxCDN.\n*   :cn: [UpYun CDN](http://jscdn.upai.com/) - CDN provided by upyun.\n*   :cn: [Bootstrap 中文网开放 CDN 服务](http://www.bootcdn.cn/) - Bootstrap Chinese net open CDN service (only HTTP).\n\n### CDN - Monitor / Meetups\n\n*   [CDNperf](http://www.cdnperf.com/) - finds you fast and reliable JavaScript CDNs that make your sites snappy and happy.\n\n### CDN - Utilities / Meetups\n\n*   [Gulp-google-cdn (⭐82)](https://github.com/sindresorhus/gulp-google-cdn) - Replaces script references with Google CDN ones.\n\n### Extensions / Meetups\n\n*   [Browser Calories (⭐131)](https://github.com/zenorocha/browser-calories-chrome) - The easiest way to measure your performance budget.\n\n### Image Optimizers / Meetups\n\n*   [Grunt-smushit (⭐84)](https://github.com/heldr/grunt-smushit) - Grunt plugin to remove unnecessary bytes of PNG and JPG using Yahoo Smushit.\n*   [Gulp-smushit (⭐32)](https://github.com/heldr/gulp-smushit) - Gulp plugin to optimize PNG and JPG using Yahoo Smushit. Made on top of smosh.\n*   [Smush it](http://www.imgopt.com/) - Smush it uses optimization techniques specific to image format to remove unnecessary bytes from image files. It is a \"lossless\" tool, which means it optimizes the images without changing their look or visual quality.\n*   [Imagemin (⭐5.7k)](https://github.com/imagemin/imagemin) - Minify images seamlessly with Node.js.\n*   [Gm (⭐7k)](https://github.com/aheckmann/gm) - GraphicsMagick and ImageMagick for Node.js.\n*   [Exexif (⭐13k)](https://github.com/h4cc/awesome-elixir) - Pure elixir library to extract tiff and exif metadata from JPEG files.\n*   [OptiPNG](http://optipng.sourceforge.net/) - OptiPNG is a PNG optimizer that recompresses image files to a smaller size, without losing any information.\n*   [Grunt-contrib-imagemin (⭐1.2k)](https://github.com/gruntjs/grunt-contrib-imagemin) - Minify PNG and JPEG images for Grunt.\n*   [Gulp-imagemin (⭐1.9k)](https://github.com/sindresorhus/gulp-imagemin) - Minify PNG, JPEG, GIF and SVG images with imagemin for Gulp.\n*   [Grunt-WebP (⭐118)](https://github.com/somerandomdude/grunt-webp) - Convert your images to WebP format.\n*   [Gulp-WebP (⭐219)](https://github.com/sindresorhus/gulp-webp) - Convert images to WebP for Gulp.\n*   [ImageOptim-CLI (⭐3.5k)](https://github.com/JamieMason/ImageOptim-CLI) - Automates ImageOptim, ImageAlpha, and JPEGmini for Mac to make batch optimization of images part of your automated build process.\n*   [Tinypng](https://tinypng.com/) - Advanced lossy compression for PNG images that preserves full alpha transparency.\n*   [Kraken Web-interface](https://kraken.io/web-interface) - Optimize your images and will be available for download for 12 hours.\n*   [Compressor](https://compressor.io/) - Online image compressor for JPG, PNG, SVG and GIF.\n*   [Shrinkray](https://shrinkray.io) - One-click optimization for images in your GitHub repos\n*   [mozjpeg (⭐5.6k)](https://github.com/mozilla/mozjpeg) - Improved JPEG encoder.\n*   [Jpegoptim (⭐1.7k)](https://github.com/tjko/jpegoptim) - Utility to optimize/compress JPEG files.\n*   [ZopfliPNG (⭐3.5k)](https://github.com/google/zopfli) - A command-line program to optimize PNG images.\n*   [AdvPNG](http://www.advancemame.it/doc-advpng.html) - Recompress PNG files to get the smallest possible size.\n*   [Leanify (⭐843)](https://github.com/JayXon/Leanify) - Lightweight lossless file minifier/optimizer.\n*   [Trimage](http://trimage.org/) - A cross-platform tool for losslessly optimizing PNG and JPG files.\n*   [ImageEngine](https://imageengine.io) - Cloud service for optimizing, resizing and caching images on the fly with great mobile support.\n\n### Lazyloaders / Meetups\n\n*   [lazyload (⭐936)](https://github.com/vvo/lazyload) - Lazyload images, iframes, widgets with a standalone JavaScript lazyloader \\~1kb\n\n### Loaders / Meetups\n\n*   [HeadJS (⭐4.1k)](https://github.com/headjs/headjs)- The only script in your HEAD. for Responsive Design, Feature Detections, and Resource Loading.\n*   [RequireJS](http://requirejs.org/) - RequireJS is a JavaScript file and module loader. It is optimized for in-browser use, but it can be used in other JavaScript environments, like Rhino and Node.js.\n*   [Labjs](http://labjs.com/) - is an open-source (MIT license) project supported by Getify Solutions. The core purpose of LABjs is to be an all-purpose, on-demand JavaScript loader, capable of loading any JavaScript resource, from any location, into any page, at any time.\n*   [Defer.js (⭐69)](https://github.com/wessman/defer.js) - Async Everything: Make the meat of your pages load faster with this JS morsel.\n\n### Metrics Monitor / Meetups\n\n*   [Phantomas (⭐2.3k)](https://github.com/macbre/phantomas) - PhantomJS-based web performance metrics collector and monitoring tool.\n*   [Showslow](http://www.showslow.com/) - open source tool that helps monitor various site performance metrics over time. It captures the results of YSlow, Page Speed Insights, WebPageTest and dynaTrace Ajax Edition.\n*   [GTmetrix](https://gtmetrix.com/) - GTmetrix uses Google Page Speed and Yahoo! YSlow to grade your site's performance and provides actionable recommendations to fix these issues.\n*   [Pingbreak.com](https://pingbreak.com/) - Free site and SSL Monitoring with response time alerting (on Slack, Twitter, Mattermost, Discord or custom Webhook).\n*   [Dotcom-tools](https://www.dotcom-tools.com/website-speed-test.aspx) - analyze your website's speed in real browsers from 20 locations worldwide.\n*   [Grunt-phantomas (⭐284)](https://github.com/stefanjudis/grunt-phantomas) - Grunt plugin wrapping phantomas to measure frontend performance.\n*   [Perfjankie](https://www.npmjs.com/package/perfjankie) - Runtime Browser Performance regression suite ([Demo (⭐0)](https://github.com/asciidisco/perfjankie-test)).\n*   [BrowserView Monitoring](https://www.dotcom-monitor.com/website-monitor/website-speed-monitoring/) - Continually checks web page load times in Internet Explorer, Chrome and Firefox from multiple points around the world.\n*   [New Relic Browser Monitoring](http://newrelic.com/browser-monitoring) - Monitor your browser-side applications in real time, with a focus on real end users’ experiences.\n*   [DareBoost](https://www.dareboost.com/) - Real Browser Monitoring. Offers complete reports about web performance and quality using YSlow, Page Speed and numerous custom tips.\n\n### Metrics Monitor - API / Meetups\n\n*   [WebPageTest API Wrapper for Node.js (⭐1.6k)](https://github.com/marcelduran/webpagetest-api) - WebPageTest API Wrapper is an npm package that wraps WebPageTest API for Node.js as a module and a command-line tool.\n\n### Minifiers - HTML / Meetups\n\n*   [Django-htmlmin (⭐543)](https://github.com/cobrateam/django-htmlmin) - django-html in an HTML minifier for Python with full support for HTML 5. It supports Django, Flask and any other Python web framework. It also provides a command-line tool that can be used for static sites or deployment scripts.\n*   [HTMLMinifier (⭐5k)](https://github.com/kangax/html-minifier) - HTMLMinifier is a highly configurable, well-tested, Javascript-based HTML minifier, with lint-like capabilities.\n*   [Grunt-contrib-htmlmin (⭐423)](https://github.com/gruntjs/grunt-contrib-htmlmin) - A grunt plugin to minify HTML that uses HTMLMinifier.\n*   [Gulp-htmlmin (⭐725)](https://github.com/jonschlinkert/gulp-htmlmin) - A gulp plugin to minify HTML that uses HTMLMinifier.\n*   [Grunt-htmlcompressor (⭐35)](https://github.com/jney/grunt-htmlcompressor) - Grunt plugin for HTML compression, using htmlcompressor.\n*   [HTML\\_minifier (⭐12)](https://github.com/stereobooster/html_minifier) - Ruby wrapper for kangax html-minifier.\n*   [HTML\\_press (⭐35)](https://github.com/stereobooster/html_press) - Ruby gem for compressing html, that removes all whitespace junk, and leaves only HTML.\n*   [Koa HTML Minifier (⭐32)](https://github.com/koajs/html-minifier) - Middleware that minifies your HTML responses using html-minifier. It uses html-minifier's default options which are all turned off by default, so you have to set the options otherwise it's not going to do anything.\n*   [HTML Minifier Online](http://kangax.github.io/html-minifier/) - A HTML min tool by kangax (HTMLMinifier Creator).\n*   [Html-minifier (⭐135)](https://github.com/deanhume/html-minifier) - A simple Windows command-line tool to minify your HTML, Razor views & Web Forms views\n\n### Minifiers - JS & CSS / Meetups\n\n*   [YUI Compressor (⭐3k)](https://github.com/yui/yuicompressor) - JavaScript compressor which, in addition to removing comments and white-spaces, obfuscates local variables using the smallest possible variable name. This obfuscation is safe, even when using constructs such as 'eval' or 'with' (although the compression is not optimal is those cases) Compared to jsmin, the average savings is around 20%.\n*   [UglifyJS2 (⭐13k)](https://github.com/mishoo/UglifyJS2) - UglifyJS is a JavaScript parser, minifier, compressor or beautifier toolkit, written in JavaScript.\n*   [CSSmin.js (⭐76)](https://github.com/stoyan/yuicompressor/blob/master/ports/js/cssmin.js) - cssmin.js is a JavaScript port of YUICompressor's CSS minifier.\n*   [Grunt-contrib-concat (⭐808)](https://github.com/gruntjs/grunt-contrib-concat) - A Grunt plugin to concatenate files.\n*   [Grunt-contrib-uglify (⭐1.5k)](https://github.com/gruntjs/grunt-contrib-uglify) - A Grunt plugin to concatenate and minify JavaScript files.\n*   [Django-compressor (⭐2.8k)](https://github.com/django-compressor/django-compressor) - Compresses linked and inline JavaScript or CSS into a single cached file.\n*   [Django-pipeline (⭐1.5k)](https://github.com/cyberdelia/django-pipeline) - Pipeline is an asset packaging library for Django, providing both CSS and JavaScript concatenation and compression, built-in JavaScript template support, and optional data-URI image and font embedding.\n*   [JShrink (⭐754)](https://github.com/tedious/JShrink) - JShrink is a PHP class that minifies JavaScript so that it can be delivered to the client quicker.\n*   [JSCompress](http://jscompress.com/) - The most minimalistic online JS Compress tool.\n*   [CSSshrink (⭐1.1k)](https://github.com/stoyan/cssshrink) - Because CSS is ospon the critical path to rendering pages. It must be small! Or else!\n*   [Grunt-cssshrink (⭐28)](https://github.com/JohnCashmore/grunt-cssshrink) - This is just a grunt wrapper for CSS Shrink.\n*   [Gulp-cssshrink (⭐22)](https://github.com/torrottum/gulp-cssshrink) - Shrinks CSS files using cssshrink for Gulp.\n*   [Prettyugly (⭐6)](https://github.com/stoyan/prettyugly) - Uglify (strip spaces) or prettify (add consistent spaces) CSS code.\n*   [Grunt-contrib-cssmin (⭐794)](https://github.com/gruntjs/grunt-contrib-cssmin) - CSS Minifier for Grunt.\n*   [Grunt-uncss (⭐3.8k)](https://github.com/addyosmani/grunt-uncss) - A grunt task for removing unused CSS from your projects.\n*   [Gulp-uncss (⭐936)](https://github.com/ben-eb/gulp-uncss) - A gulp task for removing unused CSS from your projects.\n\n### Miscellaneous / Meetups\n\n*   [Socialite.js](http://socialitejs.com/) - Socialite provides a very easy way to implement and activate a plethora of social sharing buttons — any time you wish. On document load, on article hover, on any event.\n*   [uCSS (⭐1.6k)](https://github.com/oyvindeh/ucss) - uCSS is made for crawling (large) sites to find unused CSS selectors, but not remove unused CSS.\n*   [Critical (⭐10k)](https://github.com/addyosmani/critical) - Extract & Inline Critical-path CSS in HTML pages (alpha).\n*   [Csscolormin (⭐13)](https://github.com/stoyan/csscolormin) - Utility that minifies CSS colors, example: min(\"white\"); // minifies to \"#fff\".\n*   [TMI (⭐1.6k)](https://github.com/addyosmani/tmi) - TMI (Too Many Images) - discover your image weight on the web.\n\n### SVG / Meetups\n\n*   [SVGO (⭐22k)](https://github.com/svg/svgo) - SVGO is a Nodejs-based tool for optimizing SVG vector graphics files.\n*   [SVG OMG](https://jakearchibald.github.io/svgomg/) - SVGOMG is SVGO's Missing GUI, aiming to expose the majority, if not all the configuration options of SVGO.\n*   [Grunt-svgmin (⭐433)](https://github.com/sindresorhus/grunt-svgmin) - Minify SVG using SVGO for Grunt.\n*   [Gulp-svgmin](https://www.npmjs.com/package/gulp-svgmin) - Minify SVG with SVGO for Gulp.\n*   [Scour](http://www.codedread.com/scour/) - Scour is an open-source Python script that aggressively cleans SVG files, removing a lot of 'cruft' that certain tools or authors embed into their documents.\n\n### Web Components / Meetups\n\n*   [Polymer Bundler (⭐434)](https://github.com/Polymer/tools/tree/master/packages/bundler) - Polymer-bundler is a library for packaging project assets for production to minimize network round-trips.\n*   [Gulp-vulcanize (⭐100)](https://github.com/sindresorhus/gulp-vulcanize) - Concatenate a set of Web Components into one file that use Vulcanize.\n\n### Web server Benchmarks / Meetups\n\n*   [HTTPerf (⭐1k)](https://github.com/httperf/httperf) - httperf is a tool for measuring web server performance. It provides a flexible facility for generating various HTTP workloads and for measuring server performance.\n*   [Apache JMeter](http://jmeter.apache.org/download_jmeter.cgi) - Open source load testing tool: It is a Java platform application.\n*   [HTTPerf.rb (⭐13)](https://github.com/jmervine/httperfrb) - Simple Ruby interface for httperf, written in Ruby.\n*   [PHP-httperf (⭐5)](https://github.com/jmervine/php-httperf) - PHP Port of HTTPerf.rb.\n*   [HTTPerf.js (⭐25)](https://github.com/jmervine/httperfjs) - JS Port of HTTPerf.rb.\n*   [HTTPerf.py (⭐11)](https://github.com/jmervine/httperfpy) - Python Port of HTTPerf.rb.\n*   [Gohttperf (⭐4)](https://github.com/jmervine/gohttperf) - Go Port of HTTPerf.rb.\n*   [beeswithmachineguns (⭐6.6k)](https://github.com/newsapps/beeswithmachineguns) - A utility for arming (creating) many bees (micro EC2 instances) to attack (load test) targets (web applications).\n\n### Web server Modules / Meetups\n\n*   [PageSpeed Module](https://developers.google.com/speed/pagespeed/module/download) - PageSpeed speeds up your site and reduces page load time. This open-source web server module automatically applies web performance best practices to pages and associated assets (CSS, JavaScript, images) without requiring that you modify your existing content or workflow. PageSpeed is available as a module for Apache 2.x and Nginx 1.x.\n*   [WebP-detect (⭐244)](https://github.com/igrigorik/webp-detect) - WebP with Accept negotiation.\n*   [Web Performance Working Group](http://www.w3.org/2010/webperf/) - The mission of the Web Performance Working Group, part of the Rich Web Client Activity, is to provide methods to measure aspects of application performance of user agent features and APIs.\n*   [Navigation Timing](https://w3c.github.io/navigation-timing/) - This specification defines a unified interface to store and retrieve high resolution performance metric data related to the navigation of a document.\n*   [Resource Timing](http://www.w3.org/TR/resource-timing/) - This specification defines an interface for web applications to access the complete timing information for resources in a document.\n*   [Performance Timeline](http://www.w3.org/TR/performance-timeline/) - This specification defines a unified interface to store and retrieve performance metric data. This specification does not cover individual performance metric interfaces.\n*   [CSS will-change](https://drafts.csswg.org/css-will-change/) - This specification defines the `will-change` CSS property which allows an author to declare ahead-of-time what properties are likely to change in the future, so the UA can set up the appropriate optimizations some time before they’re needed. This way, when the actual change happens, the page updates in a snappy manner.\n*   [Resource Hints](http://www.w3.org/TR/resource-hints/) - This specification defines the dns-prefetch, preconnect, prefetch, and prerender relationships of the HTML Link Element (\\<link>). These primitives enable the developer, and the server generating or delivering the resources, to assist the user agent in the decision process of which origins it should connect to, and which resources it should fetch and preprocess to improve page performance.\n*   [HTTP Archive](http://httparchive.org/index.php) - It's a permanent repository of web performance information such as size of pages, failed requests, and technologies utilized. This performance information allows us to see trends in how the Web is built and provides a common data set from which to conduct web performance research.\n*   [iamakulov/awesome-webpack-perf (⭐965)](https://github.com/iamakulov/awesome-webpack-perf) - A curated list of webpack tools for web performance\n*   [bayandin/awesome-awesomeness (⭐33k)](https://github.com/bayandin/awesome-awesomeness).\n*   [sindresorhus/awesome (⭐381k)](https://github.com/sindresorhus/awesome).",
      "content_html": "<h3><p>Books</p>\n</h3>\n<ul>\n<li><a href=\"https://www.manning.com/books/http2-in-action\" rel=\"noopener noreferrer\">HTTP/2 in Action by Barry Pollard</a> - Barry Pollard</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.manning.com/books/web-performance-in-action\" rel=\"noopener noreferrer\">Web Performance in Action by Jeremy Wagner</a> - Jeremy L. Wagner</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.bookofspeed.com/\" rel=\"noopener noreferrer\">Book of Speed</a> - Stoyan Stefanov</li>\n</ul>\n\n<ul>\n<li><a href=\"http://designingforperformance.com/\" rel=\"noopener noreferrer\">Designing for Performance: Weighing Aesthetics and Speed</a> - Lara Callender Hogan</li>\n</ul>\n\n<ul>\n<li><a href=\"http://shop.oreilly.com/product/9780596522315.do\" rel=\"noopener noreferrer\">Even Faster Web Sites: Performance Best Practices for Web Developers</a> - Steve Souders</li>\n</ul>\n\n<ul>\n<li><a href=\"http://shop.oreilly.com/product/0636920028048.do\" rel=\"noopener noreferrer\">High Performance Browser Networking: What every web developer should know about networking and web performance</a> - Ilya Grigorik</li>\n</ul>\n\n<ul>\n<li><a href=\"http://shop.oreilly.com/product/9780596802806.do\" rel=\"noopener noreferrer\">High Performance JavaScript</a> - Nicholas C. Zakas</li>\n</ul>\n\n<ul>\n<li><a href=\"http://books.google.de/books/about/High_Performance_Web_Sites.html?id=jRVlgNDOr60C&amp;redir_esc=y\" rel=\"noopener noreferrer\">High Performance Web Sites: Essential Knowledge for frontend Engineers</a> - Steve Souders</li>\n</ul>\n\n<ul>\n<li><a href=\"http://shop.oreilly.com/product/0636920033103.do\" rel=\"noopener noreferrer\">High Performance Responsive Design: Building Faster Sites Across Devices</a> – Tom Barker</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.sitepoint.com/premium/books/lean-websites\" rel=\"noopener noreferrer\">Lean sites</a> – Barbara Bermes</li>\n</ul>\n\n<ul>\n<li><a href=\"http://shop.oreilly.com/product/0636920041450.do\" rel=\"noopener noreferrer\">Time Is Money: The Business Value of Web Performance</a> – Tammy Everts</li>\n</ul>\n\n<ul>\n<li><a href=\"http://shop.oreilly.com/product/0636920033592.do\" rel=\"noopener noreferrer\">Using WebPagetest</a> - Rick Viscomi, Andy Davies, Marcel Duran</li>\n</ul>\n\n<ul>\n<li><a href=\"http://www.oreilly.com/webops-perf/free/webpage-size-speed-perf.csp\" rel=\"noopener noreferrer\">Web Page Size, Speed, and Performance</a> - Terrence Dorsey</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.amazon.com/Web-Performance-Daybook-Stoyan-Stefanov-ebook/dp/B008CQA8BA/\" rel=\"noopener noreferrer\">Web Performance Daybook Volume 2</a> - Stoyan Stefanov</li>\n</ul>\n\n<ul>\n<li><a href=\"http://shop.oreilly.com/product/9780596001728.do\" rel=\"noopener noreferrer\">Web Performance Tuning</a> - Patrick Killelea</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.oreilly.com/library/view/you-dont-know/9781491905197/\" rel=\"noopener noreferrer\">You Don't Know JS: Async &amp; Performance</a> - Kyle Simpson</li>\n</ul>\n\n<ul>\n<li><a href=\"https://play.google.com/store/books/details/Colin_McKinnon_Linux_Apache_MySQL_PHP_Performance?id=Z3ciBgAAQBAJ\" rel=\"noopener noreferrer\">Linux, Apache, MySQL, PHP Performance end-to-end</a> - Colin McKinnon</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.manning.com/books/web-components-in-action\" rel=\"noopener noreferrer\">Web Components in Action</a> - Ben Farrell</li>\n</ul>\n<h3><p>Case studies</p>\n</h3>\n<ul>\n<li><a href=\"https://wpostats.com/\" rel=\"noopener noreferrer\">WPOStats</a> - Case studies and experiments demonstrating the impact of web performance optimization (WPO) on user experience and business metrics.</li>\n</ul>\n<h3><p>Documentation</p>\n</h3>\n<ul>\n<li><a href=\"https://browserdiet.com/en/\" rel=\"noopener noreferrer\">Browser Diet</a> - A collaborative guide about frontend performance.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://developers.google.com/speed/docs/insights/rules\" rel=\"noopener noreferrer\">PageSpeed Insights Rules</a> - A guide created by PageSpeed Team.\nDeprecated. This is deprecated and will be shut down in May 2019. Version 5 is the latest and provides both real-world data from the Chrome User Experience Report and lab data from Lighthouse.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://developer.yahoo.com/performance/rules.html\" rel=\"noopener noreferrer\">Best Practices for Speeding Up Your site</a> - The list includes 35 best practices divided into 7 categories, created by Yahoo! Exceptional Performance team.</li>\n</ul>\n<h3><p>Events / Conferences</p>\n</h3>\n<ul>\n<li><a href=\"http://conferences.oreilly.com/velocity\" rel=\"noopener noreferrer\">Velocity</a> – At Velocity, web operations, performance, and DevOps professionals learn to build fast, resilient, and highly available sites and apps.</li>\n</ul>\n<h3><p>Analyzers / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://web.dev/\" rel=\"noopener noreferrer\">Web.dev</a> - Get the web's modern capabilities on your own sites and apps with useful guidance and analysis from web.dev.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/jamesgpearce/confess\" rel=\"noopener noreferrer\">Confess (⭐872)</a> - Uses PhantomJS to headlessly analyze web pages and generate manifests.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.debugbear.com/\" rel=\"noopener noreferrer\">DebugBear</a> - DebugBear is a site monitoring tool based on Lighthouse. See how your scores and metrics changed over time, with a focus on understanding what caused each change. DebugBear is a paid product with a free 30-day trial.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://developers.google.com/speed/pagespeed/\" rel=\"noopener noreferrer\">Page Speed</a> - The PageSpeed family of tools is designed to help you optimize the performance of your site. PageSpeed Insights products will help you identify performance best practices that can be applied to your site, and PageSpeed optimization tools can help you automate the process.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/GoogleChrome/lighthouse\" rel=\"noopener noreferrer\">Lighthouse (⭐29k)</a> - Auditing and performance metrics tool for Progressive Web Applications.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://yslow.org/phantomjs/\" rel=\"noopener noreferrer\">YSlow for PhantomJS</a> - YSlow for PhantomJS also introduces new output formats for automated test frameworks: TAP (Test Anything Protocol) and JUnit.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/andyshora/grunt-yslow\" rel=\"noopener noreferrer\">Grunt-yslow (⭐91)</a> - Grunt task for testing page performance using PhantomJS, a headless WebKit browser.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/tkadlec/grunt-perfbudget\" rel=\"noopener noreferrer\">Grunt-perfbudget (⭐855)</a> - A Grunt.js task for enforcing a performance budget (<a href=\"https://timkadlec.com/2013/01/setting-a-performance-budget/\" rel=\"noopener noreferrer\">more on performance budgets</a>).</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/google/tracing-framework\" rel=\"noopener noreferrer\">Web Tracing Framework (⭐2.6k)</a> - Web Tracing Framework is a set of libraries, tools, and visualizers for the tracing and investigation of complex web applications</li>\n</ul>\n\n<ul>\n<li><a href=\"http://pagelocity.com/\" rel=\"noopener noreferrer\">Pagelocity</a> - A web performance optimization and analysis tool.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://varvy.com/pagespeed/\" rel=\"noopener noreferrer\">Varvy</a> - Test your site to see if it follows the Google guidelines for speed.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://www.webbloatscore.com/\" rel=\"noopener noreferrer\">Web Bloat Score Calculator</a> - Compare size of a page to a compressed image of the same page</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/ngryman/speedracer\" rel=\"noopener noreferrer\">Speed Racer (⭐1.9k)</a> - Collect performance metrics for your library/application using Chrome headless.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://speedrank.app/\" rel=\"noopener noreferrer\">Speedrank</a> - Speedrank monitors the performance of your site in the background. It displays Lighthouse reports over time and delivers recommendations for improvement. Speedrank is a paid product with 14-day-trial.</li>\n</ul>\n<h3><p>Analyzers - API / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/jmervine/node-yslowjs\" rel=\"noopener noreferrer\">Node-yslowjs (⭐9)</a> - YSlow.js on Node.js is a simple Node.js wrapper for programmatically running phantomjs yslow.js.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/addyosmani/psi\" rel=\"noopener noreferrer\">PSI (⭐3.1k)</a> - PageSpeed Insights for Node.js - with reporting.</li>\n</ul>\n<h3><p>Bundle Analyzer / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/siddharthkp/bundlesize\" rel=\"noopener noreferrer\">Bundlesize (⭐4.5k)</a> - Keep your bundle size in check.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/danvk/source-map-explorer\" rel=\"noopener noreferrer\">source-map-explorer (⭐3.9k)</a> - Analyze and debug bundle space usage through source maps.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://bundlephobia.com/\" rel=\"noopener noreferrer\">Bundlephobia</a> - Helps you find the performance impact of adding an npm package to your frontend bundle.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://hughsk.io/disc/\" rel=\"noopener noreferrer\">Disc</a> - Visualise the module tree of browserify project bundles and track down bloat.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/ajay2507/lasso-analyzer\" rel=\"noopener noreferrer\">Lasso-analyzer (⭐4)</a> - analyze and Visualise project bundles created by Lasso.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://packtracker.io\" rel=\"noopener noreferrer\">Packtracker.io</a> - Check your webpack bundle stats on every pull request, and track them over time.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/webpack-contrib/compression-webpack-plugin\" rel=\"noopener noreferrer\">Compression webpack plugin (⭐1.4k)</a> - Prepare compressed versions of assets to serve them with Content-Encoding.</li>\n</ul>\n<h3><p>Benchmark - CSS / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/mdo/css-perf\" rel=\"noopener noreferrer\">CSS-perf (⭐571)</a> - Completely unscientific way of testing CSS performance. Most of these tests will revolve around methodologies and techniques for determining effective CSS architecture. Put another way, I want to know what works best given a particular comparison of CSS strategies.</li>\n</ul>\n<h3><p>Benchmark - JavaScript / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"http://benchmarkjs.com/\" rel=\"noopener noreferrer\">Benchmark.js</a> - A robust benchmarking library that works on nearly all JavaScript platforms, supports high-resolution timers, and returns statistically significant results.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/broofa/jslitmus\" rel=\"noopener noreferrer\">JSlitmus (⭐166)</a> - JSLitmus is a lightweight tool for creating ad-hoc JavaScript benchmark tests.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/mrdoob/stats.js\" rel=\"noopener noreferrer\">Stats.js (⭐8.9k)</a> - This class provides a simple info box that will help you monitor your code performance.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/kogarashisan/PerfTests\" rel=\"noopener noreferrer\">PerfTests (⭐1)</a> - Performance tests of JavaScript inheritance models.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/paulirish/memory-stats.js\" rel=\"noopener noreferrer\">Memory-stats.js (⭐2.1k)</a> - minimal monitor for JS Heap Size via performance memory.</li>\n</ul>\n<h3><p>Benchmark - PHP / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/mre/PHPench\" rel=\"noopener noreferrer\">PHPench (⭐53)</a> - PHPench creates a graphical output for a PHP benchmark. Plot the runtime of any function in realtime with GnuPlot and create an image out of the result.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/jacobbednarz/php-bench\" rel=\"noopener noreferrer\">php-bench (⭐13)</a> - Benchmark and profile PHP code blocks whilst measuring the performance footprint.</li>\n</ul>\n<h3><p>Bookmarklets / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/zeman/perfmap\" rel=\"noopener noreferrer\">PerfMap (⭐3.8k)</a> - A bookmarklet to create a frontend performance heatmap of resources loaded in the browser using the Resource Timing API.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/madrobby/dom-monster\" rel=\"noopener noreferrer\">DOM Monster (⭐560)</a> - A cross-platform, cross-browser bookmarklet that will analyze the DOM &amp; other features of the page you're on, and give you its bill of health.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://andy.edinborough.org/CSS-Stress-Testing-and-Performance-Profiling\" rel=\"noopener noreferrer\">CSS Stress</a> - CSS Stress is a Testing and Performance Profiling.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/micmro/performance-bookmarklet\" rel=\"noopener noreferrer\">Performance-Bookmarklet (⭐1.2k)</a> - Analyze the current page through the Resource Timing API, Navigation Timing API and User-Timing - Sort of a light live WebPageTest. As <a href=\"https://chrome.google.com/webstore/detail/performance-analyser/djgfmlohefpomchfabngccpbaflcahjf?hl=en\" rel=\"noopener noreferrer\">Chrome Extension</a> and <a href=\"https://addons.mozilla.org/en-us/firefox/addon/performance-analyser/?src=cb-dl-created\" rel=\"noopener noreferrer\">Firefox Add-on</a> under the name Performance-Analyser.</li>\n</ul>\n<h3><p>CDN / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://developers.google.com/speed/libraries/\" rel=\"noopener noreferrer\">Google Hosted Libraries</a> - Google Hosted Libraries is a content distribution network for the most popular, open-source JavaScript libraries.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://code.jquery.com/\" rel=\"noopener noreferrer\">jQuery</a> - jQuery CDN – Latest Stable Versions, powered by MaxCDN.</li>\n</ul>\n\n<ul>\n<li>🇨🇳 <a href=\"http://jscdn.upai.com/\" rel=\"noopener noreferrer\">UpYun CDN</a> - CDN provided by upyun.</li>\n</ul>\n\n<ul>\n<li>🇨🇳 <a href=\"http://www.bootcdn.cn/\" rel=\"noopener noreferrer\">Bootstrap 中文网开放 CDN 服务</a> - Bootstrap Chinese net open CDN service (only HTTP).</li>\n</ul>\n<h3><p>CDN - Monitor / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"http://www.cdnperf.com/\" rel=\"noopener noreferrer\">CDNperf</a> - finds you fast and reliable JavaScript CDNs that make your sites snappy and happy.</li>\n</ul>\n<h3><p>CDN - Utilities / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/sindresorhus/gulp-google-cdn\" rel=\"noopener noreferrer\">Gulp-google-cdn (⭐82)</a> - Replaces script references with Google CDN ones.</li>\n</ul>\n<h3><p>Extensions / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/zenorocha/browser-calories-chrome\" rel=\"noopener noreferrer\">Browser Calories (⭐131)</a> - The easiest way to measure your performance budget.</li>\n</ul>\n<h3><p>Image Optimizers / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/heldr/grunt-smushit\" rel=\"noopener noreferrer\">Grunt-smushit (⭐84)</a> - Grunt plugin to remove unnecessary bytes of PNG and JPG using Yahoo Smushit.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/heldr/gulp-smushit\" rel=\"noopener noreferrer\">Gulp-smushit (⭐32)</a> - Gulp plugin to optimize PNG and JPG using Yahoo Smushit. Made on top of smosh.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://www.imgopt.com/\" rel=\"noopener noreferrer\">Smush it</a> - Smush it uses optimization techniques specific to image format to remove unnecessary bytes from image files. It is a \"lossless\" tool, which means it optimizes the images without changing their look or visual quality.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/imagemin/imagemin\" rel=\"noopener noreferrer\">Imagemin (⭐5.7k)</a> - Minify images seamlessly with Node.js.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/aheckmann/gm\" rel=\"noopener noreferrer\">Gm (⭐7k)</a> - GraphicsMagick and ImageMagick for Node.js.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/h4cc/awesome-elixir\" rel=\"noopener noreferrer\">Exexif (⭐13k)</a> - Pure elixir library to extract tiff and exif metadata from JPEG files.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://optipng.sourceforge.net/\" rel=\"noopener noreferrer\">OptiPNG</a> - OptiPNG is a PNG optimizer that recompresses image files to a smaller size, without losing any information.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/gruntjs/grunt-contrib-imagemin\" rel=\"noopener noreferrer\">Grunt-contrib-imagemin (⭐1.2k)</a> - Minify PNG and JPEG images for Grunt.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/sindresorhus/gulp-imagemin\" rel=\"noopener noreferrer\">Gulp-imagemin (⭐1.9k)</a> - Minify PNG, JPEG, GIF and SVG images with imagemin for Gulp.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/somerandomdude/grunt-webp\" rel=\"noopener noreferrer\">Grunt-WebP (⭐118)</a> - Convert your images to WebP format.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/sindresorhus/gulp-webp\" rel=\"noopener noreferrer\">Gulp-WebP (⭐219)</a> - Convert images to WebP for Gulp.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/JamieMason/ImageOptim-CLI\" rel=\"noopener noreferrer\">ImageOptim-CLI (⭐3.5k)</a> - Automates ImageOptim, ImageAlpha, and JPEGmini for Mac to make batch optimization of images part of your automated build process.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://tinypng.com/\" rel=\"noopener noreferrer\">Tinypng</a> - Advanced lossy compression for PNG images that preserves full alpha transparency.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://kraken.io/web-interface\" rel=\"noopener noreferrer\">Kraken Web-interface</a> - Optimize your images and will be available for download for 12 hours.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://compressor.io/\" rel=\"noopener noreferrer\">Compressor</a> - Online image compressor for JPG, PNG, SVG and GIF.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://shrinkray.io\" rel=\"noopener noreferrer\">Shrinkray</a> - One-click optimization for images in your GitHub repos</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/mozilla/mozjpeg\" rel=\"noopener noreferrer\">mozjpeg (⭐5.6k)</a> - Improved JPEG encoder.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/tjko/jpegoptim\" rel=\"noopener noreferrer\">Jpegoptim (⭐1.7k)</a> - Utility to optimize/compress JPEG files.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/google/zopfli\" rel=\"noopener noreferrer\">ZopfliPNG (⭐3.5k)</a> - A command-line program to optimize PNG images.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://www.advancemame.it/doc-advpng.html\" rel=\"noopener noreferrer\">AdvPNG</a> - Recompress PNG files to get the smallest possible size.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/JayXon/Leanify\" rel=\"noopener noreferrer\">Leanify (⭐843)</a> - Lightweight lossless file minifier/optimizer.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://trimage.org/\" rel=\"noopener noreferrer\">Trimage</a> - A cross-platform tool for losslessly optimizing PNG and JPG files.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://imageengine.io\" rel=\"noopener noreferrer\">ImageEngine</a> - Cloud service for optimizing, resizing and caching images on the fly with great mobile support.</li>\n</ul>\n<h3><p>Lazyloaders / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/vvo/lazyload\" rel=\"noopener noreferrer\">lazyload (⭐936)</a> - Lazyload images, iframes, widgets with a standalone JavaScript lazyloader ~1kb</li>\n</ul>\n<h3><p>Loaders / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/headjs/headjs\" rel=\"noopener noreferrer\">HeadJS (⭐4.1k)</a>- The only script in your HEAD. for Responsive Design, Feature Detections, and Resource Loading.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://requirejs.org/\" rel=\"noopener noreferrer\">RequireJS</a> - RequireJS is a JavaScript file and module loader. It is optimized for in-browser use, but it can be used in other JavaScript environments, like Rhino and Node.js.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://labjs.com/\" rel=\"noopener noreferrer\">Labjs</a> - is an open-source (MIT license) project supported by Getify Solutions. The core purpose of LABjs is to be an all-purpose, on-demand JavaScript loader, capable of loading any JavaScript resource, from any location, into any page, at any time.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/wessman/defer.js\" rel=\"noopener noreferrer\">Defer.js (⭐69)</a> - Async Everything: Make the meat of your pages load faster with this JS morsel.</li>\n</ul>\n<h3><p>Metrics Monitor / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/macbre/phantomas\" rel=\"noopener noreferrer\">Phantomas (⭐2.3k)</a> - PhantomJS-based web performance metrics collector and monitoring tool.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://www.showslow.com/\" rel=\"noopener noreferrer\">Showslow</a> - open source tool that helps monitor various site performance metrics over time. It captures the results of YSlow, Page Speed Insights, WebPageTest and dynaTrace Ajax Edition.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://gtmetrix.com/\" rel=\"noopener noreferrer\">GTmetrix</a> - GTmetrix uses Google Page Speed and Yahoo! YSlow to grade your site's performance and provides actionable recommendations to fix these issues.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://pingbreak.com/\" rel=\"noopener noreferrer\">Pingbreak.com</a> - Free site and SSL Monitoring with response time alerting (on Slack, Twitter, Mattermost, Discord or custom Webhook).</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.dotcom-tools.com/website-speed-test.aspx\" rel=\"noopener noreferrer\">Dotcom-tools</a> - analyze your website's speed in real browsers from 20 locations worldwide.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/stefanjudis/grunt-phantomas\" rel=\"noopener noreferrer\">Grunt-phantomas (⭐284)</a> - Grunt plugin wrapping phantomas to measure frontend performance.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.npmjs.com/package/perfjankie\" rel=\"noopener noreferrer\">Perfjankie</a> - Runtime Browser Performance regression suite (<a href=\"https://github.com/asciidisco/perfjankie-test\" rel=\"noopener noreferrer\">Demo (⭐0)</a>).</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.dotcom-monitor.com/website-monitor/website-speed-monitoring/\" rel=\"noopener noreferrer\">BrowserView Monitoring</a> - Continually checks web page load times in Internet Explorer, Chrome and Firefox from multiple points around the world.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://newrelic.com/browser-monitoring\" rel=\"noopener noreferrer\">New Relic Browser Monitoring</a> - Monitor your browser-side applications in real time, with a focus on real end users’ experiences.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.dareboost.com/\" rel=\"noopener noreferrer\">DareBoost</a> - Real Browser Monitoring. Offers complete reports about web performance and quality using YSlow, Page Speed and numerous custom tips.</li>\n</ul>\n<h3><p>Metrics Monitor - API / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/marcelduran/webpagetest-api\" rel=\"noopener noreferrer\">WebPageTest API Wrapper for Node.js (⭐1.6k)</a> - WebPageTest API Wrapper is an npm package that wraps WebPageTest API for Node.js as a module and a command-line tool.</li>\n</ul>\n<h3><p>Minifiers - HTML / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/cobrateam/django-htmlmin\" rel=\"noopener noreferrer\">Django-htmlmin (⭐543)</a> - django-html in an HTML minifier for Python with full support for HTML 5. It supports Django, Flask and any other Python web framework. It also provides a command-line tool that can be used for static sites or deployment scripts.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/kangax/html-minifier\" rel=\"noopener noreferrer\">HTMLMinifier (⭐5k)</a> - HTMLMinifier is a highly configurable, well-tested, Javascript-based HTML minifier, with lint-like capabilities.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/gruntjs/grunt-contrib-htmlmin\" rel=\"noopener noreferrer\">Grunt-contrib-htmlmin (⭐423)</a> - A grunt plugin to minify HTML that uses HTMLMinifier.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/jonschlinkert/gulp-htmlmin\" rel=\"noopener noreferrer\">Gulp-htmlmin (⭐725)</a> - A gulp plugin to minify HTML that uses HTMLMinifier.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/jney/grunt-htmlcompressor\" rel=\"noopener noreferrer\">Grunt-htmlcompressor (⭐35)</a> - Grunt plugin for HTML compression, using htmlcompressor.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/stereobooster/html_minifier\" rel=\"noopener noreferrer\">HTML_minifier (⭐12)</a> - Ruby wrapper for kangax html-minifier.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/stereobooster/html_press\" rel=\"noopener noreferrer\">HTML_press (⭐35)</a> - Ruby gem for compressing html, that removes all whitespace junk, and leaves only HTML.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/koajs/html-minifier\" rel=\"noopener noreferrer\">Koa HTML Minifier (⭐32)</a> - Middleware that minifies your HTML responses using html-minifier. It uses html-minifier's default options which are all turned off by default, so you have to set the options otherwise it's not going to do anything.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://kangax.github.io/html-minifier/\" rel=\"noopener noreferrer\">HTML Minifier Online</a> - A HTML min tool by kangax (HTMLMinifier Creator).</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/deanhume/html-minifier\" rel=\"noopener noreferrer\">Html-minifier (⭐135)</a> - A simple Windows command-line tool to minify your HTML, Razor views &amp; Web Forms views</li>\n</ul>\n<h3><p>Minifiers - JS &amp; CSS / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/yui/yuicompressor\" rel=\"noopener noreferrer\">YUI Compressor (⭐3k)</a> - JavaScript compressor which, in addition to removing comments and white-spaces, obfuscates local variables using the smallest possible variable name. This obfuscation is safe, even when using constructs such as 'eval' or 'with' (although the compression is not optimal is those cases) Compared to jsmin, the average savings is around 20%.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/mishoo/UglifyJS2\" rel=\"noopener noreferrer\">UglifyJS2 (⭐13k)</a> - UglifyJS is a JavaScript parser, minifier, compressor or beautifier toolkit, written in JavaScript.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/stoyan/yuicompressor/blob/master/ports/js/cssmin.js\" rel=\"noopener noreferrer\">CSSmin.js (⭐76)</a> - cssmin.js is a JavaScript port of YUICompressor's CSS minifier.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/gruntjs/grunt-contrib-concat\" rel=\"noopener noreferrer\">Grunt-contrib-concat (⭐808)</a> - A Grunt plugin to concatenate files.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/gruntjs/grunt-contrib-uglify\" rel=\"noopener noreferrer\">Grunt-contrib-uglify (⭐1.5k)</a> - A Grunt plugin to concatenate and minify JavaScript files.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/django-compressor/django-compressor\" rel=\"noopener noreferrer\">Django-compressor (⭐2.8k)</a> - Compresses linked and inline JavaScript or CSS into a single cached file.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/cyberdelia/django-pipeline\" rel=\"noopener noreferrer\">Django-pipeline (⭐1.5k)</a> - Pipeline is an asset packaging library for Django, providing both CSS and JavaScript concatenation and compression, built-in JavaScript template support, and optional data-URI image and font embedding.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/tedious/JShrink\" rel=\"noopener noreferrer\">JShrink (⭐754)</a> - JShrink is a PHP class that minifies JavaScript so that it can be delivered to the client quicker.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://jscompress.com/\" rel=\"noopener noreferrer\">JSCompress</a> - The most minimalistic online JS Compress tool.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/stoyan/cssshrink\" rel=\"noopener noreferrer\">CSSshrink (⭐1.1k)</a> - Because CSS is ospon the critical path to rendering pages. It must be small! Or else!</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/JohnCashmore/grunt-cssshrink\" rel=\"noopener noreferrer\">Grunt-cssshrink (⭐28)</a> - This is just a grunt wrapper for CSS Shrink.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/torrottum/gulp-cssshrink\" rel=\"noopener noreferrer\">Gulp-cssshrink (⭐22)</a> - Shrinks CSS files using cssshrink for Gulp.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/stoyan/prettyugly\" rel=\"noopener noreferrer\">Prettyugly (⭐6)</a> - Uglify (strip spaces) or prettify (add consistent spaces) CSS code.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/gruntjs/grunt-contrib-cssmin\" rel=\"noopener noreferrer\">Grunt-contrib-cssmin (⭐794)</a> - CSS Minifier for Grunt.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/addyosmani/grunt-uncss\" rel=\"noopener noreferrer\">Grunt-uncss (⭐3.8k)</a> - A grunt task for removing unused CSS from your projects.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/ben-eb/gulp-uncss\" rel=\"noopener noreferrer\">Gulp-uncss (⭐936)</a> - A gulp task for removing unused CSS from your projects.</li>\n</ul>\n<h3><p>Miscellaneous / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"http://socialitejs.com/\" rel=\"noopener noreferrer\">Socialite.js</a> - Socialite provides a very easy way to implement and activate a plethora of social sharing buttons — any time you wish. On document load, on article hover, on any event.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/oyvindeh/ucss\" rel=\"noopener noreferrer\">uCSS (⭐1.6k)</a> - uCSS is made for crawling (large) sites to find unused CSS selectors, but not remove unused CSS.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/addyosmani/critical\" rel=\"noopener noreferrer\">Critical (⭐10k)</a> - Extract &amp; Inline Critical-path CSS in HTML pages (alpha).</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/stoyan/csscolormin\" rel=\"noopener noreferrer\">Csscolormin (⭐13)</a> - Utility that minifies CSS colors, example: min(\"white\"); // minifies to \"#fff\".</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/addyosmani/tmi\" rel=\"noopener noreferrer\">TMI (⭐1.6k)</a> - TMI (Too Many Images) - discover your image weight on the web.</li>\n</ul>\n<h3><p>SVG / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/svg/svgo\" rel=\"noopener noreferrer\">SVGO (⭐22k)</a> - SVGO is a Nodejs-based tool for optimizing SVG vector graphics files.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://jakearchibald.github.io/svgomg/\" rel=\"noopener noreferrer\">SVG OMG</a> - SVGOMG is SVGO's Missing GUI, aiming to expose the majority, if not all the configuration options of SVGO.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/sindresorhus/grunt-svgmin\" rel=\"noopener noreferrer\">Grunt-svgmin (⭐433)</a> - Minify SVG using SVGO for Grunt.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://www.npmjs.com/package/gulp-svgmin\" rel=\"noopener noreferrer\">Gulp-svgmin</a> - Minify SVG with SVGO for Gulp.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://www.codedread.com/scour/\" rel=\"noopener noreferrer\">Scour</a> - Scour is an open-source Python script that aggressively cleans SVG files, removing a lot of 'cruft' that certain tools or authors embed into their documents.</li>\n</ul>\n<h3><p>Web Components / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/Polymer/tools/tree/master/packages/bundler\" rel=\"noopener noreferrer\">Polymer Bundler (⭐434)</a> - Polymer-bundler is a library for packaging project assets for production to minimize network round-trips.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/sindresorhus/gulp-vulcanize\" rel=\"noopener noreferrer\">Gulp-vulcanize (⭐100)</a> - Concatenate a set of Web Components into one file that use Vulcanize.</li>\n</ul>\n<h3><p>Web server Benchmarks / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/httperf/httperf\" rel=\"noopener noreferrer\">HTTPerf (⭐1k)</a> - httperf is a tool for measuring web server performance. It provides a flexible facility for generating various HTTP workloads and for measuring server performance.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://jmeter.apache.org/download_jmeter.cgi\" rel=\"noopener noreferrer\">Apache JMeter</a> - Open source load testing tool: It is a Java platform application.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/jmervine/httperfrb\" rel=\"noopener noreferrer\">HTTPerf.rb (⭐13)</a> - Simple Ruby interface for httperf, written in Ruby.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/jmervine/php-httperf\" rel=\"noopener noreferrer\">PHP-httperf (⭐5)</a> - PHP Port of HTTPerf.rb.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/jmervine/httperfjs\" rel=\"noopener noreferrer\">HTTPerf.js (⭐25)</a> - JS Port of HTTPerf.rb.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/jmervine/httperfpy\" rel=\"noopener noreferrer\">HTTPerf.py (⭐11)</a> - Python Port of HTTPerf.rb.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/jmervine/gohttperf\" rel=\"noopener noreferrer\">Gohttperf (⭐4)</a> - Go Port of HTTPerf.rb.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/newsapps/beeswithmachineguns\" rel=\"noopener noreferrer\">beeswithmachineguns (⭐6.6k)</a> - A utility for arming (creating) many bees (micro EC2 instances) to attack (load test) targets (web applications).</li>\n</ul>\n<h3><p>Web server Modules / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://developers.google.com/speed/pagespeed/module/download\" rel=\"noopener noreferrer\">PageSpeed Module</a> - PageSpeed speeds up your site and reduces page load time. This open-source web server module automatically applies web performance best practices to pages and associated assets (CSS, JavaScript, images) without requiring that you modify your existing content or workflow. PageSpeed is available as a module for Apache 2.x and Nginx 1.x.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/igrigorik/webp-detect\" rel=\"noopener noreferrer\">WebP-detect (⭐244)</a> - WebP with Accept negotiation.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://www.w3.org/2010/webperf/\" rel=\"noopener noreferrer\">Web Performance Working Group</a> - The mission of the Web Performance Working Group, part of the Rich Web Client Activity, is to provide methods to measure aspects of application performance of user agent features and APIs.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://w3c.github.io/navigation-timing/\" rel=\"noopener noreferrer\">Navigation Timing</a> - This specification defines a unified interface to store and retrieve high resolution performance metric data related to the navigation of a document.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://www.w3.org/TR/resource-timing/\" rel=\"noopener noreferrer\">Resource Timing</a> - This specification defines an interface for web applications to access the complete timing information for resources in a document.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://www.w3.org/TR/performance-timeline/\" rel=\"noopener noreferrer\">Performance Timeline</a> - This specification defines a unified interface to store and retrieve performance metric data. This specification does not cover individual performance metric interfaces.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://drafts.csswg.org/css-will-change/\" rel=\"noopener noreferrer\">CSS will-change</a> - This specification defines the <code>will-change</code> CSS property which allows an author to declare ahead-of-time what properties are likely to change in the future, so the UA can set up the appropriate optimizations some time before they’re needed. This way, when the actual change happens, the page updates in a snappy manner.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://www.w3.org/TR/resource-hints/\" rel=\"noopener noreferrer\">Resource Hints</a> - This specification defines the dns-prefetch, preconnect, prefetch, and prerender relationships of the HTML Link Element (&lt;link&gt;). These primitives enable the developer, and the server generating or delivering the resources, to assist the user agent in the decision process of which origins it should connect to, and which resources it should fetch and preprocess to improve page performance.</li>\n</ul>\n\n<ul>\n<li><a href=\"http://httparchive.org/index.php\" rel=\"noopener noreferrer\">HTTP Archive</a> - It's a permanent repository of web performance information such as size of pages, failed requests, and technologies utilized. This performance information allows us to see trends in how the Web is built and provides a common data set from which to conduct web performance research.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/iamakulov/awesome-webpack-perf\" rel=\"noopener noreferrer\">iamakulov/awesome-webpack-perf (⭐965)</a> - A curated list of webpack tools for web performance</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/bayandin/awesome-awesomeness\" rel=\"noopener noreferrer\">bayandin/awesome-awesomeness (⭐33k)</a>.</li>\n</ul>\n\n<ul>\n<li><a href=\"https://github.com/sindresorhus/awesome\" rel=\"noopener noreferrer\">sindresorhus/awesome (⭐381k)</a>.</li>\n</ul>\n"
    },
    {
      "id": "https://www.trackawesomelist.com/2014/11/01/",
      "title": "Awesome Wpo Updates on Nov 01, 2014",
      "_short_title": "Nov 01, 2014",
      "_slug": "2014/11/01/",
      "summary": "1 awesome projects updated on Nov 01, 2014",
      "_filepath": "/content/2014/11/01/README.md",
      "url": "https://www.trackawesomelist.com/2014/11/01/",
      "date_published": "2014-11-01T12:23:14.000Z",
      "date_modified": "2014-11-01T12:23:14.000Z",
      "content_text": "\n\n### Web server Benchmarks / Meetups\n\n*   [wrk (⭐39k)](https://github.com/wg/wrk) - A HTTP benchmarking tool (with optional Lua scripting for request generation, response\n    processing, and custom reporting)",
      "content_html": "<h3><p>Web server Benchmarks / Meetups</p>\n</h3>\n<ul>\n<li><a href=\"https://github.com/wg/wrk\" rel=\"noopener noreferrer\">wrk (⭐39k)</a> - A HTTP benchmarking tool (with optional Lua scripting for request generation, response\nprocessing, and custom reporting)</li>\n</ul>\n"
    }
  ]
}
