{
  "version": "https://jsonfeed.org/version/1",
  "icon": "https://www.trackawesomelist.com/icon.png",
  "favicon": "https://www.trackawesomelist.com/favicon.ico",
  "language": "en",
  "title": "Awesome List Updates on Mar 09, 2025",
  "_site_title": "Track Awesome List",
  "description": "6 awesome lists updated today.",
  "_seo_title": "Awesome List Updates on Mar 09, 2025 - Track Awesome List",
  "feed_url": "https://www.trackawesomelist.com/feed.json",
  "home_page_url": "https://www.trackawesomelist.com",
  "items": [
    {
      "id": "https://www.trackawesomelist.com/jivoi/awesome-osint/",
      "title": "Awesome Osint",
      "_slug": "jivoi/awesome-osint/",
      "_filepath": "/content/jivoi/awesome-osint/README.md",
      "url": "https://www.trackawesomelist.com/jivoi/awesome-osint/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Speciality Search Engines\n\n*   [Abuseipdb](https://www.abuseipdb.com/) - Repository of abuses reported by system administrators for IPs, Domains, and subnets",
      "content_html": "<h3><p>Speciality Search Engines</p>\n</h3><ul>\n<li><a href=\"https://www.abuseipdb.com/\" rel=\"noopener noreferrer\">Abuseipdb</a> - Repository of abuses reported by system administrators for IPs, Domains, and subnets</li>\n</ul>\n",
      "date_published": "2025-03-09T17:57:27.000Z",
      "date_modified": "2025-03-09T17:57:27.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/georgezouq/awesome-ai-in-finance/",
      "title": "Awesome Ai in Finance",
      "_slug": "georgezouq/awesome-ai-in-finance/",
      "_filepath": "/content/georgezouq/awesome-ai-in-finance/README.md",
      "url": "https://www.trackawesomelist.com/georgezouq/awesome-ai-in-finance/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Portfolio Management\n\n*   [skfolio (⭐1.6k)](https://github.com/skfolio/skfolio) - Python library for portfolio optimization built on top of scikit-learn.",
      "content_html": "<h3><p>Portfolio Management</p>\n</h3><ul>\n<li><a href=\"https://github.com/skfolio/skfolio\" rel=\"noopener noreferrer\">skfolio (⭐1.6k)</a> - Python library for portfolio optimization built on top of scikit-learn.</li>\n</ul>\n",
      "date_published": "2025-03-09T17:37:05.000Z",
      "date_modified": "2025-03-09T17:37:05.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/ripienaar/free-for-dev/",
      "title": "Free for Dev",
      "_slug": "ripienaar/free-for-dev/",
      "_filepath": "/content/ripienaar/free-for-dev/README.md",
      "url": "https://www.trackawesomelist.com/ripienaar/free-for-dev/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### APIs, Data, and ML\n\n*   [Financial Data](https://financialdata.net/) - Stock market and financial data API. Free plan allows 300 requests per day.",
      "content_html": "<h3><p>APIs, Data, and ML</p>\n</h3><ul>\n<li><a href=\"https://financialdata.net/\" rel=\"noopener noreferrer\">Financial Data</a> - Stock market and financial data API. Free plan allows 300 requests per day.</li>\n</ul>\n",
      "date_published": "2025-03-09T15:47:27.000Z",
      "date_modified": "2025-03-09T15:47:27.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/wilsonfreitas/awesome-quant/",
      "title": "Awesome Quant",
      "_slug": "wilsonfreitas/awesome-quant/",
      "_filepath": "/content/wilsonfreitas/awesome-quant/README.md",
      "url": "https://www.trackawesomelist.com/wilsonfreitas/awesome-quant/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Reproducing Works, Training & Books / Data Visualization\n\n*   [AFML (⭐725)](https://github.com/boyboi86/AFML) - All the answers for exercises from Advances in Financial Machine Learning by Dr Marco Lopez de Parodo.",
      "content_html": "<h3><p>Reproducing Works, Training &amp; Books / Data Visualization</p>\n</h3><ul>\n<li><a href=\"https://github.com/boyboi86/AFML\" rel=\"noopener noreferrer\">AFML (⭐725)</a> - All the answers for exercises from Advances in Financial Machine Learning by Dr Marco Lopez de Parodo.</li>\n</ul>\n",
      "date_published": "2025-03-09T14:26:17.000Z",
      "date_modified": "2025-03-09T14:26:17.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/stn1slv/awesome-integration/",
      "title": "Awesome Integration",
      "_slug": "stn1slv/awesome-integration/",
      "_filepath": "/content/stn1slv/awesome-integration/README.md",
      "url": "https://www.trackawesomelist.com/stn1slv/awesome-integration/",
      "summary": "18 awesome projects updated",
      "content_text": "\n\n### Projects / API Management\n\n*   [Akana API Management Platform](https://www.akana.com/products/api-platform) - Provides comprehensive lifecycle management, enabling rapid digital transformation and robust compliance across multi-cloud environments.\n*   [Amazon API Management](https://aws.amazon.com/api-gateway/api-management/) - Leverages AWS scalability and security to efficiently create, monitor, and manage APIs.\n*   [Anypoint Platform](https://www.mulesoft.com/platform/api/manager) - Combines API design, integration, and management into one unified platform, streamlining connectivity and development.\n*   [Amplify API Management Platform](https://www.axway.com/en/products/amplify-api-management-platform) - Offers an open, agile approach to API management with robust integration and flexible deployment options.\n*   [Apigee](https://cloud.google.com/apigee) - Delivers powerful analytics, security, and scalability for enterprise-grade API management from Google.\n*   [Azure API Management](https://azure.microsoft.com/en-us/services/api-management/) - A hybrid, multicloud solution that simplifies API lifecycle management with comprehensive security and analytics.\n*   [Boomi Cloud API Management](https://developer.mashery.com/) - A cloud-native platform enabling seamless API deployment and centralized management with strong integration capabilities.\n*   [DigitMarket API Manager](https://www.torryharris.com/products/digitmarket-api-manager-for-api-management) - Transforms APIs into strategic business tools through end-to-end lifecycle management and enhanced operational insights.\n*   [IBM API Connect](https://www.ibm.com/cloud/api-connect) - Provides a scalable, secure, and intuitive environment for creating, managing, and monetizing APIs across clouds.\n*   [IBM webMethods API Management](https://www.ibm.com/products/webmethods-api-management) - Offers a comprehensive suite for API lifecycle management that seamlessly integrates on-premises and cloud systems.\n*   [Kong Enterprise](https://konghq.com/products/kong-enterprise) - A cloud-native, enterprise-grade solution that enhances API connectivity, microservices orchestration, and security via a rich plugin architecture.\n*   [Layer7 API Management](https://www.broadcom.com/products/software/api-management) - Ensures secure and efficient API development with continuous lifecycle management and advanced integration features.\n*   [Red Hat 3scale API Management](https://www.redhat.com/en/technologies/jboss-middleware/3scale) - Simplifies API monetization and governance with a cloud-native approach and powerful scaling capabilities.\n*   [Sensedia API Management](https://www.sensedia.com/api-management-platform) - Provides a full-lifecycle API solution with advanced security, performance monitoring, and streamlined integration.\n*   [Tyk API Management](https://tyk.io/api-lifecycle-management/) - Delivers high-performance, open-source API management focused on flexibility, robust security, and scalability.\n*   [Zuplo API Management](https://zuplo.com) - A developer-centric, lightweight platform featuring GitOps integration, rapid edge deployment, extensive OpenAPI support, and seamless monetization.\n\n### Projects / API Documentation\n\n*   [Redoc (⭐24k) (⭐25k)](https://github.com/Redocly/redoc) - Delivers clean, modern documentation with advanced theming, multi-language support, and seamless integration.\n*   [Slate (⭐36k) (⭐36k)](https://github.com/slatedocs/slate) - Converts markdown into stylish, static API documentation with intuitive navigation and clear code examples.\n*   [SwaggerHub](https://swagger.io/tools/swaggerhub/) - An integrated API design and documentation hub that enhances team collaboration, version control, and automated testing.\n*   [Swagger UI (⭐27k) (⭐28k)](https://github.com/swagger-api/swagger-ui) - Offers an interactive, in-browser tool for visualizing and testing APIs directly from OpenAPI specifications.\n*   [SpectaQL (⭐1.1k) (⭐1.2k)](https://github.com/anvilco/spectaql) - Generates static, customizable documentation for GraphQL schemas, making complex API structures easy to understand.\n\n### Projects / API Gateway\n\n*   [Ambassador Edge Stack](https://www.getambassador.io/products/edge-stack/api-gateway/) - A Kubernetes-native API gateway designed for high-scale environments with flexible routing and advanced security features.\n*   [Spring Cloud Gateway (⭐4.6k) (⭐4.7k)](https://github.com/spring-cloud/spring-cloud-gateway) - Leverages the Spring ecosystem to deliver robust routing, filtering, and security for microservices.\n\n### Projects / API Testing\n\n*   API clients\n    *   [Advanced REST Client (⭐1.4k) (⭐1.4k)](https://github.com/advanced-rest-client/arc-electron) - A robust open-source API client for testing and debugging RESTful services with an intuitive interface.\n    *   [Bruno (⭐35k) (⭐36k)](https://github.com/usebruno/bruno) - A fast, offline API client designed for git-friendly workflows and seamless testing.\n    *   [curl (⭐38k) (⭐38k)](https://github.com/curl/curl) - A versatile command-line tool for data transfer across multiple protocols, essential for quick API testing.\n    *   [curlie (⭐3.3k) (⭐3.3k)](https://github.com/rs/curlie) - A modern, user-friendly frontend to curl that combines simplicity with powerful performance.\n    *   [HTTPie (⭐36k) (⭐36k)](https://github.com/httpie/httpie) - An intuitive CLI HTTP client that simplifies crafting API requests and inspecting responses.\n    *   [HttpMaster](https://www.httpmaster.net/) - Free and lightweight desktop tool for HTTP testing and debugging.\n    *   [Hoppscotch (⭐72k) (⭐73k)](https://github.com/hoppscotch/hoppscotch) - A lightweight, web-based API development tool offering real-time testing with an intuitive interface.\n    *   [Insomnia (⭐36k) (⭐37k)](https://github.com/Kong/insomnia) - A cross-platform client that streamlines API debugging and testing for both REST and GraphQL services.\n    *   [posting (⭐9.4k) (⭐9.4k)](https://github.com/darrenburns/posting) - A modern, terminal-based API client designed for efficient and seamless API interactions.\n    *   [Postman](https://www.postman.com/product/api-client/) - The industry-standard tool for API development and testing, featuring automation, mock servers, and collaborative documentation.\n    *   [resty (⭐2.6k) (⭐2.7k)](https://github.com/micha/resty) - A Lua-based HTTP client framework providing an interactive shell for streamlined REST service testing.\n    *   [SoapUI (⭐1.6k) (⭐1.6k)](https://github.com/SmartBear/soapui) - A comprehensive open-source solution for testing both SOAP and REST web services with extensive automation features.\n*   Testing tools and frameworks\n    *   [Apache JMeter (⭐8.8k) (⭐8.9k)](https://github.com/apache/jmeter) - A feature-rich tool for load testing and performance analysis across diverse web applications and services.\n    *   [Gatling (⭐6.7k) (⭐6.7k)](https://github.com/gatling/gatling) - A powerful load testing framework with a developer-friendly DSL that delivers detailed performance metrics.\n    *   [Grafana k6 (⭐28k) (⭐28k)](https://github.com/grafana/k6) - Open-source, JS-scriptable load-testing tool for CI/CD.\n    *   [Karate (⭐8.5k) (⭐8.6k)](https://github.com/karatelabs/karate) - A unified testing framework that merges API automation, mocking, and performance testing with simple, expressive syntax.\n    *   [Pyresttest (⭐1.1k) (⭐1.2k)](https://github.com/svanoort/pyresttest) - A Python-based testing tool offering easy YAML/JSON-driven REST API testing and microbenchmarking.\n    *   [REST Assured (⭐6.9k) (⭐7k)](https://github.com/rest-assured/rest-assured) - A Java DSL that simplifies REST API testing with intuitive syntax and seamless integration into CI pipelines.\n    *   [Schemathesis (⭐2.5k) (⭐2.6k)](https://github.com/schemathesis/schemathesis) - A Python library for property-based testing of API schemas, ensuring reliability through robust edge-case detection.\n    *   [Taurus (⭐2k) (⭐2.1k)](https://github.com/Blazemeter/taurus) - An open-source automation framework that simplifies continuous testing with intuitive configuration and integration support.\n\n### Projects / BRE\n\n*   [Easy Rules (⭐5k) (⭐5.1k)](https://github.com/j-easy/easy-rules) - Lightweight Java-based rules engine designed for straightforward rule processing and rapid decision automation.\n*   [FICO Blaze Advisor](https://www.fico.com/en/products/fico-blaze-advisor) - Enterprise-grade decision engine that empowers both business and technical users with an intuitive interface for fast rule creation and management.\n*   [IBM ODM](https://www.ibm.com/products/operational-decision-manager) - Scalable decision management system that streamlines rule authoring, testing, and updates while ensuring compliance and agility.\n*   [Progress Corticon](https://www.progress.com/corticon) - Model-driven BRMS enabling rapid, no-code rule creation that delivers high-performance automated decisions with guaranteed integrity.\n*   [Red Hat Decision Manager](https://access.redhat.com/products/red-hat-decision-manager) - Enterprise-class decision platform built on Drools, offering advanced DMN support, intuitive UIs, and high availability for large-scale automation.\n\n### Projects / BPM\n\n*   [Appian BPM Suite](https://appian.com/platform/complete-automation/business-process-management-bpm.html) - Low-code BPM platform that empowers both IT and citizen developers to quickly build process- and case-centric applications.\n*   [Genpack Cora SeQuence](https://www.genpact.com/cora/sequence) - Agile process orchestration tool that enhances business efficiency by seamlessly integrating and managing workflows.\n*   [IBM Business Automation Workflow](https://www.ibm.com/products/business-automation-workflow) - Integrated platform combining workflow automation and BPM to optimize operational processes and decision-making.\n*   [Oracle BPM Suite](https://www.oracle.com/middleware/technologies/bpm.html) - Comprehensive solution offering robust process modeling, workflow automation, and real-time analytics to drive operational excellence.\n*   [Pega Platform](https://www.pega.com/products/platform) - Advanced BPM and RPA platform featuring intelligent process automation and workforce analytics to streamline operations.\n*   [Red Hat Process Automation Manager](https://www.redhat.com/en/technologies/jboss-middleware/process-automation-manager) - Cloud-native platform that enables cross-functional teams to design, deploy, and manage automated business workflows with agility.\n*   [SAP Process Orchestration](https://www.sap.com/products/process-orchestration.html) - Robust BPM offering that combines process orchestration with application integration for end-to-end operational efficiency.\n*   [TIBCO BPM Enterprise](https://www.tibco.com/products/business-process-management) - Enterprise BPM solution delivering process automation, documentation, and predictive analytics to enhance performance and decision-making.\n\n### Projects / Data Mapping Solution\n\n*   [Altova MapForce](https://www.altova.com/mapforce) - Graphical data mapping solution that enables any-to-any conversion, reducing complexity and accelerating integration projects.\n\n### Projects / ESB\n\n*   [Anypoint Platform](https://www.mulesoft.com/platform/enterprise-integration) - Comprehensive integration solution that leverages robust ESB capabilities to connect and orchestrate disparate systems.\n*   [Apache ServiceMix](https://servicemix.apache.org/) - Versatile open-source integration container combining messaging, routing, and service mediation for flexible enterprise connectivity.\n*   [ArcESB](https://www.arcesb.com/integration/) - Flexible integration platform that synchronizes data across applications, streamlines partner connectivity, and enhances data accessibility.\n*   [IBM App Connect](https://www.ibm.com/cloud/app-connect) - Robust integration solution that connects diverse applications and protocols, ensuring seamless data flow across the enterprise.\n*   [IBM webMethods Integration](https://www.ibm.com/products/webmethods-integration) - Comprehensive platform that accelerates application integration and simplifies connectivity across heterogeneous systems.\n*   [NServiceBus (⭐2.1k) (⭐2.1k)](https://github.com/Particular/NServiceBus) - Developer-friendly, .NET-based service bus that simplifies messaging and orchestrates service integration efficiently.\n*   [Oracle Service Bus](https://www.oracle.com/middleware/technologies/service-bus.html) - Powerful ESB solution that virtualizes and manages service interactions to reduce integration complexity.\n*   [Oracle SOA Suite](https://www.oracle.com/middleware/technologies/soasuite.html) - Comprehensive SOA platform that orchestrates services into composite applications, driving efficient business process integration.\n*   [Red Hat Fuse](https://developers.redhat.com/products/fuse/overview) - Cloud-native integration platform that delivers distributed integration capabilities for agile, scalable connectivity.\n*   [TIBCO BusinessWorks](https://www.tibco.com/products/tibco-businessworks) - Enterprise-grade integration platform implementing proven hybrid integration patterns for reliable data exchange.\n*   [UltraESB](https://www.adroitlogic.com/products/ultraesb/) - High-performance ESB engineered for extreme throughput with zero-copy proxying and non-blocking IO techniques.\n\n### Projects / ETL\n\n*   [CloverDX](https://www.cloverdx.com/) - Enterprise ETL suite offering robust data transformation and workflow orchestration for scalable integration.\n*   [Hevo](https://hevodata.com/) - No-code, fully automated data pipeline platform that supports extensive integrations, simplifying complex data workflows.\n*   [IBM DataStage](https://www.ibm.com/products/datastage) - Robust platform that cleanses, transforms, and delivers reliable data, empowering businesses with trusted insights.\n*   [Informatica PowerCenter](https://www.informatica.com/products/data-integration/powercenter.html) - Enterprise-class solution that streamlines big data and cloud analytics through comprehensive data integration management.\n*   [Microsoft SSIS](https://docs.microsoft.com/en-us/sql/integration-services/sql-server-integration-services) - Proven data integration solution for building scalable ETL processes within enterprise environments using SQL Server.\n*   [Oracle Data Integrator](https://www.oracle.com/middleware/technologies/data-integrator.html) - Comprehensive platform that addresses batch loads, real-time processes, and SOA-enabled services for end-to-end data management.\n*   [SAS Data Management](https://www.sas.com/en_us/software/data-management.html) - Robust solution that transforms, integrates, and secures data to enhance quality and reliability across the enterprise.\n*   [Stitch](https://www.stitchdata.com/) - Developer-friendly SaaS ETL service that effortlessly extracts data from numerous sources into data warehouses for streamlined analytics.\n*   [Talend Data Integration](https://www.talend.com/products/integrate-data/) - Versatile platform that unifies disparate data sources into actionable insights to empower informed business decisions.\n\n### Projects / Integration Frameworks\n\n*   [Ballerina (⭐3.7k) (⭐3.8k)](https://github.com/ballerina-platform/ballerina-lang) - Innovative programming language designed for effortless creation and integration of network services and APIs.\n*   [Spring Integration (⭐1.5k) (⭐1.6k)](https://github.com/spring-projects/spring-integration) - Extension of the Spring ecosystem that provides out-of-the-box integration capabilities using proven Enterprise Integration Patterns.\n\n### Projects / iPaaS\n\n*   [Anypoint Platform](https://www.mulesoft.com/platform/saas/cloudhub-ipaas-cloud-based-integration) - Combines API management and integration into one platform, enabling seamless connectivity across diverse applications.\n*   [Boomi AtomSphere](https://boomi.com/platform) - Cloud-native, intelligent platform that connects systems effortlessly while automating integration processes.\n*   [Celigo Integration Platform](https://www.celigo.com/platform/) - User-friendly iPaaS with prebuilt templates for rapid SaaS-to-SaaS integrations and intuitive drag-and-drop design.\n*   [Jitterbit Harmony](https://www.jitterbit.com/platform/ipaas) - Comprehensive integration solution offering prebuilt workflows and automation templates to accelerate business processes.\n*   [IBM Cloud Integration](https://www.ibm.com/cloud/integration) - Next-generation platform leveraging AI to streamline integration, increase scalability, and speed up deployment.\n*   [IBM webMethods](https://www.ibm.com/products/webmethods) - All-in-one integration platform that unifies applications, simplifies processes, and boosts overall efficiency.\n*   [Informatica Intelligent Cloud Services](https://www.informatica.com/products/cloud-integration.html) - Suite of cloud data management tools that accelerates productivity and simplifies application and data integration.\n*   [OpenText Alloy](https://businessnetwork.opentext.com/enterprise-data-management/) - Enterprise data management solution that transforms basic integration into actionable insights and smarter decision-making.\n*   [Oracle Integration Cloud Service](https://www.oracle.com/integration/application-integration/) - Robust platform with prebuilt connectivity for both SaaS and on-premises apps, streamlining integration processes.\n*   [SAP Integration Suite](https://www.sap.com/products/technology-platform/integration-suite.html) - Cloud-native solution offering prebuilt adapters, API management, and event brokering for end-to-end connectivity.\n*   [SnapLogic Intelligent Integration Platform](https://www.snaplogic.com/products/intelligent-integration-platform) - AI-driven platform that connects applications and data rapidly, ensuring efficient and scalable integrations.\n*   [Tray.io](https://tray.ai/) - Low-code automation platform with a drag-and-drop interface, making it simple to build scalable integrations and workflows.\n*   [Workato](https://www.workato.com/) - Unified integration and workflow automation solution that simplifies complex processes and enhances operational efficiency.\n\n### Projects / MaaS\n\n*   [Amazon MQ](https://aws.amazon.com/amazon-mq) - Fully managed message broker supporting Apache ActiveMQ and RabbitMQ, ensuring reliable and secure messaging.\n*   [Amazon MSK](https://aws.amazon.com/msk) - Managed Apache Kafka service that simplifies cluster setup, scaling, and real-time data streaming.\n*   [Amazon SQS](https://aws.amazon.com/sqs) - Reliable, fully managed queuing service to decouple microservices and scale distributed applications seamlessly.\n*   [Amazon SNS](https://aws.amazon.com/sns) - Managed pub/sub messaging service that flexibly notifies subscribers and supports various delivery protocols.\n*   [Alibaba Cloud Message Queue for Apache Kafka](https://www.alibabacloud.com/product/kafka) - High-throughput Kafka service with seamless Alibaba Cloud integration for real-time data processing.\n*   [Alibaba Cloud Message Queue for RabbitMQ](https://www.alibabacloud.com/product/rabbitmq) - Scalable RabbitMQ solution offering low latency and high throughput for distributed messaging.\n*   [Alibaba Cloud Message Service](https://www.alibabacloud.com/product/message-service) - Distributed messaging service that ensures reliable data transfer between decoupled systems.\n*   [AlibabaMQ for Apache RocketMQ](https://www.alibabacloud.com/product/mq) - Robust message queue service supporting asynchronous communication with high availability and durability.\n*   [Anypoint MQ](https://www.mulesoft.com/platform/anypoint-mq-message-queue) - Enterprise-class messaging service integrated with Anypoint Platform for flexible and reliable message orchestration.\n*   [Azure Service Bus](https://azure.microsoft.com/en-us/services/service-bus/) - Cloud messaging solution that supports multiple patterns and protocols for robust enterprise integration.\n*   [CloudAMQP](https://www.cloudamqp.com/) - Managed RabbitMQ service featuring an intuitive web console, advanced analytics, and seamless scalability.\n*   [Confluent Cloud](https://www.confluent.io/confluent-cloud/) - Fully managed Kafka service offering enterprise features like schema registry, connectors, and governance.\n*   [Google Cloud Managed Service for Apache Kafka](https://cloud.google.com/products/managed-service-for-apache-kafka) - Simplifies Kafka deployment and management on Google Cloud for real-time streaming applications.\n*   [Google Cloud Pub/Sub](https://cloud.google.com/pubsub) - High-throughput messaging service that supports event-driven architectures with flexible delivery models.\n*   [Huawei Cloud Distributed Message Service](https://www.huaweicloud.com/intl/en-us/product/dms.html) - Fully managed messaging service that ensures secure, scalable, and reliable communication between applications.\n*   [Huawei Cloud Distributed Message Service for Kafka](https://www.huaweicloud.com/intl/en-us/product/dmskafka.html) - Managed Kafka solution that simplifies scaling and management while delivering high performance and security.\n*   [IBM MQ on Cloud](https://www.ibm.com/cloud/mq) - Enterprise messaging service that offers secure, reliable data transfer across applications in a cloud environment.\n*   [IronMQ](https://www.iron.io/mq) - Elastic, cloud-native message queue designed for scalable and reliable processing of high-volume messages.\n*   [Oracle Cloud Streaming](https://www.oracle.com/cloud/cloud-native/streaming/) - Serverless, real-time event streaming platform with Apache Kafka compatibility for efficient data processing.\n*   [Solace PubSub+ Cloud](https://solace.com/products/platform/cloud/) - Integrated event streaming platform providing full visibility and control over your data pipelines.\n*   [Yandex Message Queue](https://cloud.yandex.com/en/services/message-queue) - Cloud messaging service compatible with Amazon SQS API for easy integration with existing systems.\n*   [Yandex Managed Service for Apache Kafka](https://cloud.yandex.com/en/services/managed-kafka) - Fully managed Kafka service with automated scaling, monitoring, and maintenance for hassle-free streaming.\n\n### Projects / MFT\n\n*   [ArcESB Managed File Transfer](https://www.arcesb.com/mft/) - Enterprise-grade MFT solution with an intuitive interface and powerful automation for streamlined file exchanges.\n*   [Axway Managed File Transfer](https://www.axway.com/en/products/managed-file-transfer) - Robust platform offering advanced security and efficient, reliable data transfer across enterprise systems.\n*   [GoAnywhere MFT](https://www.goanywhere.com/products/goanywhere-mft) - Comprehensive solution delivering centralized, secure file transfers with automation and complete audit logging.\n*   [GlobalSCAPE EFT](https://www.globalscape.com/eft) - Hardened file transfer server that ensures end-to-end encryption, automation, and compliance for mission-critical data.\n*   [IBM Sterling Secure File Transfer](https://www.ibm.com/products/secure-file-transfer) - Scalable and high-performance MFT platform designed for secure, fast, and reliable file exchange.\n*   [IBM webMethods MFT](https://www.ibm.com/products/webmethods-mft) - Integrated managed file transfer solution that supports flexible deployment across hybrid environments.\n*   [Oracle Managed File Transfer](https://www.oracle.com/middleware/technologies/mft/managed-file-transfer.html) - Comprehensive platform that simplifies secure file exchange and management for enterprise operations.\n*   [Progress MOVEit](https://www.progress.com/moveit) - Secure, automated file transfer solution with guaranteed delivery, encryption, and compliance tools for regulated industries.\n*   [TIBCO Managed File Transfer](https://www.tibco.com/products/tibco-managed-file-transfer) - Centralized MFT platform with robust automation and security features designed to support diverse file transfer scenarios.\n*   [Titan MFT Server](https://southrivertech.com/titan-mft-server/) - Enterprise-level MFT server offering high availability, failover capabilities, and efficient large-scale file automation.\n\n### Projects / MDM\n\n*   [IBM InfoSphere Master Data Management](https://www.ibm.com/products/ibm-infosphere-master-data-management) - Comprehensive platform that centralizes data governance, ensuring consistency and accuracy across your enterprise.\n*   [Informatica Multidomain MDM](https://www.informatica.com/products/master-data-management/multidomain-mdm.html) - Integrated solution for managing and governing master data across all domains, enhancing overall data quality.\n*   [Oracle Enterprise Data Management](https://www.oracle.com/performance-management/enterprise-data-management/) - Robust tool that centralizes master data to support faster, more effective decision-making and operational agility.\n*   [Reltio](https://www.reltio.com/products/multidomain-mdm) - Cloud-native, multi-domain MDM platform combining data quality, governance, and real-time analytics for a 360° view.\n*   [SAP Master Data Governance](https://www.sap.com/products/master-data-governance.html) - Centralized solution that consolidates and governs master data to ensure consistency and high quality.\n*   [SAS MDM](https://support.sas.com/en/software/mdm-support.html) - Unified platform that integrates data from diverse sources into accurate master records for improved efficiency.\n*   [Stibo MDM](https://www.stibosystems.com/platform) - Proven multi-domain MDM solution focusing on data transparency and governance to provide a single source of truth.\n*   [Teradata MDM](https://www.teradata.co.uk/Products/Applications/Master-Data-Management) - Establishes a consistent analytical foundation by maintaining accurate reference data for enhanced ROI.\n\n### Projects / Messaging\n\n*   [Apache ActiveMQ (⭐2.3k) (⭐2.4k)](https://github.com/apache/activemq) - Open-source broker that implements JMS, enabling seamless conversion between synchronous and asynchronous messaging.\n*   [Apache Pulsar (⭐14k) (⭐15k)](https://github.com/apache/pulsar) - Versatile pub/sub and streaming platform offering scalable, low-latency messaging for modern applications.\n*   [Apache RocketMQ (⭐21k) (⭐22k)](https://github.com/apache/rocketmq) - High-performance distributed messaging platform engineered for low latency and high throughput.\n*   [BlazingMQ (⭐2.6k) (⭐2.7k)](https://github.com/bloomberg/blazingmq) - Distributed message queuing system focused on efficiency and reliability for modern workflow needs.\n*   [IBM MQ](https://www.ibm.com/products/mq) - Enterprise-grade messaging solution providing robust features, high availability, and multi-protocol support.\n*   [KubeMQ](https://kubemq.io/) - Kubernetes-native message broker and queue system designed for scalability, high availability, and seamless cloud integration.\n*   [Oracle AQ](https://www.oracle.com/database/technologies/advanced-queuing.html) - Integrated messaging solution within Oracle databases, offering reliable and efficient message delivery.\n*   [RabbitMQ (⭐12k) (⭐13k)](https://github.com/rabbitmq/rabbitmq-server) - Popular open-source broker implementing AMQP, known for reliability, clustering, and ease-of-use.\n*   [Redpanda (⭐10k) (⭐11k)](https://github.com/vectorizedio/redpanda) - Kafka-compatible streaming platform that eliminates Zookeeper, delivering high performance and low latency.\n*   [Red Hat AMQ](https://www.redhat.com/en/technologies/jboss-middleware/amq) - Enterprise messaging platform based on open-source technologies, offering scalable and reliable message delivery.\n*   [TIBCO Enterprise Message Service](https://www.tibco.com/products/tibco-enterprise-message-service) - Standards-based JMS implementation that enables efficient and robust exchange of messages between applications.\n\n### Projects / RPA\n\n*   [Automation Anywhere](https://www.automationanywhere.com/) - Intelligent automation ecosystem that streamlines business processes and reduces errors through advanced RPA capabilities.\n*   [Blue Prism](https://www.blueprism.com/products/intelligent-rpa-automation/) - No-code platform delivering robust, scalable automation to minimize manual tasks and boost productivity.\n*   [Tungsten RPA](https://www.tungstenautomation.com/products/rpa) - AI-powered, no-code automation solution that enhances accuracy, efficiency, and compliance across workflows.\n*   [UiPath](https://www.uipath.com/product) - Comprehensive RPA platform that automates routine tasks, enabling scalable digital transformation across enterprises.\n*   [WorkFusion](https://www.workfusion.com/platform/) - Enterprise automation solution that combines RPA with intelligent automation to streamline complex workflows.\n\n### Projects / Self-Service Integration\n\n*   [IFTTT](https://ifttt.com/) - Easy-to-use platform that connects web services with simple conditional statements, empowering custom workflow creation.\n*   [Make (Integromat)](https://www.make.com) - Low-code automation tool with a visual interface, advanced data transformation, and modular workflow execution.\n*   [Microsoft Power Automate](https://powerautomate.microsoft.com) - Cloud-based service with an intuitive interface for creating automated workflows that seamlessly integrate diverse apps.\n*   [Oracle Self-Service Integration](https://docs.oracle.com/en/cloud/paas/self-service-integration-cloud/index.html) - Streamlined tool that automates tasks between cloud applications, making integration accessible for non-developers.\n*   [Zapier](https://zapier.com/) - Intuitive platform that connects hundreds of web services to create efficient, code-free automations.\n\n### Projects / Workflow engine\n\n*   [Activiti (⭐10k) (⭐10k)](https://github.com/Activiti/Activiti) - Lightweight, Java-centric BPMN engine that efficiently executes business workflows with a focus on simplicity.\n*   [Argo Workflows (⭐15k) (⭐16k)](https://github.com/argoproj/argo-workflows) - Container-native workflow engine designed for orchestrating parallel jobs in Kubernetes-based, cloud-native environments.\n*   [Conductor (⭐12k) (⭐13k)](https://github.com/Netflix/conductor) - Cloud-based orchestration engine that manages microservices workflows, streamlining complex process automation.\n*   [jBPM (⭐1.6k) (⭐1.7k)](https://github.com/kiegroup/jbpm) - Comprehensive toolkit for automating business processes and decisions with robust workflow management capabilities.",
      "content_html": "<h3><p>Projects / API Management</p>\n</h3><ul>\n<li><a href=\"https://www.akana.com/products/api-platform\" rel=\"noopener noreferrer\">Akana API Management Platform</a> - Provides comprehensive lifecycle management, enabling rapid digital transformation and robust compliance across multi-cloud environments.</li>\n</ul>\n<ul>\n<li><a href=\"https://aws.amazon.com/api-gateway/api-management/\" rel=\"noopener noreferrer\">Amazon API Management</a> - Leverages AWS scalability and security to efficiently create, monitor, and manage APIs.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.mulesoft.com/platform/api/manager\" rel=\"noopener noreferrer\">Anypoint Platform</a> - Combines API design, integration, and management into one unified platform, streamlining connectivity and development.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.axway.com/en/products/amplify-api-management-platform\" rel=\"noopener noreferrer\">Amplify API Management Platform</a> - Offers an open, agile approach to API management with robust integration and flexible deployment options.</li>\n</ul>\n<ul>\n<li><a href=\"https://cloud.google.com/apigee\" rel=\"noopener noreferrer\">Apigee</a> - Delivers powerful analytics, security, and scalability for enterprise-grade API management from Google.</li>\n</ul>\n<ul>\n<li><a href=\"https://azure.microsoft.com/en-us/services/api-management/\" rel=\"noopener noreferrer\">Azure API Management</a> - A hybrid, multicloud solution that simplifies API lifecycle management with comprehensive security and analytics.</li>\n</ul>\n<ul>\n<li><a href=\"https://developer.mashery.com/\" rel=\"noopener noreferrer\">Boomi Cloud API Management</a> - A cloud-native platform enabling seamless API deployment and centralized management with strong integration capabilities.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.torryharris.com/products/digitmarket-api-manager-for-api-management\" rel=\"noopener noreferrer\">DigitMarket API Manager</a> - Transforms APIs into strategic business tools through end-to-end lifecycle management and enhanced operational insights.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/cloud/api-connect\" rel=\"noopener noreferrer\">IBM API Connect</a> - Provides a scalable, secure, and intuitive environment for creating, managing, and monetizing APIs across clouds.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/products/webmethods-api-management\" rel=\"noopener noreferrer\">IBM webMethods API Management</a> - Offers a comprehensive suite for API lifecycle management that seamlessly integrates on-premises and cloud systems.</li>\n</ul>\n<ul>\n<li><a href=\"https://konghq.com/products/kong-enterprise\" rel=\"noopener noreferrer\">Kong Enterprise</a> - A cloud-native, enterprise-grade solution that enhances API connectivity, microservices orchestration, and security via a rich plugin architecture.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.broadcom.com/products/software/api-management\" rel=\"noopener noreferrer\">Layer7 API Management</a> - Ensures secure and efficient API development with continuous lifecycle management and advanced integration features.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.redhat.com/en/technologies/jboss-middleware/3scale\" rel=\"noopener noreferrer\">Red Hat 3scale API Management</a> - Simplifies API monetization and governance with a cloud-native approach and powerful scaling capabilities.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.sensedia.com/api-management-platform\" rel=\"noopener noreferrer\">Sensedia API Management</a> - Provides a full-lifecycle API solution with advanced security, performance monitoring, and streamlined integration.</li>\n</ul>\n<ul>\n<li><a href=\"https://tyk.io/api-lifecycle-management/\" rel=\"noopener noreferrer\">Tyk API Management</a> - Delivers high-performance, open-source API management focused on flexibility, robust security, and scalability.</li>\n</ul>\n<ul>\n<li><a href=\"https://zuplo.com\" rel=\"noopener noreferrer\">Zuplo API Management</a> - A developer-centric, lightweight platform featuring GitOps integration, rapid edge deployment, extensive OpenAPI support, and seamless monetization.</li>\n</ul>\n<h3><p>Projects / API Documentation</p>\n</h3><ul>\n<li><a href=\"https://github.com/Redocly/redoc\" rel=\"noopener noreferrer\">Redoc (⭐24k) (⭐25k)</a> - Delivers clean, modern documentation with advanced theming, multi-language support, and seamless integration.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/slatedocs/slate\" rel=\"noopener noreferrer\">Slate (⭐36k) (⭐36k)</a> - Converts markdown into stylish, static API documentation with intuitive navigation and clear code examples.</li>\n</ul>\n<ul>\n<li><a href=\"https://swagger.io/tools/swaggerhub/\" rel=\"noopener noreferrer\">SwaggerHub</a> - An integrated API design and documentation hub that enhances team collaboration, version control, and automated testing.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/swagger-api/swagger-ui\" rel=\"noopener noreferrer\">Swagger UI (⭐27k) (⭐28k)</a> - Offers an interactive, in-browser tool for visualizing and testing APIs directly from OpenAPI specifications.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/anvilco/spectaql\" rel=\"noopener noreferrer\">SpectaQL (⭐1.1k) (⭐1.2k)</a> - Generates static, customizable documentation for GraphQL schemas, making complex API structures easy to understand.</li>\n</ul>\n<h3><p>Projects / API Gateway</p>\n</h3><ul>\n<li><a href=\"https://www.getambassador.io/products/edge-stack/api-gateway/\" rel=\"noopener noreferrer\">Ambassador Edge Stack</a> - A Kubernetes-native API gateway designed for high-scale environments with flexible routing and advanced security features.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/spring-cloud/spring-cloud-gateway\" rel=\"noopener noreferrer\">Spring Cloud Gateway (⭐4.6k) (⭐4.7k)</a> - Leverages the Spring ecosystem to deliver robust routing, filtering, and security for microservices.</li>\n</ul>\n<h3><p>Projects / API Testing</p>\n</h3><ul>\n<li>API clients<ul>\n<li><a href=\"https://github.com/advanced-rest-client/arc-electron\" rel=\"noopener noreferrer\">Advanced REST Client (⭐1.4k) (⭐1.4k)</a> - A robust open-source API client for testing and debugging RESTful services with an intuitive interface.</li>\n<li><a href=\"https://github.com/usebruno/bruno\" rel=\"noopener noreferrer\">Bruno (⭐35k) (⭐36k)</a> - A fast, offline API client designed for git-friendly workflows and seamless testing.</li>\n<li><a href=\"https://github.com/curl/curl\" rel=\"noopener noreferrer\">curl (⭐38k) (⭐38k)</a> - A versatile command-line tool for data transfer across multiple protocols, essential for quick API testing.</li>\n<li><a href=\"https://github.com/rs/curlie\" rel=\"noopener noreferrer\">curlie (⭐3.3k) (⭐3.3k)</a> - A modern, user-friendly frontend to curl that combines simplicity with powerful performance.</li>\n<li><a href=\"https://github.com/httpie/httpie\" rel=\"noopener noreferrer\">HTTPie (⭐36k) (⭐36k)</a> - An intuitive CLI HTTP client that simplifies crafting API requests and inspecting responses.</li>\n<li><a href=\"https://www.httpmaster.net/\" rel=\"noopener noreferrer\">HttpMaster</a> - Free and lightweight desktop tool for HTTP testing and debugging.</li>\n<li><a href=\"https://github.com/hoppscotch/hoppscotch\" rel=\"noopener noreferrer\">Hoppscotch (⭐72k) (⭐73k)</a> - A lightweight, web-based API development tool offering real-time testing with an intuitive interface.</li>\n<li><a href=\"https://github.com/Kong/insomnia\" rel=\"noopener noreferrer\">Insomnia (⭐36k) (⭐37k)</a> - A cross-platform client that streamlines API debugging and testing for both REST and GraphQL services.</li>\n<li><a href=\"https://github.com/darrenburns/posting\" rel=\"noopener noreferrer\">posting (⭐9.4k) (⭐9.4k)</a> - A modern, terminal-based API client designed for efficient and seamless API interactions.</li>\n<li><a href=\"https://www.postman.com/product/api-client/\" rel=\"noopener noreferrer\">Postman</a> - The industry-standard tool for API development and testing, featuring automation, mock servers, and collaborative documentation.</li>\n<li><a href=\"https://github.com/micha/resty\" rel=\"noopener noreferrer\">resty (⭐2.6k) (⭐2.7k)</a> - A Lua-based HTTP client framework providing an interactive shell for streamlined REST service testing.</li>\n<li><a href=\"https://github.com/SmartBear/soapui\" rel=\"noopener noreferrer\">SoapUI (⭐1.6k) (⭐1.6k)</a> - A comprehensive open-source solution for testing both SOAP and REST web services with extensive automation features.</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>Testing tools and frameworks<ul>\n<li><a href=\"https://github.com/apache/jmeter\" rel=\"noopener noreferrer\">Apache JMeter (⭐8.8k) (⭐8.9k)</a> - A feature-rich tool for load testing and performance analysis across diverse web applications and services.</li>\n<li><a href=\"https://github.com/gatling/gatling\" rel=\"noopener noreferrer\">Gatling (⭐6.7k) (⭐6.7k)</a> - A powerful load testing framework with a developer-friendly DSL that delivers detailed performance metrics.</li>\n<li><a href=\"https://github.com/grafana/k6\" rel=\"noopener noreferrer\">Grafana k6 (⭐28k) (⭐28k)</a> - Open-source, JS-scriptable load-testing tool for CI/CD.</li>\n<li><a href=\"https://github.com/karatelabs/karate\" rel=\"noopener noreferrer\">Karate (⭐8.5k) (⭐8.6k)</a> - A unified testing framework that merges API automation, mocking, and performance testing with simple, expressive syntax.</li>\n<li><a href=\"https://github.com/svanoort/pyresttest\" rel=\"noopener noreferrer\">Pyresttest (⭐1.1k) (⭐1.2k)</a> - A Python-based testing tool offering easy YAML/JSON-driven REST API testing and microbenchmarking.</li>\n<li><a href=\"https://github.com/rest-assured/rest-assured\" rel=\"noopener noreferrer\">REST Assured (⭐6.9k) (⭐7k)</a> - A Java DSL that simplifies REST API testing with intuitive syntax and seamless integration into CI pipelines.</li>\n<li><a href=\"https://github.com/schemathesis/schemathesis\" rel=\"noopener noreferrer\">Schemathesis (⭐2.5k) (⭐2.6k)</a> - A Python library for property-based testing of API schemas, ensuring reliability through robust edge-case detection.</li>\n<li><a href=\"https://github.com/Blazemeter/taurus\" rel=\"noopener noreferrer\">Taurus (⭐2k) (⭐2.1k)</a> - An open-source automation framework that simplifies continuous testing with intuitive configuration and integration support.</li>\n</ul>\n</li>\n</ul>\n<h3><p>Projects / BRE</p>\n</h3><ul>\n<li><a href=\"https://github.com/j-easy/easy-rules\" rel=\"noopener noreferrer\">Easy Rules (⭐5k) (⭐5.1k)</a> - Lightweight Java-based rules engine designed for straightforward rule processing and rapid decision automation.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.fico.com/en/products/fico-blaze-advisor\" rel=\"noopener noreferrer\">FICO Blaze Advisor</a> - Enterprise-grade decision engine that empowers both business and technical users with an intuitive interface for fast rule creation and management.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/products/operational-decision-manager\" rel=\"noopener noreferrer\">IBM ODM</a> - Scalable decision management system that streamlines rule authoring, testing, and updates while ensuring compliance and agility.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.progress.com/corticon\" rel=\"noopener noreferrer\">Progress Corticon</a> - Model-driven BRMS enabling rapid, no-code rule creation that delivers high-performance automated decisions with guaranteed integrity.</li>\n</ul>\n<ul>\n<li><a href=\"https://access.redhat.com/products/red-hat-decision-manager\" rel=\"noopener noreferrer\">Red Hat Decision Manager</a> - Enterprise-class decision platform built on Drools, offering advanced DMN support, intuitive UIs, and high availability for large-scale automation.</li>\n</ul>\n<h3><p>Projects / BPM</p>\n</h3><ul>\n<li><a href=\"https://appian.com/platform/complete-automation/business-process-management-bpm.html\" rel=\"noopener noreferrer\">Appian BPM Suite</a> - Low-code BPM platform that empowers both IT and citizen developers to quickly build process- and case-centric applications.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.genpact.com/cora/sequence\" rel=\"noopener noreferrer\">Genpack Cora SeQuence</a> - Agile process orchestration tool that enhances business efficiency by seamlessly integrating and managing workflows.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/products/business-automation-workflow\" rel=\"noopener noreferrer\">IBM Business Automation Workflow</a> - Integrated platform combining workflow automation and BPM to optimize operational processes and decision-making.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.oracle.com/middleware/technologies/bpm.html\" rel=\"noopener noreferrer\">Oracle BPM Suite</a> - Comprehensive solution offering robust process modeling, workflow automation, and real-time analytics to drive operational excellence.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.pega.com/products/platform\" rel=\"noopener noreferrer\">Pega Platform</a> - Advanced BPM and RPA platform featuring intelligent process automation and workforce analytics to streamline operations.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.redhat.com/en/technologies/jboss-middleware/process-automation-manager\" rel=\"noopener noreferrer\">Red Hat Process Automation Manager</a> - Cloud-native platform that enables cross-functional teams to design, deploy, and manage automated business workflows with agility.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.sap.com/products/process-orchestration.html\" rel=\"noopener noreferrer\">SAP Process Orchestration</a> - Robust BPM offering that combines process orchestration with application integration for end-to-end operational efficiency.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.tibco.com/products/business-process-management\" rel=\"noopener noreferrer\">TIBCO BPM Enterprise</a> - Enterprise BPM solution delivering process automation, documentation, and predictive analytics to enhance performance and decision-making.</li>\n</ul>\n<h3><p>Projects / Data Mapping Solution</p>\n</h3><ul>\n<li><a href=\"https://www.altova.com/mapforce\" rel=\"noopener noreferrer\">Altova MapForce</a> - Graphical data mapping solution that enables any-to-any conversion, reducing complexity and accelerating integration projects.</li>\n</ul>\n<h3><p>Projects / ESB</p>\n</h3><ul>\n<li><a href=\"https://www.mulesoft.com/platform/enterprise-integration\" rel=\"noopener noreferrer\">Anypoint Platform</a> - Comprehensive integration solution that leverages robust ESB capabilities to connect and orchestrate disparate systems.</li>\n</ul>\n<ul>\n<li><a href=\"https://servicemix.apache.org/\" rel=\"noopener noreferrer\">Apache ServiceMix</a> - Versatile open-source integration container combining messaging, routing, and service mediation for flexible enterprise connectivity.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.arcesb.com/integration/\" rel=\"noopener noreferrer\">ArcESB</a> - Flexible integration platform that synchronizes data across applications, streamlines partner connectivity, and enhances data accessibility.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/cloud/app-connect\" rel=\"noopener noreferrer\">IBM App Connect</a> - Robust integration solution that connects diverse applications and protocols, ensuring seamless data flow across the enterprise.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/products/webmethods-integration\" rel=\"noopener noreferrer\">IBM webMethods Integration</a> - Comprehensive platform that accelerates application integration and simplifies connectivity across heterogeneous systems.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/Particular/NServiceBus\" rel=\"noopener noreferrer\">NServiceBus (⭐2.1k) (⭐2.1k)</a> - Developer-friendly, .NET-based service bus that simplifies messaging and orchestrates service integration efficiently.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.oracle.com/middleware/technologies/service-bus.html\" rel=\"noopener noreferrer\">Oracle Service Bus</a> - Powerful ESB solution that virtualizes and manages service interactions to reduce integration complexity.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.oracle.com/middleware/technologies/soasuite.html\" rel=\"noopener noreferrer\">Oracle SOA Suite</a> - Comprehensive SOA platform that orchestrates services into composite applications, driving efficient business process integration.</li>\n</ul>\n<ul>\n<li><a href=\"https://developers.redhat.com/products/fuse/overview\" rel=\"noopener noreferrer\">Red Hat Fuse</a> - Cloud-native integration platform that delivers distributed integration capabilities for agile, scalable connectivity.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.tibco.com/products/tibco-businessworks\" rel=\"noopener noreferrer\">TIBCO BusinessWorks</a> - Enterprise-grade integration platform implementing proven hybrid integration patterns for reliable data exchange.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.adroitlogic.com/products/ultraesb/\" rel=\"noopener noreferrer\">UltraESB</a> - High-performance ESB engineered for extreme throughput with zero-copy proxying and non-blocking IO techniques.</li>\n</ul>\n<h3><p>Projects / ETL</p>\n</h3><ul>\n<li><a href=\"https://www.cloverdx.com/\" rel=\"noopener noreferrer\">CloverDX</a> - Enterprise ETL suite offering robust data transformation and workflow orchestration for scalable integration.</li>\n</ul>\n<ul>\n<li><a href=\"https://hevodata.com/\" rel=\"noopener noreferrer\">Hevo</a> - No-code, fully automated data pipeline platform that supports extensive integrations, simplifying complex data workflows.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/products/datastage\" rel=\"noopener noreferrer\">IBM DataStage</a> - Robust platform that cleanses, transforms, and delivers reliable data, empowering businesses with trusted insights.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.informatica.com/products/data-integration/powercenter.html\" rel=\"noopener noreferrer\">Informatica PowerCenter</a> - Enterprise-class solution that streamlines big data and cloud analytics through comprehensive data integration management.</li>\n</ul>\n<ul>\n<li><a href=\"https://docs.microsoft.com/en-us/sql/integration-services/sql-server-integration-services\" rel=\"noopener noreferrer\">Microsoft SSIS</a> - Proven data integration solution for building scalable ETL processes within enterprise environments using SQL Server.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.oracle.com/middleware/technologies/data-integrator.html\" rel=\"noopener noreferrer\">Oracle Data Integrator</a> - Comprehensive platform that addresses batch loads, real-time processes, and SOA-enabled services for end-to-end data management.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.sas.com/en_us/software/data-management.html\" rel=\"noopener noreferrer\">SAS Data Management</a> - Robust solution that transforms, integrates, and secures data to enhance quality and reliability across the enterprise.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.stitchdata.com/\" rel=\"noopener noreferrer\">Stitch</a> - Developer-friendly SaaS ETL service that effortlessly extracts data from numerous sources into data warehouses for streamlined analytics.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.talend.com/products/integrate-data/\" rel=\"noopener noreferrer\">Talend Data Integration</a> - Versatile platform that unifies disparate data sources into actionable insights to empower informed business decisions.</li>\n</ul>\n<h3><p>Projects / Integration Frameworks</p>\n</h3><ul>\n<li><a href=\"https://github.com/ballerina-platform/ballerina-lang\" rel=\"noopener noreferrer\">Ballerina (⭐3.7k) (⭐3.8k)</a> - Innovative programming language designed for effortless creation and integration of network services and APIs.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/spring-projects/spring-integration\" rel=\"noopener noreferrer\">Spring Integration (⭐1.5k) (⭐1.6k)</a> - Extension of the Spring ecosystem that provides out-of-the-box integration capabilities using proven Enterprise Integration Patterns.</li>\n</ul>\n<h3><p>Projects / iPaaS</p>\n</h3><ul>\n<li><a href=\"https://www.mulesoft.com/platform/saas/cloudhub-ipaas-cloud-based-integration\" rel=\"noopener noreferrer\">Anypoint Platform</a> - Combines API management and integration into one platform, enabling seamless connectivity across diverse applications.</li>\n</ul>\n<ul>\n<li><a href=\"https://boomi.com/platform\" rel=\"noopener noreferrer\">Boomi AtomSphere</a> - Cloud-native, intelligent platform that connects systems effortlessly while automating integration processes.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.celigo.com/platform/\" rel=\"noopener noreferrer\">Celigo Integration Platform</a> - User-friendly iPaaS with prebuilt templates for rapid SaaS-to-SaaS integrations and intuitive drag-and-drop design.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.jitterbit.com/platform/ipaas\" rel=\"noopener noreferrer\">Jitterbit Harmony</a> - Comprehensive integration solution offering prebuilt workflows and automation templates to accelerate business processes.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/cloud/integration\" rel=\"noopener noreferrer\">IBM Cloud Integration</a> - Next-generation platform leveraging AI to streamline integration, increase scalability, and speed up deployment.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/products/webmethods\" rel=\"noopener noreferrer\">IBM webMethods</a> - All-in-one integration platform that unifies applications, simplifies processes, and boosts overall efficiency.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.informatica.com/products/cloud-integration.html\" rel=\"noopener noreferrer\">Informatica Intelligent Cloud Services</a> - Suite of cloud data management tools that accelerates productivity and simplifies application and data integration.</li>\n</ul>\n<ul>\n<li><a href=\"https://businessnetwork.opentext.com/enterprise-data-management/\" rel=\"noopener noreferrer\">OpenText Alloy</a> - Enterprise data management solution that transforms basic integration into actionable insights and smarter decision-making.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.oracle.com/integration/application-integration/\" rel=\"noopener noreferrer\">Oracle Integration Cloud Service</a> - Robust platform with prebuilt connectivity for both SaaS and on-premises apps, streamlining integration processes.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.sap.com/products/technology-platform/integration-suite.html\" rel=\"noopener noreferrer\">SAP Integration Suite</a> - Cloud-native solution offering prebuilt adapters, API management, and event brokering for end-to-end connectivity.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.snaplogic.com/products/intelligent-integration-platform\" rel=\"noopener noreferrer\">SnapLogic Intelligent Integration Platform</a> - AI-driven platform that connects applications and data rapidly, ensuring efficient and scalable integrations.</li>\n</ul>\n<ul>\n<li><a href=\"https://tray.ai/\" rel=\"noopener noreferrer\">Tray.io</a> - Low-code automation platform with a drag-and-drop interface, making it simple to build scalable integrations and workflows.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.workato.com/\" rel=\"noopener noreferrer\">Workato</a> - Unified integration and workflow automation solution that simplifies complex processes and enhances operational efficiency.</li>\n</ul>\n<h3><p>Projects / MaaS</p>\n</h3><ul>\n<li><a href=\"https://aws.amazon.com/amazon-mq\" rel=\"noopener noreferrer\">Amazon MQ</a> - Fully managed message broker supporting Apache ActiveMQ and RabbitMQ, ensuring reliable and secure messaging.</li>\n</ul>\n<ul>\n<li><a href=\"https://aws.amazon.com/msk\" rel=\"noopener noreferrer\">Amazon MSK</a> - Managed Apache Kafka service that simplifies cluster setup, scaling, and real-time data streaming.</li>\n</ul>\n<ul>\n<li><a href=\"https://aws.amazon.com/sqs\" rel=\"noopener noreferrer\">Amazon SQS</a> - Reliable, fully managed queuing service to decouple microservices and scale distributed applications seamlessly.</li>\n</ul>\n<ul>\n<li><a href=\"https://aws.amazon.com/sns\" rel=\"noopener noreferrer\">Amazon SNS</a> - Managed pub/sub messaging service that flexibly notifies subscribers and supports various delivery protocols.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.alibabacloud.com/product/kafka\" rel=\"noopener noreferrer\">Alibaba Cloud Message Queue for Apache Kafka</a> - High-throughput Kafka service with seamless Alibaba Cloud integration for real-time data processing.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.alibabacloud.com/product/rabbitmq\" rel=\"noopener noreferrer\">Alibaba Cloud Message Queue for RabbitMQ</a> - Scalable RabbitMQ solution offering low latency and high throughput for distributed messaging.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.alibabacloud.com/product/message-service\" rel=\"noopener noreferrer\">Alibaba Cloud Message Service</a> - Distributed messaging service that ensures reliable data transfer between decoupled systems.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.alibabacloud.com/product/mq\" rel=\"noopener noreferrer\">AlibabaMQ for Apache RocketMQ</a> - Robust message queue service supporting asynchronous communication with high availability and durability.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.mulesoft.com/platform/anypoint-mq-message-queue\" rel=\"noopener noreferrer\">Anypoint MQ</a> - Enterprise-class messaging service integrated with Anypoint Platform for flexible and reliable message orchestration.</li>\n</ul>\n<ul>\n<li><a href=\"https://azure.microsoft.com/en-us/services/service-bus/\" rel=\"noopener noreferrer\">Azure Service Bus</a> - Cloud messaging solution that supports multiple patterns and protocols for robust enterprise integration.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.cloudamqp.com/\" rel=\"noopener noreferrer\">CloudAMQP</a> - Managed RabbitMQ service featuring an intuitive web console, advanced analytics, and seamless scalability.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.confluent.io/confluent-cloud/\" rel=\"noopener noreferrer\">Confluent Cloud</a> - Fully managed Kafka service offering enterprise features like schema registry, connectors, and governance.</li>\n</ul>\n<ul>\n<li><a href=\"https://cloud.google.com/products/managed-service-for-apache-kafka\" rel=\"noopener noreferrer\">Google Cloud Managed Service for Apache Kafka</a> - Simplifies Kafka deployment and management on Google Cloud for real-time streaming applications.</li>\n</ul>\n<ul>\n<li><a href=\"https://cloud.google.com/pubsub\" rel=\"noopener noreferrer\">Google Cloud Pub/Sub</a> - High-throughput messaging service that supports event-driven architectures with flexible delivery models.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.huaweicloud.com/intl/en-us/product/dms.html\" rel=\"noopener noreferrer\">Huawei Cloud Distributed Message Service</a> - Fully managed messaging service that ensures secure, scalable, and reliable communication between applications.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.huaweicloud.com/intl/en-us/product/dmskafka.html\" rel=\"noopener noreferrer\">Huawei Cloud Distributed Message Service for Kafka</a> - Managed Kafka solution that simplifies scaling and management while delivering high performance and security.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/cloud/mq\" rel=\"noopener noreferrer\">IBM MQ on Cloud</a> - Enterprise messaging service that offers secure, reliable data transfer across applications in a cloud environment.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.iron.io/mq\" rel=\"noopener noreferrer\">IronMQ</a> - Elastic, cloud-native message queue designed for scalable and reliable processing of high-volume messages.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.oracle.com/cloud/cloud-native/streaming/\" rel=\"noopener noreferrer\">Oracle Cloud Streaming</a> - Serverless, real-time event streaming platform with Apache Kafka compatibility for efficient data processing.</li>\n</ul>\n<ul>\n<li><a href=\"https://solace.com/products/platform/cloud/\" rel=\"noopener noreferrer\">Solace PubSub+ Cloud</a> - Integrated event streaming platform providing full visibility and control over your data pipelines.</li>\n</ul>\n<ul>\n<li><a href=\"https://cloud.yandex.com/en/services/message-queue\" rel=\"noopener noreferrer\">Yandex Message Queue</a> - Cloud messaging service compatible with Amazon SQS API for easy integration with existing systems.</li>\n</ul>\n<ul>\n<li><a href=\"https://cloud.yandex.com/en/services/managed-kafka\" rel=\"noopener noreferrer\">Yandex Managed Service for Apache Kafka</a> - Fully managed Kafka service with automated scaling, monitoring, and maintenance for hassle-free streaming.</li>\n</ul>\n<h3><p>Projects / MFT</p>\n</h3><ul>\n<li><a href=\"https://www.arcesb.com/mft/\" rel=\"noopener noreferrer\">ArcESB Managed File Transfer</a> - Enterprise-grade MFT solution with an intuitive interface and powerful automation for streamlined file exchanges.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.axway.com/en/products/managed-file-transfer\" rel=\"noopener noreferrer\">Axway Managed File Transfer</a> - Robust platform offering advanced security and efficient, reliable data transfer across enterprise systems.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.goanywhere.com/products/goanywhere-mft\" rel=\"noopener noreferrer\">GoAnywhere MFT</a> - Comprehensive solution delivering centralized, secure file transfers with automation and complete audit logging.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.globalscape.com/eft\" rel=\"noopener noreferrer\">GlobalSCAPE EFT</a> - Hardened file transfer server that ensures end-to-end encryption, automation, and compliance for mission-critical data.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/products/secure-file-transfer\" rel=\"noopener noreferrer\">IBM Sterling Secure File Transfer</a> - Scalable and high-performance MFT platform designed for secure, fast, and reliable file exchange.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/products/webmethods-mft\" rel=\"noopener noreferrer\">IBM webMethods MFT</a> - Integrated managed file transfer solution that supports flexible deployment across hybrid environments.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.oracle.com/middleware/technologies/mft/managed-file-transfer.html\" rel=\"noopener noreferrer\">Oracle Managed File Transfer</a> - Comprehensive platform that simplifies secure file exchange and management for enterprise operations.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.progress.com/moveit\" rel=\"noopener noreferrer\">Progress MOVEit</a> - Secure, automated file transfer solution with guaranteed delivery, encryption, and compliance tools for regulated industries.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.tibco.com/products/tibco-managed-file-transfer\" rel=\"noopener noreferrer\">TIBCO Managed File Transfer</a> - Centralized MFT platform with robust automation and security features designed to support diverse file transfer scenarios.</li>\n</ul>\n<ul>\n<li><a href=\"https://southrivertech.com/titan-mft-server/\" rel=\"noopener noreferrer\">Titan MFT Server</a> - Enterprise-level MFT server offering high availability, failover capabilities, and efficient large-scale file automation.</li>\n</ul>\n<h3><p>Projects / MDM</p>\n</h3><ul>\n<li><a href=\"https://www.ibm.com/products/ibm-infosphere-master-data-management\" rel=\"noopener noreferrer\">IBM InfoSphere Master Data Management</a> - Comprehensive platform that centralizes data governance, ensuring consistency and accuracy across your enterprise.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.informatica.com/products/master-data-management/multidomain-mdm.html\" rel=\"noopener noreferrer\">Informatica Multidomain MDM</a> - Integrated solution for managing and governing master data across all domains, enhancing overall data quality.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.oracle.com/performance-management/enterprise-data-management/\" rel=\"noopener noreferrer\">Oracle Enterprise Data Management</a> - Robust tool that centralizes master data to support faster, more effective decision-making and operational agility.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.reltio.com/products/multidomain-mdm\" rel=\"noopener noreferrer\">Reltio</a> - Cloud-native, multi-domain MDM platform combining data quality, governance, and real-time analytics for a 360° view.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.sap.com/products/master-data-governance.html\" rel=\"noopener noreferrer\">SAP Master Data Governance</a> - Centralized solution that consolidates and governs master data to ensure consistency and high quality.</li>\n</ul>\n<ul>\n<li><a href=\"https://support.sas.com/en/software/mdm-support.html\" rel=\"noopener noreferrer\">SAS MDM</a> - Unified platform that integrates data from diverse sources into accurate master records for improved efficiency.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.stibosystems.com/platform\" rel=\"noopener noreferrer\">Stibo MDM</a> - Proven multi-domain MDM solution focusing on data transparency and governance to provide a single source of truth.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.teradata.co.uk/Products/Applications/Master-Data-Management\" rel=\"noopener noreferrer\">Teradata MDM</a> - Establishes a consistent analytical foundation by maintaining accurate reference data for enhanced ROI.</li>\n</ul>\n<h3><p>Projects / Messaging</p>\n</h3><ul>\n<li><a href=\"https://github.com/apache/activemq\" rel=\"noopener noreferrer\">Apache ActiveMQ (⭐2.3k) (⭐2.4k)</a> - Open-source broker that implements JMS, enabling seamless conversion between synchronous and asynchronous messaging.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/apache/pulsar\" rel=\"noopener noreferrer\">Apache Pulsar (⭐14k) (⭐15k)</a> - Versatile pub/sub and streaming platform offering scalable, low-latency messaging for modern applications.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/apache/rocketmq\" rel=\"noopener noreferrer\">Apache RocketMQ (⭐21k) (⭐22k)</a> - High-performance distributed messaging platform engineered for low latency and high throughput.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/bloomberg/blazingmq\" rel=\"noopener noreferrer\">BlazingMQ (⭐2.6k) (⭐2.7k)</a> - Distributed message queuing system focused on efficiency and reliability for modern workflow needs.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ibm.com/products/mq\" rel=\"noopener noreferrer\">IBM MQ</a> - Enterprise-grade messaging solution providing robust features, high availability, and multi-protocol support.</li>\n</ul>\n<ul>\n<li><a href=\"https://kubemq.io/\" rel=\"noopener noreferrer\">KubeMQ</a> - Kubernetes-native message broker and queue system designed for scalability, high availability, and seamless cloud integration.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.oracle.com/database/technologies/advanced-queuing.html\" rel=\"noopener noreferrer\">Oracle AQ</a> - Integrated messaging solution within Oracle databases, offering reliable and efficient message delivery.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/rabbitmq/rabbitmq-server\" rel=\"noopener noreferrer\">RabbitMQ (⭐12k) (⭐13k)</a> - Popular open-source broker implementing AMQP, known for reliability, clustering, and ease-of-use.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/vectorizedio/redpanda\" rel=\"noopener noreferrer\">Redpanda (⭐10k) (⭐11k)</a> - Kafka-compatible streaming platform that eliminates Zookeeper, delivering high performance and low latency.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.redhat.com/en/technologies/jboss-middleware/amq\" rel=\"noopener noreferrer\">Red Hat AMQ</a> - Enterprise messaging platform based on open-source technologies, offering scalable and reliable message delivery.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.tibco.com/products/tibco-enterprise-message-service\" rel=\"noopener noreferrer\">TIBCO Enterprise Message Service</a> - Standards-based JMS implementation that enables efficient and robust exchange of messages between applications.</li>\n</ul>\n<h3><p>Projects / RPA</p>\n</h3><ul>\n<li><a href=\"https://www.automationanywhere.com/\" rel=\"noopener noreferrer\">Automation Anywhere</a> - Intelligent automation ecosystem that streamlines business processes and reduces errors through advanced RPA capabilities.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.blueprism.com/products/intelligent-rpa-automation/\" rel=\"noopener noreferrer\">Blue Prism</a> - No-code platform delivering robust, scalable automation to minimize manual tasks and boost productivity.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.tungstenautomation.com/products/rpa\" rel=\"noopener noreferrer\">Tungsten RPA</a> - AI-powered, no-code automation solution that enhances accuracy, efficiency, and compliance across workflows.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.uipath.com/product\" rel=\"noopener noreferrer\">UiPath</a> - Comprehensive RPA platform that automates routine tasks, enabling scalable digital transformation across enterprises.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.workfusion.com/platform/\" rel=\"noopener noreferrer\">WorkFusion</a> - Enterprise automation solution that combines RPA with intelligent automation to streamline complex workflows.</li>\n</ul>\n<h3><p>Projects / Self-Service Integration</p>\n</h3><ul>\n<li><a href=\"https://ifttt.com/\" rel=\"noopener noreferrer\">IFTTT</a> - Easy-to-use platform that connects web services with simple conditional statements, empowering custom workflow creation.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.make.com\" rel=\"noopener noreferrer\">Make (Integromat)</a> - Low-code automation tool with a visual interface, advanced data transformation, and modular workflow execution.</li>\n</ul>\n<ul>\n<li><a href=\"https://powerautomate.microsoft.com\" rel=\"noopener noreferrer\">Microsoft Power Automate</a> - Cloud-based service with an intuitive interface for creating automated workflows that seamlessly integrate diverse apps.</li>\n</ul>\n<ul>\n<li><a href=\"https://docs.oracle.com/en/cloud/paas/self-service-integration-cloud/index.html\" rel=\"noopener noreferrer\">Oracle Self-Service Integration</a> - Streamlined tool that automates tasks between cloud applications, making integration accessible for non-developers.</li>\n</ul>\n<ul>\n<li><a href=\"https://zapier.com/\" rel=\"noopener noreferrer\">Zapier</a> - Intuitive platform that connects hundreds of web services to create efficient, code-free automations.</li>\n</ul>\n<h3><p>Projects / Workflow engine</p>\n</h3><ul>\n<li><a href=\"https://github.com/Activiti/Activiti\" rel=\"noopener noreferrer\">Activiti (⭐10k) (⭐10k)</a> - Lightweight, Java-centric BPMN engine that efficiently executes business workflows with a focus on simplicity.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/argoproj/argo-workflows\" rel=\"noopener noreferrer\">Argo Workflows (⭐15k) (⭐16k)</a> - Container-native workflow engine designed for orchestrating parallel jobs in Kubernetes-based, cloud-native environments.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/Netflix/conductor\" rel=\"noopener noreferrer\">Conductor (⭐12k) (⭐13k)</a> - Cloud-based orchestration engine that manages microservices workflows, streamlining complex process automation.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/kiegroup/jbpm\" rel=\"noopener noreferrer\">jBPM (⭐1.6k) (⭐1.7k)</a> - Comprehensive toolkit for automating business processes and decisions with robust workflow management capabilities.</li>\n</ul>\n",
      "date_published": "2025-03-09T14:13:05.000Z",
      "date_modified": "2025-03-09T14:13:05.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/PatrickJS/awesome-angular/",
      "title": "Awesome Angular",
      "_slug": "PatrickJS/awesome-angular/",
      "_filepath": "/content/PatrickJS/awesome-angular/README.md",
      "url": "https://www.trackawesomelist.com/PatrickJS/awesome-angular/",
      "summary": "4 awesome projects updated",
      "content_text": "\n\n### Integrations / [Google Developer Experts](https://developers.google.com/experts/all/technology/web-technologies)\n\n*   [ng-react-bridge (⭐3)](https://github.com/john310897/ng-react-bridge) - A lightweight Angular package that enables developers to seamlessly render React components inside Angular components using a directive.\n\n### Free / [Google Developer Experts](https://developers.google.com/experts/all/technology/web-technologies)\n\n*   [dataclouder-template-angular (⭐1)](https://github.com/dataclouder-dev/dataclouder-template-angular) - A ready-to-use Angular/Ionic template with Firebase Authentication integration.\n\n### e2e / [Google Developer Experts](https://developers.google.com/experts/all/technology/web-technologies)\n\n*   [playwright-coverage (⭐44)](https://github.com/bgotink/playwright-coverage) - Report coverage on playwright tests using v8 coverage, without requiring any instrumentation.\n\n### Ionic / [Google Developer Experts](https://developers.google.com/experts/all/technology/web-technologies)\n\n*   [ionic-header-parallax (⭐38)](https://github.com/RaschidJFR/ionic-header-parallax) - This directive enables a parallax effect on `ion-header` elements to display a cover photo while on top of the page and transition to the normal toolbar when scrolling down.",
      "content_html": "<h3><p>Integrations / <a href=\"https://developers.google.com/experts/all/technology/web-technologies\" rel=\"noopener noreferrer\">Google Developer Experts</a></p>\n</h3><ul>\n<li><a href=\"https://github.com/john310897/ng-react-bridge\" rel=\"noopener noreferrer\">ng-react-bridge (⭐3)</a> - A lightweight Angular package that enables developers to seamlessly render React components inside Angular components using a directive.</li>\n</ul>\n<h3><p>Free / <a href=\"https://developers.google.com/experts/all/technology/web-technologies\" rel=\"noopener noreferrer\">Google Developer Experts</a></p>\n</h3><ul>\n<li><a href=\"https://github.com/dataclouder-dev/dataclouder-template-angular\" rel=\"noopener noreferrer\">dataclouder-template-angular (⭐1)</a> - A ready-to-use Angular/Ionic template with Firebase Authentication integration.</li>\n</ul>\n<h3><p>e2e / <a href=\"https://developers.google.com/experts/all/technology/web-technologies\" rel=\"noopener noreferrer\">Google Developer Experts</a></p>\n</h3><ul>\n<li><a href=\"https://github.com/bgotink/playwright-coverage\" rel=\"noopener noreferrer\">playwright-coverage (⭐44)</a> - Report coverage on playwright tests using v8 coverage, without requiring any instrumentation.</li>\n</ul>\n<h3><p>Ionic / <a href=\"https://developers.google.com/experts/all/technology/web-technologies\" rel=\"noopener noreferrer\">Google Developer Experts</a></p>\n</h3><ul>\n<li><a href=\"https://github.com/RaschidJFR/ionic-header-parallax\" rel=\"noopener noreferrer\">ionic-header-parallax (⭐38)</a> - This directive enables a parallax effect on <code>ion-header</code> elements to display a cover photo while on top of the page and transition to the normal toolbar when scrolling down.</li>\n</ul>\n",
      "date_published": "2025-03-09T00:38:16.000Z",
      "date_modified": "2025-03-09T23:38:55.000Z"
    }
  ]
}
