{
  "version": "https://jsonfeed.org/version/1",
  "icon": "https://www.trackawesomelist.com/icon.png",
  "favicon": "https://www.trackawesomelist.com/favicon.ico",
  "language": "en",
  "title": "Awesome List Updates on Aug 29, 2020",
  "_site_title": "Track Awesome List",
  "description": "7 awesome lists updated today.",
  "_seo_title": "Awesome List Updates on Aug 29, 2020 - Track Awesome List",
  "feed_url": "https://www.trackawesomelist.com/feed.json",
  "home_page_url": "https://www.trackawesomelist.com",
  "items": [
    {
      "id": "https://www.trackawesomelist.com/iamericfletcher/awesome-r-learning-resources/",
      "title": "Awesome R Learning Resources",
      "_slug": "iamericfletcher/awesome-r-learning-resources/",
      "_filepath": "/content/iamericfletcher/awesome-r-learning-resources/README.md",
      "url": "https://www.trackawesomelist.com/iamericfletcher/awesome-r-learning-resources/",
      "summary": "4 awesome projects updated",
      "content_text": "\n\n### Topic Areas / Uncategorized\n\n*   [Subreddit - r/Rlanguage - R Programming Language](https://www.reddit.com/r/Rlanguage/new/) - A Reddit subreddit focused on implementing the R programming language for statistics and data science.\n*   [Subreddit - r/programming - The R Project for Statistical Computing](https://www.reddit.com/r/rprogramming/) - A Reddit subreddit focused on using R for statistical computing.\n\n### Blogs / Uncategorized\n\n*   [Avery Robbins](https://www.avery-robbins.com) - Avery Robbins loves to learn and to share useful or awesome things that have benefited him personally. This website is a tool for him to actively do just that: share knowledge, ideas, and tips that are helpful.\n*   [Tony ElHabr](https://tonyelhabr.rbind.io/) - Tony ElHabr is passionate mostly about energy markets and sports analytics. His blog provides detailed tutorials, project explanations, and presentations.\n*   [Data meets Narrative](http://www.rebeccabarter.com/blog/) - Rebecca Barter enjoys making sense of complex, messy and sometimes nonsensical datasets, such as electronic health records, and insurance claims. Her dual passions are explaining “seemingly complicated” concepts to others in plain English, and exploring and uncovering the stories that underlie complex datasets.\n*   [HighlandR](https://johnmackintosh.net/) - John Mackintosh's blog is a place for him to showcase demonstrations or workshops, notes he's learned at work, chart makeovers, and techniques and technology that he doesn't currently use in his role.\n*   [Julia Silge](https://juliasilge.com/blog/) - Julia Silge is a data scientist and software engineer at RStudio where she work on open source modeling tools. She is passionate about making beautiful charts, the statistical programming language R, Jane Austen, black coffee, and red wine.\n*   [rweekly](https://rweekly.org/about) - Weekly Updates from the Entire R Community by Bruce Zhao, Colin Fay, Eric Nantz, Hao Zhu, Jon Calder, Jonathan Carroll, Maëlle Salmon, Ryo Nakagawara, and Wolfram Qin.\n*   [r-bloggers](https://www.r-bloggers.com/) - R-Bloggers.com was created by Tal Galili and is a blog aggregator of content contributed by bloggers who write about R (in English). The site helps R bloggers and users to connect and follow the R blogosphere.\n*   [Ryo Nakagawara](https://ryo-n7.github.io/) - Ryo Nakagawara is a Data Scientist and has been doing work as both a reporting analyst and a software developer in R and SQL to improve ACDI and VOCA data pipelines, create R packages, reproducible reports, dashboards, and Shiny apps to communicate how his projects worldwide are progressing.\n*   [Statistics Globe](https://statisticsglobe.com/) - Joachim Schork started this platform to share his statistical know-how and to improve his own statistical skills by discussing with other statisticians and programmers.\n\n### Books / Uncategorized\n\n*   [A Sufficient Introduction to R](https://dereksonderegger.github.io/570L/) - This book is intended to guide people that are completely new to programming along a path towards a useful skill level using R. Author: Derek L. Sonderegger.\n*   [An Introduction to Statistical Learning](http://faculty.marshall.usc.edu/gareth-james/ISL/ISLR%20Seventh%20Printing.pdf) - This book provides an introduction to statistical learning methods. Authors: Gareth James, Daniela Witten, Trevor Hastie and Robert Tibshirani.\n*   [An Introduction to R](https://cran.r-project.org/doc/manuals/r-release/R-intro.pdf) - This introduction to R is derived from an original set of notes describing the S and S-Plus environments written in 1990–2 by Bill Venables and David M. Smith when at the University of Adelaide.\n*   [Exploratory Data Analysis with R](https://bookdown.org/rdpeng/exdata/) - This book covers the essential exploratory techniques for summarizing data with R. These techniques are typically applied before formal modeling commences and can help inform the development of more complex statistical models. Author: Roger D. Peng.\n*   [ggplot2: Elegant Graphics for Data Analysis](https://ggplot2-book.org/index.html) - This book provides a hands-on introduction to ggplot2 with lots of example code and graphics. It also explains the grammar on which ggplot2 is based. Author: Hadley Wickham.\n*   [Introduction to R & Spatial Data with Raster and Terra](https://rspatial.org/intr/index.html) - This document provides a concise introduction to R. It emphasizes what you need to know to be able to use the language in any context. Author: Professor Robert Hijmans.\n*   [Learning Statistics with R](https://learningstatisticswithr.com/) - Learning Statistics with R covers the contents of an introductory statistics class, as typically taught to undergraduate psychology students, focusing on the use of the R statistical software. Author: Danielle Navarro.\n*   [Modern R with the tidyverse](https://b-rodrigues.github.io/modern_R/) - The idea of Chapters 1 to 7 is to make you efficient with R as quickly as possible, especially if you already have prior programming knowledge. Starting with Chapter 8 you will learn more advanced topics, especially programming with R. Author: Bruno Rodrigues.\n*   [Practical Regression and Anova using R](https://cran.r-project.org/doc/contrib/Faraway-PRA.pdf) - The emphasis of this text is on the practice of regression and analysis of variance. The objective is to learn what methods are available and more importantly, when they should be applied. Author: Julian Faraway.\n*   [Practicals and Exercises](http://www.columbia.edu/~cjd11/charles_dimaggio/DIRE/resources/R/practicalsBookNoAns.pdf) - This series of exercises reviews some of the content discussed during the author's lectures, and introduces some other basic concepts about working with data in R. Author: Charles DiMaggio, PhD.\n*   [R Packages](http://r-pkgs.had.co.nz/) - In this book you will learn how to turn your code into packages that others can easily download and use. Author: Hadley Wickham.\n*   [R Programming for Data Science](https://leanpub.com/rprogramming) - This book brings the fundamentals of R programming to you, using the same material developed as part of the industry-leading Johns Hopkins Data Science Specialization. Author: Roger Peng.\n*   [Statistical Inference via Data Science](https://moderndive.com/) - This is intended to be a gentle introduction to the practice of analyzing data and answering questions using data the way data scientists, statisticians, data journalists, and other researchers would. Authors: Chester Ismay and Albert Y. Kim.\n*   [Text Mining with R](https://www.tidytextmining.com/) - This book serves as an introduction of text mining using the tidytext package and other tidy tools in R. Authors: Julia Silge and David Robinson.\n*   [The Art of R Programming](http://diytranscriptomics.com/Reading/files/The%20Art%20of%20R%20Programming.pdf) - This book is for those who wish to learn about developing software in R. Author: Norman Matloff.\n*   [The R Inferno](http://www.burns-stat.com/pages/Tutor/R_inferno.pdf) - A book about trouble spots, oddities, traps, and glitches in R. Author: Patrick Burns.\n*   [The R Language](https://stat.ethz.ch/R-manual/R-patched/doc/html/) - An introduction to R written by the authors of the R language.\n\n### Podcasts / Uncategorized\n\n*   [Not so Standard Deviations](http://nssdeviations.com/) - A data science podcast where Roger Peng and Hilary Parker talk about the latest in data science and data analysis in academia and industry.\n*   [The R-Podcast](https://r-podcast.org/) - Practical advice on how to take advantage of R to accomplish innovative and robust data analyses. Hosted by Eric Nantz.",
      "content_html": "<h3><p>Topic Areas / Uncategorized</p>\n</h3><ul>\n<li><a href=\"https://www.reddit.com/r/Rlanguage/new/\" rel=\"noopener noreferrer\">Subreddit - r/Rlanguage - R Programming Language</a> - A Reddit subreddit focused on implementing the R programming language for statistics and data science.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.reddit.com/r/rprogramming/\" rel=\"noopener noreferrer\">Subreddit - r/programming - The R Project for Statistical Computing</a> - A Reddit subreddit focused on using R for statistical computing.</li>\n</ul>\n<h3><p>Blogs / Uncategorized</p>\n</h3><ul>\n<li><a href=\"https://www.avery-robbins.com\" rel=\"noopener noreferrer\">Avery Robbins</a> - Avery Robbins loves to learn and to share useful or awesome things that have benefited him personally. This website is a tool for him to actively do just that: share knowledge, ideas, and tips that are helpful.</li>\n</ul>\n<ul>\n<li><a href=\"https://tonyelhabr.rbind.io/\" rel=\"noopener noreferrer\">Tony ElHabr</a> - Tony ElHabr is passionate mostly about energy markets and sports analytics. His blog provides detailed tutorials, project explanations, and presentations.</li>\n</ul>\n<ul>\n<li><a href=\"http://www.rebeccabarter.com/blog/\" rel=\"noopener noreferrer\">Data meets Narrative</a> - Rebecca Barter enjoys making sense of complex, messy and sometimes nonsensical datasets, such as electronic health records, and insurance claims. Her dual passions are explaining “seemingly complicated” concepts to others in plain English, and exploring and uncovering the stories that underlie complex datasets.</li>\n</ul>\n<ul>\n<li><a href=\"https://johnmackintosh.net/\" rel=\"noopener noreferrer\">HighlandR</a> - John Mackintosh's blog is a place for him to showcase demonstrations or workshops, notes he's learned at work, chart makeovers, and techniques and technology that he doesn't currently use in his role.</li>\n</ul>\n<ul>\n<li><a href=\"https://juliasilge.com/blog/\" rel=\"noopener noreferrer\">Julia Silge</a> - Julia Silge is a data scientist and software engineer at RStudio where she work on open source modeling tools. She is passionate about making beautiful charts, the statistical programming language R, Jane Austen, black coffee, and red wine.</li>\n</ul>\n<ul>\n<li><a href=\"https://rweekly.org/about\" rel=\"noopener noreferrer\">rweekly</a> - Weekly Updates from the Entire R Community by Bruce Zhao, Colin Fay, Eric Nantz, Hao Zhu, Jon Calder, Jonathan Carroll, Maëlle Salmon, Ryo Nakagawara, and Wolfram Qin.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.r-bloggers.com/\" rel=\"noopener noreferrer\">r-bloggers</a> - R-Bloggers.com was created by Tal Galili and is a blog aggregator of content contributed by bloggers who write about R (in English). The site helps R bloggers and users to connect and follow the R blogosphere.</li>\n</ul>\n<ul>\n<li><a href=\"https://ryo-n7.github.io/\" rel=\"noopener noreferrer\">Ryo Nakagawara</a> - Ryo Nakagawara is a Data Scientist and has been doing work as both a reporting analyst and a software developer in R and SQL to improve ACDI and VOCA data pipelines, create R packages, reproducible reports, dashboards, and Shiny apps to communicate how his projects worldwide are progressing.</li>\n</ul>\n<ul>\n<li><a href=\"https://statisticsglobe.com/\" rel=\"noopener noreferrer\">Statistics Globe</a> - Joachim Schork started this platform to share his statistical know-how and to improve his own statistical skills by discussing with other statisticians and programmers.</li>\n</ul>\n<h3><p>Books / Uncategorized</p>\n</h3><ul>\n<li><a href=\"https://dereksonderegger.github.io/570L/\" rel=\"noopener noreferrer\">A Sufficient Introduction to R</a> - This book is intended to guide people that are completely new to programming along a path towards a useful skill level using R. Author: Derek L. Sonderegger.</li>\n</ul>\n<ul>\n<li><a href=\"http://faculty.marshall.usc.edu/gareth-james/ISL/ISLR%20Seventh%20Printing.pdf\" rel=\"noopener noreferrer\">An Introduction to Statistical Learning</a> - This book provides an introduction to statistical learning methods. Authors: Gareth James, Daniela Witten, Trevor Hastie and Robert Tibshirani.</li>\n</ul>\n<ul>\n<li><a href=\"https://cran.r-project.org/doc/manuals/r-release/R-intro.pdf\" rel=\"noopener noreferrer\">An Introduction to R</a> - This introduction to R is derived from an original set of notes describing the S and S-Plus environments written in 1990–2 by Bill Venables and David M. Smith when at the University of Adelaide.</li>\n</ul>\n<ul>\n<li><a href=\"https://bookdown.org/rdpeng/exdata/\" rel=\"noopener noreferrer\">Exploratory Data Analysis with R</a> - This book covers the essential exploratory techniques for summarizing data with R. These techniques are typically applied before formal modeling commences and can help inform the development of more complex statistical models. Author: Roger D. Peng.</li>\n</ul>\n<ul>\n<li><a href=\"https://ggplot2-book.org/index.html\" rel=\"noopener noreferrer\">ggplot2: Elegant Graphics for Data Analysis</a> - This book provides a hands-on introduction to ggplot2 with lots of example code and graphics. It also explains the grammar on which ggplot2 is based. Author: Hadley Wickham.</li>\n</ul>\n<ul>\n<li><a href=\"https://rspatial.org/intr/index.html\" rel=\"noopener noreferrer\">Introduction to R &amp; Spatial Data with Raster and Terra</a> - This document provides a concise introduction to R. It emphasizes what you need to know to be able to use the language in any context. Author: Professor Robert Hijmans.</li>\n</ul>\n<ul>\n<li><a href=\"https://learningstatisticswithr.com/\" rel=\"noopener noreferrer\">Learning Statistics with R</a> - Learning Statistics with R covers the contents of an introductory statistics class, as typically taught to undergraduate psychology students, focusing on the use of the R statistical software. Author: Danielle Navarro.</li>\n</ul>\n<ul>\n<li><a href=\"https://b-rodrigues.github.io/modern_R/\" rel=\"noopener noreferrer\">Modern R with the tidyverse</a> - The idea of Chapters 1 to 7 is to make you efficient with R as quickly as possible, especially if you already have prior programming knowledge. Starting with Chapter 8 you will learn more advanced topics, especially programming with R. Author: Bruno Rodrigues.</li>\n</ul>\n<ul>\n<li><a href=\"https://cran.r-project.org/doc/contrib/Faraway-PRA.pdf\" rel=\"noopener noreferrer\">Practical Regression and Anova using R</a> - The emphasis of this text is on the practice of regression and analysis of variance. The objective is to learn what methods are available and more importantly, when they should be applied. Author: Julian Faraway.</li>\n</ul>\n<ul>\n<li><a href=\"http://www.columbia.edu/~cjd11/charles_dimaggio/DIRE/resources/R/practicalsBookNoAns.pdf\" rel=\"noopener noreferrer\">Practicals and Exercises</a> - This series of exercises reviews some of the content discussed during the author's lectures, and introduces some other basic concepts about working with data in R. Author: Charles DiMaggio, PhD.</li>\n</ul>\n<ul>\n<li><a href=\"http://r-pkgs.had.co.nz/\" rel=\"noopener noreferrer\">R Packages</a> - In this book you will learn how to turn your code into packages that others can easily download and use. Author: Hadley Wickham.</li>\n</ul>\n<ul>\n<li><a href=\"https://leanpub.com/rprogramming\" rel=\"noopener noreferrer\">R Programming for Data Science</a> - This book brings the fundamentals of R programming to you, using the same material developed as part of the industry-leading Johns Hopkins Data Science Specialization. Author: Roger Peng.</li>\n</ul>\n<ul>\n<li><a href=\"https://moderndive.com/\" rel=\"noopener noreferrer\">Statistical Inference via Data Science</a> - This is intended to be a gentle introduction to the practice of analyzing data and answering questions using data the way data scientists, statisticians, data journalists, and other researchers would. Authors: Chester Ismay and Albert Y. Kim.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.tidytextmining.com/\" rel=\"noopener noreferrer\">Text Mining with R</a> - This book serves as an introduction of text mining using the tidytext package and other tidy tools in R. Authors: Julia Silge and David Robinson.</li>\n</ul>\n<ul>\n<li><a href=\"http://diytranscriptomics.com/Reading/files/The%20Art%20of%20R%20Programming.pdf\" rel=\"noopener noreferrer\">The Art of R Programming</a> - This book is for those who wish to learn about developing software in R. Author: Norman Matloff.</li>\n</ul>\n<ul>\n<li><a href=\"http://www.burns-stat.com/pages/Tutor/R_inferno.pdf\" rel=\"noopener noreferrer\">The R Inferno</a> - A book about trouble spots, oddities, traps, and glitches in R. Author: Patrick Burns.</li>\n</ul>\n<ul>\n<li><a href=\"https://stat.ethz.ch/R-manual/R-patched/doc/html/\" rel=\"noopener noreferrer\">The R Language</a> - An introduction to R written by the authors of the R language.</li>\n</ul>\n<h3><p>Podcasts / Uncategorized</p>\n</h3><ul>\n<li><a href=\"http://nssdeviations.com/\" rel=\"noopener noreferrer\">Not so Standard Deviations</a> - A data science podcast where Roger Peng and Hilary Parker talk about the latest in data science and data analysis in academia and industry.</li>\n</ul>\n<ul>\n<li><a href=\"https://r-podcast.org/\" rel=\"noopener noreferrer\">The R-Podcast</a> - Practical advice on how to take advantage of R to accomplish innovative and robust data analyses. Hosted by Eric Nantz.</li>\n</ul>\n",
      "date_published": "2020-08-29T20:13:12.000Z",
      "date_modified": "2020-08-29T23:42:18.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/sdras/awesome-actions/",
      "title": "Awesome Actions",
      "_slug": "sdras/awesome-actions/",
      "_filepath": "/content/sdras/awesome-actions/README.md",
      "url": "https://www.trackawesomelist.com/sdras/awesome-actions/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Pull Requests / Code Coverage\n\n*   [Pull Request Stats (⭐382)](https://github.com/flowwer-dev/pull-request-stats) -  Print relevant stats about reviewers.",
      "content_html": "<h3><p>Pull Requests / Code Coverage</p>\n</h3><ul>\n<li><a href=\"https://github.com/flowwer-dev/pull-request-stats\" rel=\"noopener noreferrer\">Pull Request Stats (⭐382)</a> -  Print relevant stats about reviewers.</li>\n</ul>\n",
      "date_published": "2020-08-29T16:16:33.000Z",
      "date_modified": "2020-08-29T16:16:33.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/vuejs/awesome-vue/",
      "title": "Awesome Vue",
      "_slug": "vuejs/awesome-vue/",
      "_filepath": "/content/vuejs/awesome-vue/README.md",
      "url": "https://www.trackawesomelist.com/vuejs/awesome-vue/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Components & Libraries / UI Utilities\n\n*   [vue-lazy (⭐3)](https://github.com/bartdominiak/vue-lazy) - Lightweight Image/Picture lazyload based on Intersection API",
      "content_html": "<h3><p>Components &amp; Libraries / UI Utilities</p>\n</h3><ul>\n<li><a href=\"https://github.com/bartdominiak/vue-lazy\" rel=\"noopener noreferrer\">vue-lazy (⭐3)</a> - Lightweight Image/Picture lazyload based on Intersection API</li>\n</ul>\n",
      "date_published": "2020-08-29T15:24:48.000Z",
      "date_modified": "2020-08-29T15:24:48.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/philsturgeon/awesome-earth/",
      "title": "Awesome Earth",
      "_slug": "philsturgeon/awesome-earth/",
      "_filepath": "/content/philsturgeon/awesome-earth/README.md",
      "url": "https://www.trackawesomelist.com/philsturgeon/awesome-earth/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Carbon Reduction\n\n*   [Patch](https://www.usepatch.com) - Patch is the API for negative emissions. Developers can use Patch's API to make any transaction carbon neutral with a wide range of negative emission methods (e.g. direct air carbon capture, bio-oil geosequestration, enhanced weathering, reforestation and more).",
      "content_html": "<h3><p>Carbon Reduction</p>\n</h3><ul>\n<li><a href=\"https://www.usepatch.com\" rel=\"noopener noreferrer\">Patch</a> - Patch is the API for negative emissions. Developers can use Patch's API to make any transaction carbon neutral with a wide range of negative emission methods (e.g. direct air carbon capture, bio-oil geosequestration, enhanced weathering, reforestation and more).</li>\n</ul>\n",
      "date_published": "2020-08-29T09:37:28.000Z",
      "date_modified": "2020-08-29T09:37:28.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/AppImageCommunity/awesome-appimage/",
      "title": "Awesome Appimage",
      "_slug": "AppImageCommunity/awesome-appimage/",
      "_filepath": "/content/AppImageCommunity/awesome-appimage/README.md",
      "url": "https://www.trackawesomelist.com/AppImageCommunity/awesome-appimage/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### AppImage consumption tools / Linux distributions\n\n*   [Deepin](https://www.deepin.org/en/) - When you double-click an AppImage or any other executable file that lacks execute permissions, a user-friendly dialog explains the situation and asks for your permission to set the execute permission and execute the executable.\n*   [Nitrux](https://nxos.org/) - Promotes the use of AppImage as the main format for getting applications, has a built in app center featuring AppImages.",
      "content_html": "<h3><p>AppImage consumption tools / Linux distributions</p>\n</h3><ul>\n<li><a href=\"https://www.deepin.org/en/\" rel=\"noopener noreferrer\">Deepin</a> - When you double-click an AppImage or any other executable file that lacks execute permissions, a user-friendly dialog explains the situation and asks for your permission to set the execute permission and execute the executable.</li>\n</ul>\n<ul>\n<li><a href=\"https://nxos.org/\" rel=\"noopener noreferrer\">Nitrux</a> - Promotes the use of AppImage as the main format for getting applications, has a built in app center featuring AppImages.</li>\n</ul>\n",
      "date_published": "2020-08-29T09:05:45.000Z",
      "date_modified": "2020-08-29T09:05:45.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/sporto/awesome-elm/",
      "title": "Awesome Elm",
      "_slug": "sporto/awesome-elm/",
      "_filepath": "/content/sporto/awesome-elm/README.md",
      "url": "https://www.trackawesomelist.com/sporto/awesome-elm/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Learning Guides\n\n*   [Elm patterns](http://sporto.github.io/elm-patterns/index.html) - A collection of common patterns in Elm.",
      "content_html": "<h3><p>Learning Guides</p>\n</h3><ul>\n<li><a href=\"http://sporto.github.io/elm-patterns/index.html\" rel=\"noopener noreferrer\">Elm patterns</a> - A collection of common patterns in Elm.</li>\n</ul>\n",
      "date_published": "2020-08-29T03:42:17.000Z",
      "date_modified": "2020-08-29T03:42:17.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/dustinspecker/awesome-eslint/",
      "title": "Awesome Eslint",
      "_slug": "dustinspecker/awesome-eslint/",
      "_filepath": "/content/dustinspecker/awesome-eslint/README.md",
      "url": "https://www.trackawesomelist.com/dustinspecker/awesome-eslint/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Plugins / CSS in JS\n\n*   [CSS-modules (⭐153)](https://github.com/atfzl/eslint-plugin-css-modules) - Lint undefined or unused rules for css modules.\n*   Styled Components\n    *   [Better Styled Components (⭐66)](https://github.com/tinloof/eslint-plugin-better-styled-components) - Auto fixable ESlint's rules for styled components.\n    *   [styled-components-a11y (⭐151)](https://github.com/brendanmorrell/eslint-plugin-styled-components-a11y) - A11y for Styled Components.",
      "content_html": "<h3><p>Plugins / CSS in JS</p>\n</h3><ul>\n<li><a href=\"https://github.com/atfzl/eslint-plugin-css-modules\" rel=\"noopener noreferrer\">CSS-modules (⭐153)</a> - Lint undefined or unused rules for css modules.</li>\n</ul>\n<ul>\n<li>Styled Components<ul>\n<li><a href=\"https://github.com/tinloof/eslint-plugin-better-styled-components\" rel=\"noopener noreferrer\">Better Styled Components (⭐66)</a> - Auto fixable ESlint's rules for styled components.</li>\n<li><a href=\"https://github.com/brendanmorrell/eslint-plugin-styled-components-a11y\" rel=\"noopener noreferrer\">styled-components-a11y (⭐151)</a> - A11y for Styled Components.</li>\n</ul>\n</li>\n</ul>\n",
      "date_published": "2020-08-29T01:00:09.000Z",
      "date_modified": "2020-08-29T01:00:09.000Z"
    }
  ]
}
