{
  "version": "https://jsonfeed.org/version/1",
  "icon": "https://www.trackawesomelist.com/icon.png",
  "favicon": "https://www.trackawesomelist.com/favicon.ico",
  "language": "en",
  "title": "Awesome List Updates on Sep 12, 2020",
  "_site_title": "Track Awesome List",
  "description": "7 awesome lists updated today.",
  "_seo_title": "Awesome List Updates on Sep 12, 2020 - Track Awesome List",
  "feed_url": "https://www.trackawesomelist.com/feed.json",
  "home_page_url": "https://www.trackawesomelist.com",
  "items": [
    {
      "id": "https://www.trackawesomelist.com/margaretmz/awesome-tensorflow-lite/",
      "title": "Awesome Tensorflow Lite",
      "_slug": "margaretmz/awesome-tensorflow-lite/",
      "_filepath": "/content/margaretmz/awesome-tensorflow-lite/README.md",
      "url": "https://www.trackawesomelist.com/margaretmz/awesome-tensorflow-lite/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Helpful links / Other\n\n*   [Performance measurement](https://www.tensorflow.org/lite/performance/measurement) - How to measure model performance on Android and iOS.",
      "content_html": "<h3><p>Helpful links / Other</p>\n</h3><ul>\n<li><a href=\"https://www.tensorflow.org/lite/performance/measurement\" rel=\"noopener noreferrer\">Performance measurement</a> - How to measure model performance on Android and iOS.</li>\n</ul>\n",
      "date_published": "2020-09-12T23:32:53.000Z",
      "date_modified": "2020-09-12T23:32:53.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/mourarthur/awesome-credit-modeling/",
      "title": "Awesome Credit Modeling",
      "_slug": "mourarthur/awesome-credit-modeling/",
      "_filepath": "/content/mourarthur/awesome-credit-modeling/README.md",
      "url": "https://www.trackawesomelist.com/mourarthur/awesome-credit-modeling/",
      "summary": "5 awesome projects updated",
      "content_text": "\n\n### Introduction\n\n*   [Statistical Classification Methods in Consumer Credit Scoring: A Review](https://www.jstor.org/stable/2983268) - Classic introduction and review of the subject of credit scoring.\n*   ['Lending by numbers': credit scoring and the constitution of risk within American consumer credit](https://www.tandfonline.com/doi/abs/10.1080/03085140601089846) - Examines how statistical credit-scoring technologies became applied by lenders to the problem of controlling levels of default within American consumer credit. Explores their perceived methodological, procedural and temporal risks.\n\n### Credit Scoring\n\n*   [Benchmarking state-of-the-art classification algorithms for credit scoring: An update of research](https://www.sciencedirect.com/science/article/abs/pii/S0377221715004208) - There have been several advancements in scorecard development, including novel learning methods, performance measures and techniques to reliably compare different classifiers, which the credit scoring literature does not reflect. This paper compares several novel classification algorithms to the state-of-the-art in credit scoring. In addition, the extent to which the assessment of alternative scorecards differs across established and novel indicators of predictive accuracy is examined.\n*   [Classifier Technology and the Illusion of Progress](https://projecteuclid.org/euclid.ss/1149600839) - A great many tools have been developed for supervised classification, ranging from early methods such as linear discriminant analysis through to modern developments such as neural networks and support vector machines. A large number of comparative studies have been conducted in attempts to establish the relative superiority of these methods. This paper argues that these comparisons often fail to take into account important aspects of real problems, so that the apparent superiority of more sophisticated methods may be something of an illusion. In particular, simple methods typically yield performance almost as good as more sophisticated methods, to the extent that the difference in performance may be swamped by other sources of uncertainty that generally are not considered in the classical supervised classification paradigm.\n*   [Good practice in retail credit scorecard assessment](https://www.tandfonline.com/doi/abs/10.1057/palgrave.jors.2601932) - In retail banking, predictive statistical models called ‘scorecards’ are used to assign customers to classes, and hence to appropriate actions or interventions. Such assignments are made on the basis of whether a customer's predicted score is above or below a given threshold. The predictive power of such scorecards gradually deteriorates over time, so that performance needs to be monitored. Common performance measures used in the retail banking sector include the Gini coefficient, the Kolmogorov–Smirnov statistic, the mean difference, and the information value. However, all of these measures use irrelevant information about the magnitude of scores, and fail to use crucial information relating to numbers misclassified. The result is that such measures can sometimes be seriously misleading, resulting in poor quality decisions being made, and mistaken actions being taken.\n*   [Credit scoring using the clustered support vector machine](https://www.sciencedirect.com/science/article/abs/pii/S0957417414005119) - Introduces the use of the clustered support vector machine (CSVM) for credit scorecard development. This recently designed algorithm addresses some of the limitations associated with traditional nonlinear support vector machine (SVM) based methods for classification. Specifically, it is well known that as historical credit scoring datasets get large, these nonlinear approaches, while highly accurate, become computationally expensive. The CSVM can achieve comparable levels of classification performance while remaining relatively cheap computationally.\n\n### Institutional Credit Risk\n\n*   [Availability of Credit to Small Businesses](https://www.federalreserve.gov/publications/2017-september-availability-of-credit-to-small-businesses.htm) - Section 2227 of the Economic Growth and Regulatory Paperwork Reduction Act of 1996 requires that, every five years, the Board of Governors of the Federal Reserve System submit a report to the Congress detailing the extent of small business lending by all creditors. The most recent one is dated September, 2017.\n*   [Credit Risk Assessment Using Statistical and Machine Learning: Basic Methodology and Risk Modeling Applications](https://link.springer.com/article/10.1023/A:1008699112516) - An important ingredient to accomplish the goal of a more efficient use of resources through risk modeling is to find accurate predictors of individual risk in the credit portfolios of institutions. In this context the authors make a comparative analysis of different statistical and machine learning modeling methods of classification on a mortgage loan dataset with the motivation to understand their limitations and potential.\n\n### Sample Selection\n\n*   [Reject inference in application scorecards: evidence from France](https://econpapers.repec.org/paper/drmwpaper/2016-10.htm) - Good introduction and discussion on the topic.\n*   [Reject inference, augmentation, and sample selection](https://www.sciencedirect.com/science/article/abs/pii/S0377221706011969) - In-depth discussion.\n*   [Instance sampling in credit scoring: An empirical study of sample size and balancing](http://www.research.lancs.ac.uk/portal/en/publications/instance-sampling-in-credit-scoring-an-empirical-study-of-sample-size-and-balancing\\(89b83914-c7f2-499a-8fa1-844d6cb6004d\\).html) - Discusses the traditional sampling conventions in credit modeling and argues that using larger samples provides a significant increase in accuracy across algorithms.\n\n### Feature Selection\n\n*   [A multi-objective approach for profit-driven feature selection in credit scoring](https://www.sciencedirect.com/science/article/pii/S0167923619300570) - In credit scoring, feature selection aims at removing irrelevant data to improve the performance and interpretability of the scorecard. Standard techniques treat feature selection as a single-objective task and rely on statistical criteria such as correlation. Recent studies suggest that using profit-based indicators may improve the quality of scoring models for businesses.\n*   [Data mining feature selection for credit scoring models](https://link.springer.com/article/10.1057/palgrave.jors.2601976) - The features used may have an important effect on the performance of credit scoring models. The process of choosing the best set of features for credit scoring models is usually unsystematic and dominated by somewhat arbitrary trial. This paper presents an empirical study of four machine learning feature selection methods.\n*   [Combination of feature selection approaches with SVM in credit scoring](https://www.sciencedirect.com/science/article/abs/pii/S0957417409010719) - An effective classificatory model in credit scoring will objectively help managers who rely on intuitive experience. This study proposes four approaches using the SVM (support vector machine) classifier for feature selection that retain sufficient information for classification purposes.",
      "content_html": "<h3><p>Introduction</p>\n</h3><ul>\n<li><a href=\"https://www.jstor.org/stable/2983268\" rel=\"noopener noreferrer\">Statistical Classification Methods in Consumer Credit Scoring: A Review</a> - Classic introduction and review of the subject of credit scoring.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.tandfonline.com/doi/abs/10.1080/03085140601089846\" rel=\"noopener noreferrer\">'Lending by numbers': credit scoring and the constitution of risk within American consumer credit</a> - Examines how statistical credit-scoring technologies became applied by lenders to the problem of controlling levels of default within American consumer credit. Explores their perceived methodological, procedural and temporal risks.</li>\n</ul>\n<h3><p>Credit Scoring</p>\n</h3><ul>\n<li><a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0377221715004208\" rel=\"noopener noreferrer\">Benchmarking state-of-the-art classification algorithms for credit scoring: An update of research</a> - There have been several advancements in scorecard development, including novel learning methods, performance measures and techniques to reliably compare different classifiers, which the credit scoring literature does not reflect. This paper compares several novel classification algorithms to the state-of-the-art in credit scoring. In addition, the extent to which the assessment of alternative scorecards differs across established and novel indicators of predictive accuracy is examined.</li>\n</ul>\n<ul>\n<li><a href=\"https://projecteuclid.org/euclid.ss/1149600839\" rel=\"noopener noreferrer\">Classifier Technology and the Illusion of Progress</a> - A great many tools have been developed for supervised classification, ranging from early methods such as linear discriminant analysis through to modern developments such as neural networks and support vector machines. A large number of comparative studies have been conducted in attempts to establish the relative superiority of these methods. This paper argues that these comparisons often fail to take into account important aspects of real problems, so that the apparent superiority of more sophisticated methods may be something of an illusion. In particular, simple methods typically yield performance almost as good as more sophisticated methods, to the extent that the difference in performance may be swamped by other sources of uncertainty that generally are not considered in the classical supervised classification paradigm.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.tandfonline.com/doi/abs/10.1057/palgrave.jors.2601932\" rel=\"noopener noreferrer\">Good practice in retail credit scorecard assessment</a> - In retail banking, predictive statistical models called ‘scorecards’ are used to assign customers to classes, and hence to appropriate actions or interventions. Such assignments are made on the basis of whether a customer's predicted score is above or below a given threshold. The predictive power of such scorecards gradually deteriorates over time, so that performance needs to be monitored. Common performance measures used in the retail banking sector include the Gini coefficient, the Kolmogorov–Smirnov statistic, the mean difference, and the information value. However, all of these measures use irrelevant information about the magnitude of scores, and fail to use crucial information relating to numbers misclassified. The result is that such measures can sometimes be seriously misleading, resulting in poor quality decisions being made, and mistaken actions being taken.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0957417414005119\" rel=\"noopener noreferrer\">Credit scoring using the clustered support vector machine</a> - Introduces the use of the clustered support vector machine (CSVM) for credit scorecard development. This recently designed algorithm addresses some of the limitations associated with traditional nonlinear support vector machine (SVM) based methods for classification. Specifically, it is well known that as historical credit scoring datasets get large, these nonlinear approaches, while highly accurate, become computationally expensive. The CSVM can achieve comparable levels of classification performance while remaining relatively cheap computationally.</li>\n</ul>\n<h3><p>Institutional Credit Risk</p>\n</h3><ul>\n<li><a href=\"https://www.federalreserve.gov/publications/2017-september-availability-of-credit-to-small-businesses.htm\" rel=\"noopener noreferrer\">Availability of Credit to Small Businesses</a> - Section 2227 of the Economic Growth and Regulatory Paperwork Reduction Act of 1996 requires that, every five years, the Board of Governors of the Federal Reserve System submit a report to the Congress detailing the extent of small business lending by all creditors. The most recent one is dated September, 2017.</li>\n</ul>\n<ul>\n<li><a href=\"https://link.springer.com/article/10.1023/A:1008699112516\" rel=\"noopener noreferrer\">Credit Risk Assessment Using Statistical and Machine Learning: Basic Methodology and Risk Modeling Applications</a> - An important ingredient to accomplish the goal of a more efficient use of resources through risk modeling is to find accurate predictors of individual risk in the credit portfolios of institutions. In this context the authors make a comparative analysis of different statistical and machine learning modeling methods of classification on a mortgage loan dataset with the motivation to understand their limitations and potential.</li>\n</ul>\n<h3><p>Sample Selection</p>\n</h3><ul>\n<li><a href=\"https://econpapers.repec.org/paper/drmwpaper/2016-10.htm\" rel=\"noopener noreferrer\">Reject inference in application scorecards: evidence from France</a> - Good introduction and discussion on the topic.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0377221706011969\" rel=\"noopener noreferrer\">Reject inference, augmentation, and sample selection</a> - In-depth discussion.</li>\n</ul>\n<ul>\n<li><a href=\"http://www.research.lancs.ac.uk/portal/en/publications/instance-sampling-in-credit-scoring-an-empirical-study-of-sample-size-and-balancing(89b83914-c7f2-499a-8fa1-844d6cb6004d).html\" rel=\"noopener noreferrer\">Instance sampling in credit scoring: An empirical study of sample size and balancing</a> - Discusses the traditional sampling conventions in credit modeling and argues that using larger samples provides a significant increase in accuracy across algorithms.</li>\n</ul>\n<h3><p>Feature Selection</p>\n</h3><ul>\n<li><a href=\"https://www.sciencedirect.com/science/article/pii/S0167923619300570\" rel=\"noopener noreferrer\">A multi-objective approach for profit-driven feature selection in credit scoring</a> - In credit scoring, feature selection aims at removing irrelevant data to improve the performance and interpretability of the scorecard. Standard techniques treat feature selection as a single-objective task and rely on statistical criteria such as correlation. Recent studies suggest that using profit-based indicators may improve the quality of scoring models for businesses.</li>\n</ul>\n<ul>\n<li><a href=\"https://link.springer.com/article/10.1057/palgrave.jors.2601976\" rel=\"noopener noreferrer\">Data mining feature selection for credit scoring models</a> - The features used may have an important effect on the performance of credit scoring models. The process of choosing the best set of features for credit scoring models is usually unsystematic and dominated by somewhat arbitrary trial. This paper presents an empirical study of four machine learning feature selection methods.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0957417409010719\" rel=\"noopener noreferrer\">Combination of feature selection approaches with SVM in credit scoring</a> - An effective classificatory model in credit scoring will objectively help managers who rely on intuitive experience. This study proposes four approaches using the SVM (support vector machine) classifier for feature selection that retain sufficient information for classification purposes.</li>\n</ul>\n",
      "date_published": "2020-09-12T21:09:01.000Z",
      "date_modified": "2020-09-12T21:27:23.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/sorrycc/awesome-javascript/",
      "title": "Awesome Javascript",
      "_slug": "sorrycc/awesome-javascript/",
      "_filepath": "/content/sorrycc/awesome-javascript/README.md",
      "url": "https://www.trackawesomelist.com/sorrycc/awesome-javascript/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Component Management\n\n*   [Bit (⭐18k)](https://github.com/teambit/bit) - Create, find and reuse components (React, Angular, Node etc.) across applications.",
      "content_html": "<h3><p>Component Management</p>\n</h3><ul>\n<li><a href=\"https://github.com/teambit/bit\" rel=\"noopener noreferrer\">Bit (⭐18k)</a> - Create, find and reuse components (React, Angular, Node etc.) across applications.</li>\n</ul>\n",
      "date_published": "2020-09-12T12:25:57.000Z",
      "date_modified": "2020-09-12T12:25:57.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/gbdev/awesome-gbdev/",
      "title": "Awesome Gbdev",
      "_slug": "gbdev/awesome-gbdev/",
      "_filepath": "/content/gbdev/awesome-gbdev/README.md",
      "url": "https://www.trackawesomelist.com/gbdev/awesome-gbdev/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Tools / Music drivers and trackers\n\n*   [Carillon Player](http://gbdev.gg8.se/files/musictools/Aleksi%20Eeben/Carillon%20Editor.zip) - Music Engine.\n*   [GBT PLAYER (⭐288)](https://github.com/AntonioND/gbt-player) - A music player library and converter kit.\n*   [mmlgb (⭐43)](https://github.com/SimonLarsen/mmlgb) - A MML parser and GBDK sound driver for the Nintendo Game Boy.\n*   [XPMCK (⭐27)](https://github.com/bazzinotti/XPMCK) - An MML based music compiler with support for Game Boy & Game Boy Color.",
      "content_html": "<h3><p>Tools / Music drivers and trackers</p>\n</h3><ul>\n<li><a href=\"http://gbdev.gg8.se/files/musictools/Aleksi%20Eeben/Carillon%20Editor.zip\" rel=\"noopener noreferrer\">Carillon Player</a> - Music Engine.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/AntonioND/gbt-player\" rel=\"noopener noreferrer\">GBT PLAYER (⭐288)</a> - A music player library and converter kit.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/SimonLarsen/mmlgb\" rel=\"noopener noreferrer\">mmlgb (⭐43)</a> - A MML parser and GBDK sound driver for the Nintendo Game Boy.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/bazzinotti/XPMCK\" rel=\"noopener noreferrer\">XPMCK (⭐27)</a> - An MML based music compiler with support for Game Boy &amp; Game Boy Color.</li>\n</ul>\n",
      "date_published": "2020-09-12T11:04:14.000Z",
      "date_modified": "2020-09-12T11:04:14.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/hbokh/awesome-saltstack/",
      "title": "Awesome Saltstack",
      "_slug": "hbokh/awesome-saltstack/",
      "_filepath": "/content/hbokh/awesome-saltstack/README.md",
      "url": "https://www.trackawesomelist.com/hbokh/awesome-saltstack/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Blogposts and opinions\n\n*   [Network Automation at Scale](https://mirceaulinic.net/2017-02-14-network-automation-tutorial/) - Up and running in 60 minutes.",
      "content_html": "<h3><p>Blogposts and opinions</p>\n</h3><ul>\n<li><a href=\"https://mirceaulinic.net/2017-02-14-network-automation-tutorial/\" rel=\"noopener noreferrer\">Network Automation at Scale</a> - Up and running in 60 minutes.</li>\n</ul>\n",
      "date_published": "2020-09-12T08:34:10.000Z",
      "date_modified": "2020-09-12T08:34:10.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/neutraltone/awesome-stock-resources/",
      "title": "Awesome Stock Resources",
      "_slug": "neutraltone/awesome-stock-resources/",
      "_filepath": "/content/neutraltone/awesome-stock-resources/README.md",
      "url": "https://www.trackawesomelist.com/neutraltone/awesome-stock-resources/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Patterns / Unspecified License\n\n*   [Gradienta](https://gradienta.io/) - [:copyright:](https://gradienta.io/license) Multicolor CSS Gradients, JPG Downloads, 100% Free!",
      "content_html": "<h3><p>Patterns / Unspecified License</p>\n</h3><ul>\n<li><a href=\"https://gradienta.io/\" rel=\"noopener noreferrer\">Gradienta</a> - <a href=\"https://gradienta.io/license\" rel=\"noopener noreferrer\">©️</a> Multicolor CSS Gradients, JPG Downloads, 100% Free!</li>\n</ul>\n",
      "date_published": "2020-09-12T04:12:59.000Z",
      "date_modified": "2020-09-12T04:12:59.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/victorshinya/awesome-ibmcloud/",
      "title": "Awesome Ibmcloud",
      "_slug": "victorshinya/awesome-ibmcloud/",
      "_filepath": "/content/victorshinya/awesome-ibmcloud/README.md",
      "url": "https://www.trackawesomelist.com/victorshinya/awesome-ibmcloud/",
      "summary": "3 awesome projects updated",
      "content_text": "\n\n### Command Line Tools\n\n*   [The Kui Framework for Graphical Terminals (⭐2.9k)](https://github.com/IBM/kui) - A hybrid command-line/UI development experience for cloud-native development.\n\n### Platform\n\n*   [charts (⭐301)](https://github.com/IBM/charts) - The IBM/charts repository provides helm charts for IBM and Third Party middleware.\n*   [cloud-operators (⭐42)](https://github.com/IBM/cloud-operators) - IBM Public Cloud Service Operator.\n*   [cloud-pak (⭐138)](https://github.com/IBM/cloud-pak) - IBM Cloud Paks are enterprise-grade containerized software by combining container images with enterprise capabilities for deployment in production use cases with integrations for management and lifecycle operations. Features such as pre-configured deployments based on product expertise, rolling upgrades, rollbacks, security/vulnerability testing.\n\n### Data & AI\n\n*   [max-base (⭐12)](https://github.com/IBM/MAX-Base) - This is a base image for IBM Model Asset Exchange.",
      "content_html": "<h3><p>Command Line Tools</p>\n</h3><ul>\n<li><a href=\"https://github.com/IBM/kui\" rel=\"noopener noreferrer\">The Kui Framework for Graphical Terminals (⭐2.9k)</a> - A hybrid command-line/UI development experience for cloud-native development.</li>\n</ul>\n<h3><p>Platform</p>\n</h3><ul>\n<li><a href=\"https://github.com/IBM/charts\" rel=\"noopener noreferrer\">charts (⭐301)</a> - The IBM/charts repository provides helm charts for IBM and Third Party middleware.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/IBM/cloud-operators\" rel=\"noopener noreferrer\">cloud-operators (⭐42)</a> - IBM Public Cloud Service Operator.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/IBM/cloud-pak\" rel=\"noopener noreferrer\">cloud-pak (⭐138)</a> - IBM Cloud Paks are enterprise-grade containerized software by combining container images with enterprise capabilities for deployment in production use cases with integrations for management and lifecycle operations. Features such as pre-configured deployments based on product expertise, rolling upgrades, rollbacks, security/vulnerability testing.</li>\n</ul>\n<h3><p>Data &amp; AI</p>\n</h3><ul>\n<li><a href=\"https://github.com/IBM/MAX-Base\" rel=\"noopener noreferrer\">max-base (⭐12)</a> - This is a base image for IBM Model Asset Exchange.</li>\n</ul>\n",
      "date_published": "2020-09-12T02:38:28.000Z",
      "date_modified": "2020-09-12T02:45:46.000Z"
    }
  ]
}
