{
  "version": "https://jsonfeed.org/version/1",
  "icon": "https://www.trackawesomelist.com/icon.png",
  "favicon": "https://www.trackawesomelist.com/favicon.ico",
  "language": "en",
  "title": "Awesome List Updates on May 02, 2025",
  "_site_title": "Track Awesome List",
  "description": "5 awesome lists updated today.",
  "_seo_title": "Awesome List Updates on May 02, 2025 - Track Awesome List",
  "feed_url": "https://www.trackawesomelist.com/feed.json",
  "home_page_url": "https://www.trackawesomelist.com",
  "items": [
    {
      "id": "https://www.trackawesomelist.com/jivoi/awesome-osint/",
      "title": "Awesome Osint",
      "_slug": "jivoi/awesome-osint/",
      "_filepath": "/content/jivoi/awesome-osint/README.md",
      "url": "https://www.trackawesomelist.com/jivoi/awesome-osint/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Speciality Search Engines\n\n*   [Fofa](https://en.fofa.info/) - Asset search and analysis tool.",
      "content_html": "<h3><p>Speciality Search Engines</p>\n</h3><ul>\n<li><a href=\"https://en.fofa.info/\" rel=\"noopener noreferrer\">Fofa</a> - Asset search and analysis tool.</li>\n</ul>\n",
      "date_published": "2025-05-02T23:47:35.000Z",
      "date_modified": "2025-05-02T23:47:35.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/dreamingechoes/awesome-mental-health/",
      "title": "Awesome Mental Health",
      "_slug": "dreamingechoes/awesome-mental-health/",
      "_filepath": "/content/dreamingechoes/awesome-mental-health/README.md",
      "url": "https://www.trackawesomelist.com/dreamingechoes/awesome-mental-health/",
      "summary": "7 awesome projects updated",
      "content_text": "\n\n### About\n\n*   Burnout and recovery\n*   Depression and anxiety in remote work\n*   Mindfulness and stress reduction\n*   Imposter syndrome and self-doubt\n*   Building psychologically safe engineering cultures\n\n### Applications\n\n*   [Calm](https://www.calm.com) – Provides guided meditations, sleep stories, and breathing exercises to help reduce anxiety and improve sleep quality.\n*   [Cope Notes](https://www.copenotes.com) – Sends daily text messages with positive thoughts, exercises, and journaling prompts to help combat depression and anxiety. Content is reviewed by mental health professionals.\n*   [EmoBay](https://emobay.org) – An AI-driven digital mental health platform offering 24/7 conversational support, mood tracking, and crisis-response guidance via a chatbot interface.\n*   [eQuoo](https://www.equoogame.com) – A game-based app that teaches psychological skills to improve emotional fitness and resilience through interactive storytelling.\n*   [Happify](https://www.happify.com) – Offers science-based activities and games designed to reduce stress, overcome negative thoughts, and build resilience.\n*   [Headspace](https://www.headspace.com) – A meditation and mindfulness app offering guided sessions, sleep aids, and stress-reduction techniques. Backed by clinical research and widely used in workplace wellness programs.\n*   [MindShift CBT](https://www.anxietycanada.com/resources/mindshift-cbt/) – Designed to help teens and young adults cope with anxiety using CBT strategies, including relaxation exercises and thought journals.\n*   [Moodpath](https://mymoodpath.com/en/) – An interactive mental health journal that helps you reflect on your emotional well-being, screen for symptoms of depression, and access helpful resources. Developed with input from clinical psychologists.\n*   [Nyxo](https://nyxo.app) – An open-source sleep tracking and coaching app for iOS and Android. It offers personalized sleep insights and education to help you develop healthier sleep habits.\n*   [PTSD Coach](https://www.ptsd.va.gov/appvid/mobile/ptsdcoach_app.asp) – Developed by the U.S. Department of Veterans Affairs, this app provides education about PTSD, self-assessment tools, and resources for managing symptoms.\n*   [Quirk](https://www.quirk.fyi/) – A free, open-source CBT app that helps you identify and reframe distorted thoughts. It’s a lightweight, privacy-focused tool designed to help users develop healthier thinking patterns.\n*   [Sanvello](https://sanvello.com) – Provides daily tools to manage stress, anxiety, and depression using techniques from cognitive behavioral therapy (CBT), mindfulness, and mood tracking. Includes access to peer communities and therapy options.\n*   [Three Good Things](https://three-good-things.glitch.me/) – A simple gratitude journaling app based on positive psychology research. Encourages users to reflect on three positive moments each day to build emotional resilience.\n*   [Wake Up Time](http://wakeupti.me/) – A web-based tool that calculates optimal wake-up times based on 90-minute sleep cycles, helping users feel more rested and in sync with natural rhythms.\n*   [we are ANXIO.us](http://weareanxio.us) – A thoughtfully curated collection of digital wellness tools, mental health apps, and community resources designed to support people living with anxiety.\n*   [Woebot](https://woebothealth.com) – A mental health chatbot that delivers daily emotional support using principles from CBT, helping users track moods and develop coping strategies.\n*   [Wrabit](https://writewithwrabit.com) – A writing app designed to help you build a daily journaling habit while contributing anonymously to mental health research.\n*   [Wysa](https://www.wysa.io) – An AI-powered chatbot that uses evidence-based techniques like CBT and mindfulness to support users in managing stress, anxiety, and depression.\n*   [Youper](https://www.youper.ai) – An AI-powered emotional health assistant that guides you through conversations and activities based on psychological techniques.\n\n### Articles\n\n*   [Mental Self Care For Software Developers And Web Designers](https://www.elegantthemes.com/blog/editorial/mental-self-care-for-software-developers-and-web-designers) - By B.J. Keeton.\n\n### Books\n\n*   [Brotopia: Breaking Up the Boys’ Club of Silicon Valley](https://www.amazon.com/Brotopia-Breaking-Boys-Club-Silicon-Valley/dp/0735213534) - By Emily Chang. A revealing investigation into sexism and exclusion in tech culture—and the toll it takes on women’s mental health.\n*   [Building a Startup Without Going Crazy](https://www.amazon.com/Building-Startup-Without-Going-Crazy/dp/946126643X) - By Leen de Bruyne. A set of 100 short lessons from a founder who burned out and recovered, offering advice for staying sane while launching a company.\n*   [Burn Rate: Launching a Startup and Losing My Mind](https://www.amazon.com/Burn-Rate-Launching-Startup-Losing/dp/0593238265) - By Andy Dunn. A gripping memoir by the co-founder of Bonobos about living with bipolar disorder while building a startup.\n*   [Code Review Anxiety Workbook](https://developersuccesslab.gitbook.io/code-review-anxiety-workbook/) - By Developer Success Lab. A free, research-backed workbook to help developers manage fear, stress, and criticism around code reviews.\n*   [Developers and Depression](https://leanpub.com/developers-and-depression) - By Greg Baugues. A candid collection of essays and talks exploring bipolar disorder, ADHD, and mental illness in the developer community.\n*   [Imposter Syndrome (No CS Degree)](https://gumroad.com/l/imposter-syndrome) - Compiled by Pete. Insights from over 30 self-taught developers about overcoming imposter syndrome and thriving in the tech world without a computer science degree.\n*   [It Doesn’t Have to Be Crazy at Work](https://www.amazon.com/Doesnt-Have-Be-Crazy-Work/dp/0062874780) - By Jason Fried and David Heinemeier Hansson. A manifesto for calm work culture from the Basecamp founders, arguing against hustle culture and burnout.\n*   [Mental Health In Tech: Guidelines For Employees](https://leanpub.com/osmi-guidelines-for-employees) - By OSMI. A practical guide for employees navigating mental health at work, covering legal rights, accommodations, and how to advocate for wellness in the workplace.\n*   [Mental Health In Tech: Guidelines For Executives And HR Professionals](https://leanpub.com/osmi-guidelines-for-employers) - By OSMI. A resource for company leaders on creating supportive environments, complying with legal obligations, and fostering inclusive mental health policies in tech teams.\n*   [Mental Health In Tech: Guidelines For Mental Wellness In The Workplace](https://leanpub.com/osmi-mental-wellness-in-the-workplace) - By OSMI. A comprehensive handbook for building mentally healthy workplaces in tech, covering strategies, policy examples, and case studies.\n*   [Peopleware: Productive Projects and Teams](https://www.amazon.com/Peopleware-Productive-Projects-Teams-3rd/dp/0321934113) - By Tom DeMarco and Timothy Lister. An influential text on the human factors of software development, advocating for healthier team environments and better work-life balance.\n*   [Slack: Getting Past Burnout, Busywork, and the Myth of Total Efficiency](https://www.amazon.com/Slack-Getting-Burnout-Busywork-Efficiency/dp/0767907698) - By Tom DeMarco. A classic book on the importance of “slack” in developer workflows, highlighting the dangers of overwork and the need for creative space.\n\n### Conferences\n\n*   [Behavioral Health Tech](https://behavioralhealthtech.com) - The leading conference on innovation in behavioral health and technology. Brings together tech companies, healthcare providers, and developers working on mental health platforms and services.\n*   [Computing And Mental Health](http://mentalhealth.media.mit.edu/) - A multidisciplinary gathering focused on how digital tools and computing technologies can support and enhance mental well-being. Hosted by the MIT Media Lab.\n*   [Heartifacts](https://heartifacts.codeandsupply.co/) - A people-focused tech conference centered around mental health, communication, and inclusion in the software industry. Designed to foster open conversations about burnout, stress, and psychological safety.\n*   [Mental Health America Annual Conference](https://mhanational.org/annual-conference) - A broad conference addressing national mental health issues, with tech-related tracks exploring innovation in digital mental health, privacy, and accessibility in mental health tech.\n\n### Meetups\n\n*   [Berlin Mental Health Support Group](https://www.meetup.com/berlin-mental-health-support-group/) - A peer support circle for tech professionals and others navigating mental health challenges. Offers regular “Soundness Check” sessions in a safe, non-judgmental space.\n*   [Thought Tech](https://www.meetup.com/thought-tech/) - Based in New York City, this group brings together technologists and innovators to explore the intersection of mental health and tech through open discussions and guest speakers.\n*   [Wellness for People in Tech](https://www.meetup.com/wellness-for-people-in-tech/) - A Silicon Valley meetup helping IT professionals manage stress and avoid burnout. Hosts wellness-focused workshops on self-care, work-life balance, and mental resilience.\n\n### Podcasts\n\n*   [Destigmatizing Mental Health in the Tech Industry](https://hanselminutes.com/728) – On Hanselminutes (Ep. 728). Scott Hanselman interviews Dr. Jennifer Akullian about breaking the stigma around therapy, stress, and emotional struggles in the software industry.\n*   [Emotional Intelligence And Ethics In Tech](http://happyporchradio.com/season-4-episode-3-april-wensel/) – By April Wensel on the Happy Porch podcast. A conversation about compassionate coding and building emotionally intelligent engineering cultures.\n*   [Mental Health in Tech](https://anchor.fm/mental-health-in-tech) – Hosted by Schalk Neethling and Schalk Venter. A monthly podcast sharing real stories from developers about mental health, burnout, vulnerability, and resilience in tech.\n*   [Soft Skills Engineering](https://softskills.audio) – Hosted by Jamison Dance and Dave Smith. A humorous advice show for developers tackling topics like burnout, imposter syndrome, performance anxiety, and career balance.\n*   [Valarie Regas’s Story](https://devjourney.info/Guests/284-ValarieRegas.html) – On Software Developer’s Journey. A heartfelt episode where Valarie discusses her experience with depression, anxiety, and the need for empathy in tech workplaces.",
      "content_html": "<h3><p>About</p>\n</h3><ul>\n<li>Burnout and recovery</li>\n</ul>\n<ul>\n<li>Depression and anxiety in remote work</li>\n</ul>\n<ul>\n<li>Mindfulness and stress reduction</li>\n</ul>\n<ul>\n<li>Imposter syndrome and self-doubt</li>\n</ul>\n<ul>\n<li>Building psychologically safe engineering cultures</li>\n</ul>\n<h3><p>Applications</p>\n</h3><ul>\n<li><a href=\"https://www.calm.com\" rel=\"noopener noreferrer\">Calm</a> – Provides guided meditations, sleep stories, and breathing exercises to help reduce anxiety and improve sleep quality.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.copenotes.com\" rel=\"noopener noreferrer\">Cope Notes</a> – Sends daily text messages with positive thoughts, exercises, and journaling prompts to help combat depression and anxiety. Content is reviewed by mental health professionals.</li>\n</ul>\n<ul>\n<li><a href=\"https://emobay.org\" rel=\"noopener noreferrer\">EmoBay</a> – An AI-driven digital mental health platform offering 24/7 conversational support, mood tracking, and crisis-response guidance via a chatbot interface.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.equoogame.com\" rel=\"noopener noreferrer\">eQuoo</a> – A game-based app that teaches psychological skills to improve emotional fitness and resilience through interactive storytelling.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.happify.com\" rel=\"noopener noreferrer\">Happify</a> – Offers science-based activities and games designed to reduce stress, overcome negative thoughts, and build resilience.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.headspace.com\" rel=\"noopener noreferrer\">Headspace</a> – A meditation and mindfulness app offering guided sessions, sleep aids, and stress-reduction techniques. Backed by clinical research and widely used in workplace wellness programs.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.anxietycanada.com/resources/mindshift-cbt/\" rel=\"noopener noreferrer\">MindShift CBT</a> – Designed to help teens and young adults cope with anxiety using CBT strategies, including relaxation exercises and thought journals.</li>\n</ul>\n<ul>\n<li><a href=\"https://mymoodpath.com/en/\" rel=\"noopener noreferrer\">Moodpath</a> – An interactive mental health journal that helps you reflect on your emotional well-being, screen for symptoms of depression, and access helpful resources. Developed with input from clinical psychologists.</li>\n</ul>\n<ul>\n<li><a href=\"https://nyxo.app\" rel=\"noopener noreferrer\">Nyxo</a> – An open-source sleep tracking and coaching app for iOS and Android. It offers personalized sleep insights and education to help you develop healthier sleep habits.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.ptsd.va.gov/appvid/mobile/ptsdcoach_app.asp\" rel=\"noopener noreferrer\">PTSD Coach</a> – Developed by the U.S. Department of Veterans Affairs, this app provides education about PTSD, self-assessment tools, and resources for managing symptoms.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.quirk.fyi/\" rel=\"noopener noreferrer\">Quirk</a> – A free, open-source CBT app that helps you identify and reframe distorted thoughts. It’s a lightweight, privacy-focused tool designed to help users develop healthier thinking patterns.</li>\n</ul>\n<ul>\n<li><a href=\"https://sanvello.com\" rel=\"noopener noreferrer\">Sanvello</a> – Provides daily tools to manage stress, anxiety, and depression using techniques from cognitive behavioral therapy (CBT), mindfulness, and mood tracking. Includes access to peer communities and therapy options.</li>\n</ul>\n<ul>\n<li><a href=\"https://three-good-things.glitch.me/\" rel=\"noopener noreferrer\">Three Good Things</a> – A simple gratitude journaling app based on positive psychology research. Encourages users to reflect on three positive moments each day to build emotional resilience.</li>\n</ul>\n<ul>\n<li><a href=\"http://wakeupti.me/\" rel=\"noopener noreferrer\">Wake Up Time</a> – A web-based tool that calculates optimal wake-up times based on 90-minute sleep cycles, helping users feel more rested and in sync with natural rhythms.</li>\n</ul>\n<ul>\n<li><a href=\"http://weareanxio.us\" rel=\"noopener noreferrer\">we are ANXIO.us</a> – A thoughtfully curated collection of digital wellness tools, mental health apps, and community resources designed to support people living with anxiety.</li>\n</ul>\n<ul>\n<li><a href=\"https://woebothealth.com\" rel=\"noopener noreferrer\">Woebot</a> – A mental health chatbot that delivers daily emotional support using principles from CBT, helping users track moods and develop coping strategies.</li>\n</ul>\n<ul>\n<li><a href=\"https://writewithwrabit.com\" rel=\"noopener noreferrer\">Wrabit</a> – A writing app designed to help you build a daily journaling habit while contributing anonymously to mental health research.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.wysa.io\" rel=\"noopener noreferrer\">Wysa</a> – An AI-powered chatbot that uses evidence-based techniques like CBT and mindfulness to support users in managing stress, anxiety, and depression.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.youper.ai\" rel=\"noopener noreferrer\">Youper</a> – An AI-powered emotional health assistant that guides you through conversations and activities based on psychological techniques.</li>\n</ul>\n<h3><p>Articles</p>\n</h3><ul>\n<li><a href=\"https://www.elegantthemes.com/blog/editorial/mental-self-care-for-software-developers-and-web-designers\" rel=\"noopener noreferrer\">Mental Self Care For Software Developers And Web Designers</a> - By B.J. Keeton.</li>\n</ul>\n<h3><p>Books</p>\n</h3><ul>\n<li><a href=\"https://www.amazon.com/Brotopia-Breaking-Boys-Club-Silicon-Valley/dp/0735213534\" rel=\"noopener noreferrer\">Brotopia: Breaking Up the Boys’ Club of Silicon Valley</a> - By Emily Chang. A revealing investigation into sexism and exclusion in tech culture—and the toll it takes on women’s mental health.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.amazon.com/Building-Startup-Without-Going-Crazy/dp/946126643X\" rel=\"noopener noreferrer\">Building a Startup Without Going Crazy</a> - By Leen de Bruyne. A set of 100 short lessons from a founder who burned out and recovered, offering advice for staying sane while launching a company.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.amazon.com/Burn-Rate-Launching-Startup-Losing/dp/0593238265\" rel=\"noopener noreferrer\">Burn Rate: Launching a Startup and Losing My Mind</a> - By Andy Dunn. A gripping memoir by the co-founder of Bonobos about living with bipolar disorder while building a startup.</li>\n</ul>\n<ul>\n<li><a href=\"https://developersuccesslab.gitbook.io/code-review-anxiety-workbook/\" rel=\"noopener noreferrer\">Code Review Anxiety Workbook</a> - By Developer Success Lab. A free, research-backed workbook to help developers manage fear, stress, and criticism around code reviews.</li>\n</ul>\n<ul>\n<li><a href=\"https://leanpub.com/developers-and-depression\" rel=\"noopener noreferrer\">Developers and Depression</a> - By Greg Baugues. A candid collection of essays and talks exploring bipolar disorder, ADHD, and mental illness in the developer community.</li>\n</ul>\n<ul>\n<li><a href=\"https://gumroad.com/l/imposter-syndrome\" rel=\"noopener noreferrer\">Imposter Syndrome (No CS Degree)</a> - Compiled by Pete. Insights from over 30 self-taught developers about overcoming imposter syndrome and thriving in the tech world without a computer science degree.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.amazon.com/Doesnt-Have-Be-Crazy-Work/dp/0062874780\" rel=\"noopener noreferrer\">It Doesn’t Have to Be Crazy at Work</a> - By Jason Fried and David Heinemeier Hansson. A manifesto for calm work culture from the Basecamp founders, arguing against hustle culture and burnout.</li>\n</ul>\n<ul>\n<li><a href=\"https://leanpub.com/osmi-guidelines-for-employees\" rel=\"noopener noreferrer\">Mental Health In Tech: Guidelines For Employees</a> - By OSMI. A practical guide for employees navigating mental health at work, covering legal rights, accommodations, and how to advocate for wellness in the workplace.</li>\n</ul>\n<ul>\n<li><a href=\"https://leanpub.com/osmi-guidelines-for-employers\" rel=\"noopener noreferrer\">Mental Health In Tech: Guidelines For Executives And HR Professionals</a> - By OSMI. A resource for company leaders on creating supportive environments, complying with legal obligations, and fostering inclusive mental health policies in tech teams.</li>\n</ul>\n<ul>\n<li><a href=\"https://leanpub.com/osmi-mental-wellness-in-the-workplace\" rel=\"noopener noreferrer\">Mental Health In Tech: Guidelines For Mental Wellness In The Workplace</a> - By OSMI. A comprehensive handbook for building mentally healthy workplaces in tech, covering strategies, policy examples, and case studies.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.amazon.com/Peopleware-Productive-Projects-Teams-3rd/dp/0321934113\" rel=\"noopener noreferrer\">Peopleware: Productive Projects and Teams</a> - By Tom DeMarco and Timothy Lister. An influential text on the human factors of software development, advocating for healthier team environments and better work-life balance.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.amazon.com/Slack-Getting-Burnout-Busywork-Efficiency/dp/0767907698\" rel=\"noopener noreferrer\">Slack: Getting Past Burnout, Busywork, and the Myth of Total Efficiency</a> - By Tom DeMarco. A classic book on the importance of “slack” in developer workflows, highlighting the dangers of overwork and the need for creative space.</li>\n</ul>\n<h3><p>Conferences</p>\n</h3><ul>\n<li><a href=\"https://behavioralhealthtech.com\" rel=\"noopener noreferrer\">Behavioral Health Tech</a> - The leading conference on innovation in behavioral health and technology. Brings together tech companies, healthcare providers, and developers working on mental health platforms and services.</li>\n</ul>\n<ul>\n<li><a href=\"http://mentalhealth.media.mit.edu/\" rel=\"noopener noreferrer\">Computing And Mental Health</a> - A multidisciplinary gathering focused on how digital tools and computing technologies can support and enhance mental well-being. Hosted by the MIT Media Lab.</li>\n</ul>\n<ul>\n<li><a href=\"https://heartifacts.codeandsupply.co/\" rel=\"noopener noreferrer\">Heartifacts</a> - A people-focused tech conference centered around mental health, communication, and inclusion in the software industry. Designed to foster open conversations about burnout, stress, and psychological safety.</li>\n</ul>\n<ul>\n<li><a href=\"https://mhanational.org/annual-conference\" rel=\"noopener noreferrer\">Mental Health America Annual Conference</a> - A broad conference addressing national mental health issues, with tech-related tracks exploring innovation in digital mental health, privacy, and accessibility in mental health tech.</li>\n</ul>\n<h3><p>Meetups</p>\n</h3><ul>\n<li><a href=\"https://www.meetup.com/berlin-mental-health-support-group/\" rel=\"noopener noreferrer\">Berlin Mental Health Support Group</a> - A peer support circle for tech professionals and others navigating mental health challenges. Offers regular “Soundness Check” sessions in a safe, non-judgmental space.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.meetup.com/thought-tech/\" rel=\"noopener noreferrer\">Thought Tech</a> - Based in New York City, this group brings together technologists and innovators to explore the intersection of mental health and tech through open discussions and guest speakers.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.meetup.com/wellness-for-people-in-tech/\" rel=\"noopener noreferrer\">Wellness for People in Tech</a> - A Silicon Valley meetup helping IT professionals manage stress and avoid burnout. Hosts wellness-focused workshops on self-care, work-life balance, and mental resilience.</li>\n</ul>\n<h3><p>Podcasts</p>\n</h3><ul>\n<li><a href=\"https://hanselminutes.com/728\" rel=\"noopener noreferrer\">Destigmatizing Mental Health in the Tech Industry</a> – On Hanselminutes (Ep. 728). Scott Hanselman interviews Dr. Jennifer Akullian about breaking the stigma around therapy, stress, and emotional struggles in the software industry.</li>\n</ul>\n<ul>\n<li><a href=\"http://happyporchradio.com/season-4-episode-3-april-wensel/\" rel=\"noopener noreferrer\">Emotional Intelligence And Ethics In Tech</a> – By April Wensel on the Happy Porch podcast. A conversation about compassionate coding and building emotionally intelligent engineering cultures.</li>\n</ul>\n<ul>\n<li><a href=\"https://anchor.fm/mental-health-in-tech\" rel=\"noopener noreferrer\">Mental Health in Tech</a> – Hosted by Schalk Neethling and Schalk Venter. A monthly podcast sharing real stories from developers about mental health, burnout, vulnerability, and resilience in tech.</li>\n</ul>\n<ul>\n<li><a href=\"https://softskills.audio\" rel=\"noopener noreferrer\">Soft Skills Engineering</a> – Hosted by Jamison Dance and Dave Smith. A humorous advice show for developers tackling topics like burnout, imposter syndrome, performance anxiety, and career balance.</li>\n</ul>\n<ul>\n<li><a href=\"https://devjourney.info/Guests/284-ValarieRegas.html\" rel=\"noopener noreferrer\">Valarie Regas’s Story</a> – On Software Developer’s Journey. A heartfelt episode where Valarie discusses her experience with depression, anxiety, and the need for empathy in tech workplaces.</li>\n</ul>\n",
      "date_published": "2025-05-02T17:49:37.000Z",
      "date_modified": "2025-05-02T17:49:37.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/PatrickJS/awesome-angular/",
      "title": "Awesome Angular",
      "_slug": "PatrickJS/awesome-angular/",
      "_filepath": "/content/PatrickJS/awesome-angular/README.md",
      "url": "https://www.trackawesomelist.com/PatrickJS/awesome-angular/",
      "summary": "4 awesome projects updated",
      "content_text": "\n\n### Blogs / [Google Developer Experts](https://developers.google.com/experts/all/technology/web-technologies)\n\n*   [Code With Omkar](https://www.codewithomkar.com/)\n\n### YouTube Channels / [Google Developer Experts](https://developers.google.com/experts/all/technology/web-technologies)\n\n*   [StartupAngular](https://www.youtube.com/@StartupAngular) - (Japanese)\n*   [Code with Keys](https://www.youtube.com/@codewithkeys) - (Persian)\n\n### Builders / [Google Developer Experts](https://developers.google.com/experts/all/technology/web-technologies)\n\n*   [angular-static-assets-hash (⭐3)](https://github.com/sitelint/angular-static-assets-hash) - Create a list of Angular static assets and a hash for each file.\n\n### Calendars / [Google Developer Experts](https://developers.google.com/experts/all/technology/web-technologies)\n\n*   [ngx-calendar-widget (⭐12)](https://github.com/giacomo/ngx-calendar-widget) - A lightweight, customizable, and feature-rich calendar widget designed to simplify event management and scheduling in your Angular applications.",
      "content_html": "<h3><p>Blogs / <a href=\"https://developers.google.com/experts/all/technology/web-technologies\" rel=\"noopener noreferrer\">Google Developer Experts</a></p>\n</h3><ul>\n<li><a href=\"https://www.codewithomkar.com/\" rel=\"noopener noreferrer\">Code With Omkar</a></li>\n</ul>\n<h3><p>YouTube Channels / <a href=\"https://developers.google.com/experts/all/technology/web-technologies\" rel=\"noopener noreferrer\">Google Developer Experts</a></p>\n</h3><ul>\n<li><a href=\"https://www.youtube.com/@StartupAngular\" rel=\"noopener noreferrer\">StartupAngular</a> - (Japanese)</li>\n</ul>\n<ul>\n<li><a href=\"https://www.youtube.com/@codewithkeys\" rel=\"noopener noreferrer\">Code with Keys</a> - (Persian)</li>\n</ul>\n<h3><p>Builders / <a href=\"https://developers.google.com/experts/all/technology/web-technologies\" rel=\"noopener noreferrer\">Google Developer Experts</a></p>\n</h3><ul>\n<li><a href=\"https://github.com/sitelint/angular-static-assets-hash\" rel=\"noopener noreferrer\">angular-static-assets-hash (⭐3)</a> - Create a list of Angular static assets and a hash for each file.</li>\n</ul>\n<h3><p>Calendars / <a href=\"https://developers.google.com/experts/all/technology/web-technologies\" rel=\"noopener noreferrer\">Google Developer Experts</a></p>\n</h3><ul>\n<li><a href=\"https://github.com/giacomo/ngx-calendar-widget\" rel=\"noopener noreferrer\">ngx-calendar-widget (⭐12)</a> - A lightweight, customizable, and feature-rich calendar widget designed to simplify event management and scheduling in your Angular applications.</li>\n</ul>\n",
      "date_published": "2025-05-02T16:56:46.000Z",
      "date_modified": "2025-05-02T17:10:27.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/ripienaar/free-for-dev/",
      "title": "Free for Dev",
      "_slug": "ripienaar/free-for-dev/",
      "_filepath": "/content/ripienaar/free-for-dev/README.md",
      "url": "https://www.trackawesomelist.com/ripienaar/free-for-dev/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Design and UI\n\n*   [tweakcn](https://tweakcn.com/) — Beautiful themes for shadcn/ui. Customize colors, typography, and more in real-time.",
      "content_html": "<h3><p>Design and UI</p>\n</h3><ul>\n<li><a href=\"https://tweakcn.com/\" rel=\"noopener noreferrer\">tweakcn</a> — Beautiful themes for shadcn/ui. Customize colors, typography, and more in real-time.</li>\n</ul>\n",
      "date_published": "2025-05-02T11:37:46.000Z",
      "date_modified": "2025-05-02T11:37:46.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/gbdev/awesome-gbdev/",
      "title": "Awesome Gbdev",
      "_slug": "gbdev/awesome-gbdev/",
      "_filepath": "/content/gbdev/awesome-gbdev/README.md",
      "url": "https://www.trackawesomelist.com/gbdev/awesome-gbdev/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Game Disassemblies / Syntax highlighting packages\n\n*   [The Jungle Book (⭐4)](https://github.com/not-chciken/jungle-book-gb-disassembly)",
      "content_html": "<h3><p>Game Disassemblies / Syntax highlighting packages</p>\n</h3><ul>\n<li><a href=\"https://github.com/not-chciken/jungle-book-gb-disassembly\" rel=\"noopener noreferrer\">The Jungle Book (⭐4)</a></li>\n</ul>\n",
      "date_published": "2025-05-02T08:03:53.000Z",
      "date_modified": "2025-05-02T08:03:53.000Z"
    }
  ]
}
