{
  "version": "https://jsonfeed.org/version/1",
  "icon": "https://www.trackawesomelist.com/icon.png",
  "favicon": "https://www.trackawesomelist.com/favicon.ico",
  "language": "en",
  "title": "Awesome List Updates on Feb 11, 2021",
  "_site_title": "Track Awesome List",
  "description": "12 awesome lists updated today.",
  "_seo_title": "Awesome List Updates on Feb 11, 2021 - Track Awesome List",
  "feed_url": "https://www.trackawesomelist.com/feed.json",
  "home_page_url": "https://www.trackawesomelist.com",
  "items": [
    {
      "id": "https://www.trackawesomelist.com/ziadoz/awesome-php/",
      "title": "Awesome Php",
      "_slug": "ziadoz/awesome-php/",
      "_filepath": "/content/ziadoz/awesome-php/README.md",
      "url": "https://www.trackawesomelist.com/ziadoz/awesome-php/",
      "summary": "3 awesome projects updated",
      "content_text": "\n\n### Table of Contents / Dependency Management Extras\n\n*   [Composer Patches (⭐1.6k)](https://github.com/cweagans/composer-patches) - A plugin for Composer to apply patches.\n\n### Configuration / PHP Websites\n\n*   [Laravel News](https://laravel-news.com/) - The official Laravel blog.\n*   [PHP Watch](https://php.watch/) - PHP articles, news, upcoming changes, RFCs and more.\n\n### Configuration / PHP Videos\n\n*   [Laravel YouTube Channel](https://www.youtube.com/channel/UCfO2GiQwb-cwJTb1CuRSkwg) - The official Laravel YouTube channel.\n*   [SymfonyCasts](https://symfonycasts.com/) - Screencasts and tutorials about PHP and Symfony.",
      "content_html": "<h3><p>Table of Contents / Dependency Management Extras</p>\n</h3><ul>\n<li><a href=\"https://github.com/cweagans/composer-patches\" rel=\"noopener noreferrer\">Composer Patches (⭐1.6k)</a> - A plugin for Composer to apply patches.</li>\n</ul>\n<h3><p>Configuration / PHP Websites</p>\n</h3><ul>\n<li><a href=\"https://laravel-news.com/\" rel=\"noopener noreferrer\">Laravel News</a> - The official Laravel blog.</li>\n</ul>\n<ul>\n<li><a href=\"https://php.watch/\" rel=\"noopener noreferrer\">PHP Watch</a> - PHP articles, news, upcoming changes, RFCs and more.</li>\n</ul>\n<h3><p>Configuration / PHP Videos</p>\n</h3><ul>\n<li><a href=\"https://www.youtube.com/channel/UCfO2GiQwb-cwJTb1CuRSkwg\" rel=\"noopener noreferrer\">Laravel YouTube Channel</a> - The official Laravel YouTube channel.</li>\n</ul>\n<ul>\n<li><a href=\"https://symfonycasts.com/\" rel=\"noopener noreferrer\">SymfonyCasts</a> - Screencasts and tutorials about PHP and Symfony.</li>\n</ul>\n",
      "date_published": "2021-02-11T23:13:22.000Z",
      "date_modified": "2021-02-11T23:24:42.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/MartinMiles/awesome-sitecore/",
      "title": "Awesome Sitecore",
      "_slug": "MartinMiles/awesome-sitecore/",
      "_filepath": "/content/MartinMiles/awesome-sitecore/README.md",
      "url": "https://www.trackawesomelist.com/MartinMiles/awesome-sitecore/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Forms\n\n*   [WFFM Conversion Tool (⭐11)](https://github.com/afaniuolo/WFFM-Conversion-Tool) - A console application that provides an automated solution to convert and migrate Web Forms For Marketers (WFFM) items and their data to Sitecore Forms.",
      "content_html": "<h3><p>Forms</p>\n</h3><ul>\n<li><a href=\"https://github.com/afaniuolo/WFFM-Conversion-Tool\" rel=\"noopener noreferrer\">WFFM Conversion Tool (⭐11)</a> - A console application that provides an automated solution to convert and migrate Web Forms For Marketers (WFFM) items and their data to Sitecore Forms.</li>\n</ul>\n",
      "date_published": "2021-02-11T22:38:04.000Z",
      "date_modified": "2021-02-11T22:38:04.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/erictleung/awesome-nosql-guides/",
      "title": "Awesome Nosql Guides",
      "_slug": "erictleung/awesome-nosql-guides/",
      "_filepath": "/content/erictleung/awesome-nosql-guides/README.md",
      "url": "https://www.trackawesomelist.com/erictleung/awesome-nosql-guides/",
      "summary": "5 awesome projects updated",
      "content_text": "\n\n### Overview of NoSQL\n\n*   [NoSQL Distilled](https://martinfowler.com/books/nosql.html) - Very digestable and affordable book describing the different NoSQL databases and help you make the decision on whether using a NoSQL database is appropriate for your project.\n*   [NoSQL Databases: a Survey and Decision Guidance (2016)](https://medium.baqend.com/nosql-databases-a-survey-and-decision-guidance-ea7823a822d) - \"This NoSQL Toolbox allows us to derive a simple decision tree to help practitioners and researchers filter potential system candidates based on central application requirements\".\n*   [Data Management in the Cloud: Limitations and Opportunities (PDF)](http://www.cs.umd.edu/~abadi/papers/abadi-cloud-ieee09.pdf) - Abadi (2009) discusses limitations and opportunities of data management and data analysis in the cloud.\n*   [Five Common Data Stores and When to Use Them (2019)](https://shopify.engineering/five-common-data-stores-usage) - Article describes five common data stores (relational database, non-relational (“NoSQL”) database, key-value store, full-text search engine, message queue) and their attributes.\n*   [Comparing Database Types: How Database Types Evolved to Meet Different Needs](https://www.prisma.io/dataguide/intro/comparing-database-types) - Good overview of databases in general and how NoSQL database types differ and can be useful.\n\n### Data Structures and Modeling\n\n*   [Unified Data Modeling for Relational and NoSQL Databases](https://www.infoq.com/articles/unified-data-modeling-for-relational-and-nosql-databases/) - Solution for managing both NoSQL and relational databases using the Unified Data Modeling technique.\n\n### Crowd-Sourced Information\n\n*   [/r/nosql](https://www.reddit.com/r/nosql/) - Reddit page on NoSQL on general questions and discussions people may have about NoSQL databases.\n\n### Graph Databases\n\n*   [Graph Data Modeling Visualize Structure and Meaning](http://www.graphdatamodeling.com) - Brief introduction to graph data modeling and is an introduction to the book \"Graph Data Modeling for NoSQL and SQL\" by Thomas Frisendal.\n\n### Criticisms and Debates\n\n*   [Addressing the NoSQL Criticism (2011)](https://www.bradley-holt.com/2011/07/addressing-the-nosql-criticism/) - Argues against nine criticisms to NoSQL databases as they apply to CouchDB, but may apply to others as well.",
      "content_html": "<h3><p>Overview of NoSQL</p>\n</h3><ul>\n<li><a href=\"https://martinfowler.com/books/nosql.html\" rel=\"noopener noreferrer\">NoSQL Distilled</a> - Very digestable and affordable book describing the different NoSQL databases and help you make the decision on whether using a NoSQL database is appropriate for your project.</li>\n</ul>\n<ul>\n<li><a href=\"https://medium.baqend.com/nosql-databases-a-survey-and-decision-guidance-ea7823a822d\" rel=\"noopener noreferrer\">NoSQL Databases: a Survey and Decision Guidance (2016)</a> - \"This NoSQL Toolbox allows us to derive a simple decision tree to help practitioners and researchers filter potential system candidates based on central application requirements\".</li>\n</ul>\n<ul>\n<li><a href=\"http://www.cs.umd.edu/~abadi/papers/abadi-cloud-ieee09.pdf\" rel=\"noopener noreferrer\">Data Management in the Cloud: Limitations and Opportunities (PDF)</a> - Abadi (2009) discusses limitations and opportunities of data management and data analysis in the cloud.</li>\n</ul>\n<ul>\n<li><a href=\"https://shopify.engineering/five-common-data-stores-usage\" rel=\"noopener noreferrer\">Five Common Data Stores and When to Use Them (2019)</a> - Article describes five common data stores (relational database, non-relational (“NoSQL”) database, key-value store, full-text search engine, message queue) and their attributes.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.prisma.io/dataguide/intro/comparing-database-types\" rel=\"noopener noreferrer\">Comparing Database Types: How Database Types Evolved to Meet Different Needs</a> - Good overview of databases in general and how NoSQL database types differ and can be useful.</li>\n</ul>\n<h3><p>Data Structures and Modeling</p>\n</h3><ul>\n<li><a href=\"https://www.infoq.com/articles/unified-data-modeling-for-relational-and-nosql-databases/\" rel=\"noopener noreferrer\">Unified Data Modeling for Relational and NoSQL Databases</a> - Solution for managing both NoSQL and relational databases using the Unified Data Modeling technique.</li>\n</ul>\n<h3><p>Crowd-Sourced Information</p>\n</h3><ul>\n<li><a href=\"https://www.reddit.com/r/nosql/\" rel=\"noopener noreferrer\">/r/nosql</a> - Reddit page on NoSQL on general questions and discussions people may have about NoSQL databases.</li>\n</ul>\n<h3><p>Graph Databases</p>\n</h3><ul>\n<li><a href=\"http://www.graphdatamodeling.com\" rel=\"noopener noreferrer\">Graph Data Modeling Visualize Structure and Meaning</a> - Brief introduction to graph data modeling and is an introduction to the book \"Graph Data Modeling for NoSQL and SQL\" by Thomas Frisendal.</li>\n</ul>\n<h3><p>Criticisms and Debates</p>\n</h3><ul>\n<li><a href=\"https://www.bradley-holt.com/2011/07/addressing-the-nosql-criticism/\" rel=\"noopener noreferrer\">Addressing the NoSQL Criticism (2011)</a> - Argues against nine criticisms to NoSQL databases as they apply to CouchDB, but may apply to others as well.</li>\n</ul>\n",
      "date_published": "2021-02-11T19:49:08.000Z",
      "date_modified": "2021-02-11T20:01:40.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/ConstructCommunity/awesome-construct/",
      "title": "Awesome Construct",
      "_slug": "ConstructCommunity/awesome-construct/",
      "_filepath": "/content/ConstructCommunity/awesome-construct/README.md",
      "url": "https://www.trackawesomelist.com/ConstructCommunity/awesome-construct/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Made With Construct\n\n*   [Games made with Construct](https://www.madewithconstruct.com/) - A website that list all the games made with the engine.",
      "content_html": "<h3><p>Made With Construct</p>\n</h3><ul>\n<li><a href=\"https://www.madewithconstruct.com/\" rel=\"noopener noreferrer\">Games made with Construct</a> - A website that list all the games made with the engine.</li>\n</ul>\n",
      "date_published": "2021-02-11T16:57:53.000Z",
      "date_modified": "2021-02-11T16:57:53.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/redecentralize/alternative-internet/",
      "title": "Alternative Internet",
      "_slug": "redecentralize/alternative-internet/",
      "_filepath": "/content/redecentralize/alternative-internet/README.md",
      "url": "https://www.trackawesomelist.com/redecentralize/alternative-internet/",
      "summary": "8 awesome projects updated",
      "content_text": "\n\n### Cloud and storage\n\n*   [DAT](https://datproject.org) decentralized file system with live replication\n*   [IPFS](https://ipfs.io) is a new hypermedia distribution protocol, addressed by content and identities. IPFS enables the creation of completely distributed applications. It aims to make the web faster, safer, and more open. IPFS is an open source project developed by the team at Interplanetary Networks and many contributors from the open source community.\n*   [ownCloud](http://www.owncloud.org/) is personal cloud software with a focus on ease of use and syncing, mobile clients and a wide range of applications.\n*   [Perkeep (was Camlistore)](http://perkeep.org/) is your personal storage system for life. It is an acronym for \"Content-Addressable Multi-Layer Indexed Storage\" and could be described as \"Like git for all content in your life\"\n*   [Seafile](http://seafile.com) is a cloud software similar to owncloud, with clients for Windows, Mac, Linux, Android and iOS. Server for Linux and Raspberry Pi.\n*   [Sia](https://sia.tech) is the leading decentralized cloud storage platform. No signups, no servers, no trusted third parties. Sia leverages blockchain technology to create a data storage marketplace that is more robust and more affordable than traditional cloud storage providers. Instead of using a centralized provider, peers on Sia rent storage from each other. Sia itself stores only the storage contracts formed between parties, using a Bitcoin-style blockchain.\n*   [Tahoe-LAFS](https://tahoe-lafs.org) is a Free and Open cloud storage system. It distributes your data across multiple servers. Even if some of the servers fail or are taken over by an attacker, the entire filesystem continues to function correctly, preserving your privacy and security.\n*   [Thali](http://thaliproject.org/) is an open source personal data store that syncs across one or more of your devices, and (selectively, via one or more apps) to one or more more trusted peers. Data store: Couchbase Lite (open source, NoSQL, multi-master sync). Trust model: public key exchange, mutual SSL authentication. Network transport: HTTPS. P2P mechanisms: local/ad-hoc, or Tor (using hidden services).\n\n### Cryptocurrencies and markets\n\n*   [BitCoin](http://bitcoin.org/en/) is a digital currency, a protocol, and a software that enables it. Decentralized crypto-currency\n*   [Bitsquare](https://bitsquare.io) Bitsquare is a decentralized bitcoin exchange. It supports national currencies (fiat) with a variety of payment methods as well as alternative cryptocurrencie\n*   [Ethereum](https://ethereum.org/) is an enhanced cryptocurrency with support for Next-Generation Generalized Smart Contract and Smart Property.\n*   [PeerCoin/PPCoin](http://ppcoin.org/) is the first known cryptocurrency based on an implementation of a combined proof-of-stake/proof-of-work system\n\n### Developer tools and frameworks\n\n*   [jIO](http://www.j-io.org/) is a client-side JavaScript library to manage documents across multiple storages, in a modular way, such as LocalStorage, WebDAV, Amazon S3, you name it.\n*   [Kademlia](http://en.wikipedia.org/wiki/Kademlia) is a distributed hash table for decentralized peer-to-peer computer networks\n*   [OpenDHT (⭐1.1k)](https://github.com/savoirfairelinux/opendht) is a lightweight C++11 Distributed Hash Table implementation offering a clean and powerful distributed map API. It is used by [Ring](https://ring.cx), is able to listen to value changes and adds a cryptography layer.\n*   [Shark](http://sharksystem.net/) is an open source framework for building semantic P2P applications in Java. It facilitates building decentralized application based on the notion of ontologies. The name is an acronym for 'Shared Knowledge'.\n\n### Messaging\n\n*   [cabal](http://cabal.chat) is a distributed chat platform built ontop of dat's foundational technologies. It's like IRC except you have backscroll when you join, and there are no servers. There is currently a [nodejs library (⭐305)](https://github.com/cabal-club/cabal-core), a [terminal client (⭐525)](https://github.com/cabal-club/cabal), a [desktop client (⭐870)](https://github.com/cabal-club/cabal-desktop), and an experimental [mobile client (⭐147)](https://github.com/cabal-club/cabal-mobile).\n*   [Delta Chat](https://delta.chat) is a free software chat application and ecosystem based on IMAP and SMTP, which leverages end-to-end encryption via [autocrypt](https://autocrypt.org/). It piggybacks on top of the huge, already existing email infrastructure. All you need to get started is an email address. There's a client for Android and clients for iOS and desktop in the works. Follow the development on the [GitHub page](https://github.com/deltachat).\n*   [Meshtastic](https://www.meshtastic.org) as an open-source extendable mesh communication and location sharing device.  Based on off-the-shelf $30 modules from various vendors, 8 day battery life. Good for skiers, hikers, protestors, finding lost kids, etc...\n*   [PrivMX WebMail](https://privmx.com) is an alternative private mail system with independent, decentralized PKI and support for end-to-end encrypted web forms.\n*   [RetroShare](http://retroshare.sourceforge.net/) is an open source, decentralised communication platform. It lets you chat and share with friends and family, with a web-of-trust to authenticate peers.\n*   [Scramble](https://dcposch.github.io/scramble/) is easy-to-use, open source encrypted email. Scramble server has no knowledge of the message contents, since encryption is always performed end-to-end on the clients. Public keys are verified using a fedetared trust model based on multiple independent notaries.\n*   [Starkit](http://www.starkitsystems.com/) is a private cloud plug-n-play secure email server for private communication allowing you the benefits of secure email as soon as you turn it on. Bundled with Web-based interface for anywhere access. Apart from a Secure Mail Server You can use Starkit as your Secure Private Cloud storage to save important documents, photos and videos and access your stuff from anywhere. Requires zero maintenance.\n*   [STEED](http://g10code.com/steed.html) is a protocol for opportunistic email encryption, featuring automatic key generation and distribution.\n\n### Networking\n\n*   [Freifunk](http://en.freifunk.net) is a non-commercial initiative for free decentralised wireless mesh networks. Technically Freifunk firmwares are based on [OpenWRT](http://www.openwrt.net) and OLSR or B.A.T.M.A.N.\n*   [Funkfeuer](http://funkfeuer.at/) is, just like Freifunk, a non commercial initiative for free wireless mesh networks. Funkfeuer is based in Austria and uses [OpenWRT](http://www.openwrt.net) as the firmware for the Routers.\n*   [IPOP (IP-over-P2P)](http://ipop-project.org/) is an open-source user-centric software virtual network allowing end users to define and create their own virtual private networks.\n*   [LibreVPN](http://librevpn.org.ar) is a virtual mesh network using [tinc](http://tinc-vpn.org) plus configuration scripts that even let you build your own mesh VPN.  It's also IPv6 enabled.\n*   [Netsukuku](http://netsukuku.freaknet.org) is an ad-hoc network system designed to handle massive numbers of nodes with minimal consumption of CPU and memory resources. It can be used to build a world-wide distributed, fault-tolerant, anonymous, and censorship-immune network, fully independent from the Internet.\n*   [NYC Mesh](https://nycmesh.net/) aims to create a free, resilient, stand-alone communication system that serves both for daily use and also for emergencies—be it power outages or internet disruption—running software that helps our community with hyperlocal maps and events.\n*   [OpenNIC Project](http://www.opennicproject.org/) is an alternative DNS provider that is open and democratic.\n*   [People's Open Network](https://sudoroom.org/wiki/Mesh) is a community mesh network in Oakland, California.\n*   [ZeroNet](https://zeronet.io) enabled decentralized websites using Bitcoin crypto and the BitTorrent network\n\n### Social Networks\n\n*   [Buddycloud](http://buddycloud.com) is built for people who care about their privacy. We are building the future of social networks. A future founded on openness. A future built using open standards. We are making the future happen now, by building a massively scaled and fully distributed social network. Buddycloud is leading a quiet revolution to replace the closed retweet and like incumbents.\n*   [Diaspora\\*](http://diasporaproject.org/) is a free social network consisting of personal web server that implements a distributed social networking service. Diaspora\\* is a fun and creative community that puts you in control.\n*   [Iris](https://iris.to/) is a social networking application that stores everything on its users' devices which communicate directly with each other — no corporate gatekeepers needed.\n*   [Mastodon](https://joinmastodon.org/) is “the world’s largest free, open-source, decentralized microblogging network.”\n*   [Movim](http://movim.eu/) is a decentralized open source social network based on XMPP.\n*   [Patchwork (⭐3.6k)](https://github.com/ssbc/patchwork) is a distributed social network. It uses crytographic keypairs to create feeds and publish unforgeable entries which can spread across the network. Relay servers optionally aggregate and redistribute the feeds.\n*   [Pleroma](https://pleroma.social) is a free, federated social networking server built on open protocols. It is compatible with [GNU Social](https://gnu.io/social/), [Mastodon](https://joinmastodon.org/), and many other ActivityPub implementations.\n*   [PPNet (⭐118)](https://github.com/pixelpark/ppnet) is a middleware that can be used to create a social network, either temporarily or permanently for a group of users. Includes mobile client for Android.\n*   [Scuttlebutt](https://www.scuttlebutt.nz) gossip based p2p community social media, chess, book reviews, gatherings, ... (code [here](https://www.github.com/ssbc))\n*   [Synereo](http://www.synereo.com/) is an open source, decentralized **social network**. It is an **attention economy** that rewards popular content and participation with crypto-currency. Content is promoted or advertised in a way that fairly rewards the content's creator and those who choose to engage with that content. An automatic and transparent **reputation economy** assures that you experience content relevant to you. The privacy of your communications and contacts is baked-in to the structure of the network. Synereo is modeled in [π-calculus](https://en.wikipedia.org/wiki/%CE%A0-calculus) and functionally programmed in Scala.\n*   [Tonika](http://pdos.csail.mit.edu/~petar/5ttt.org/) is a (digital) social network, which (by design) restricts direct communication to pairs of users who are friends, possesses many of the security properties (privacy, anonymity, deniability, resilience to denial-of-service attacks, etc.) that human sociaties implement organically in daily life.\n*   [trsst](http://www.trsst.com/) looks and feels like twitter but encrypted and anonymized and decentralized and only you hold the keys. Protocol implementation draft is available on [github (⭐172)](https://github.com/TrsstProject/trsst).\n*   [Twister](http://twister.net.co) is a secure and fully-decentralized P2P microblogging platform based on concepts and code from Bitcoin and Libtorrent (as described in [this whitepaper](http://arxiv.org/abs/1312.7152)). Feel free to contribute to its [core service (⭐1.4k)](https://github.com/miguelfreitas/twister-core) or [HTML UI (⭐228)](https://github.com/miguelfreitas/twister-html)!\n*   [Vole](http://vole.cc/) is a web-based social network that you use in your browser, without a central server. It's built on the power of Bittorrent, Go and Ember.js. Uses bittorrent sync.\n\n### Telephony\n\n*   [The Serval Project](http://www.servalproject.org/) lets mobile phones make phone calls to each other peer-to-peer without a base station.\n\n### Uncategorised\n\n*   [Smallest Federated Wiki](http://wardcunningham.github.io/) innovates in three ways. It shares through federation, composes by refactoring and wraps data with visualization. The project aims to demonstrate that wiki would have been better had it been effectively federated from the beginning, and explore federation policies necessary to sustain an open creative community.",
      "content_html": "<h3><p>Cloud and storage</p>\n</h3><ul>\n<li><a href=\"https://datproject.org\" rel=\"noopener noreferrer\">DAT</a> decentralized file system with live replication</li>\n</ul>\n<ul>\n<li><a href=\"https://ipfs.io\" rel=\"noopener noreferrer\">IPFS</a> is a new hypermedia distribution protocol, addressed by content and identities. IPFS enables the creation of completely distributed applications. It aims to make the web faster, safer, and more open. IPFS is an open source project developed by the team at Interplanetary Networks and many contributors from the open source community.</li>\n</ul>\n<ul>\n<li><a href=\"http://www.owncloud.org/\" rel=\"noopener noreferrer\">ownCloud</a> is personal cloud software with a focus on ease of use and syncing, mobile clients and a wide range of applications.</li>\n</ul>\n<ul>\n<li><a href=\"http://perkeep.org/\" rel=\"noopener noreferrer\">Perkeep (was Camlistore)</a> is your personal storage system for life. It is an acronym for \"Content-Addressable Multi-Layer Indexed Storage\" and could be described as \"Like git for all content in your life\"</li>\n</ul>\n<ul>\n<li><a href=\"http://seafile.com\" rel=\"noopener noreferrer\">Seafile</a> is a cloud software similar to owncloud, with clients for Windows, Mac, Linux, Android and iOS. Server for Linux and Raspberry Pi.</li>\n</ul>\n<ul>\n<li><a href=\"https://sia.tech\" rel=\"noopener noreferrer\">Sia</a> is the leading decentralized cloud storage platform. No signups, no servers, no trusted third parties. Sia leverages blockchain technology to create a data storage marketplace that is more robust and more affordable than traditional cloud storage providers. Instead of using a centralized provider, peers on Sia rent storage from each other. Sia itself stores only the storage contracts formed between parties, using a Bitcoin-style blockchain.</li>\n</ul>\n<ul>\n<li><a href=\"https://tahoe-lafs.org\" rel=\"noopener noreferrer\">Tahoe-LAFS</a> is a Free and Open cloud storage system. It distributes your data across multiple servers. Even if some of the servers fail or are taken over by an attacker, the entire filesystem continues to function correctly, preserving your privacy and security.</li>\n</ul>\n<ul>\n<li><a href=\"http://thaliproject.org/\" rel=\"noopener noreferrer\">Thali</a> is an open source personal data store that syncs across one or more of your devices, and (selectively, via one or more apps) to one or more more trusted peers. Data store: Couchbase Lite (open source, NoSQL, multi-master sync). Trust model: public key exchange, mutual SSL authentication. Network transport: HTTPS. P2P mechanisms: local/ad-hoc, or Tor (using hidden services).</li>\n</ul>\n<h3><p>Cryptocurrencies and markets</p>\n</h3><ul>\n<li><a href=\"http://bitcoin.org/en/\" rel=\"noopener noreferrer\">BitCoin</a> is a digital currency, a protocol, and a software that enables it. Decentralized crypto-currency</li>\n</ul>\n<ul>\n<li><a href=\"https://bitsquare.io\" rel=\"noopener noreferrer\">Bitsquare</a> Bitsquare is a decentralized bitcoin exchange. It supports national currencies (fiat) with a variety of payment methods as well as alternative cryptocurrencie</li>\n</ul>\n<ul>\n<li><a href=\"https://ethereum.org/\" rel=\"noopener noreferrer\">Ethereum</a> is an enhanced cryptocurrency with support for Next-Generation Generalized Smart Contract and Smart Property.</li>\n</ul>\n<ul>\n<li><a href=\"http://ppcoin.org/\" rel=\"noopener noreferrer\">PeerCoin/PPCoin</a> is the first known cryptocurrency based on an implementation of a combined proof-of-stake/proof-of-work system</li>\n</ul>\n<h3><p>Developer tools and frameworks</p>\n</h3><ul>\n<li><a href=\"http://www.j-io.org/\" rel=\"noopener noreferrer\">jIO</a> is a client-side JavaScript library to manage documents across multiple storages, in a modular way, such as LocalStorage, WebDAV, Amazon S3, you name it.</li>\n</ul>\n<ul>\n<li><a href=\"http://en.wikipedia.org/wiki/Kademlia\" rel=\"noopener noreferrer\">Kademlia</a> is a distributed hash table for decentralized peer-to-peer computer networks</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/savoirfairelinux/opendht\" rel=\"noopener noreferrer\">OpenDHT (⭐1.1k)</a> is a lightweight C++11 Distributed Hash Table implementation offering a clean and powerful distributed map API. It is used by <a href=\"https://ring.cx\" rel=\"noopener noreferrer\">Ring</a>, is able to listen to value changes and adds a cryptography layer.</li>\n</ul>\n<ul>\n<li><a href=\"http://sharksystem.net/\" rel=\"noopener noreferrer\">Shark</a> is an open source framework for building semantic P2P applications in Java. It facilitates building decentralized application based on the notion of ontologies. The name is an acronym for 'Shared Knowledge'.</li>\n</ul>\n<h3><p>Messaging</p>\n</h3><ul>\n<li><a href=\"http://cabal.chat\" rel=\"noopener noreferrer\">cabal</a> is a distributed chat platform built ontop of dat's foundational technologies. It's like IRC except you have backscroll when you join, and there are no servers. There is currently a <a href=\"https://github.com/cabal-club/cabal-core\" rel=\"noopener noreferrer\">nodejs library (⭐305)</a>, a <a href=\"https://github.com/cabal-club/cabal\" rel=\"noopener noreferrer\">terminal client (⭐525)</a>, a <a href=\"https://github.com/cabal-club/cabal-desktop\" rel=\"noopener noreferrer\">desktop client (⭐870)</a>, and an experimental <a href=\"https://github.com/cabal-club/cabal-mobile\" rel=\"noopener noreferrer\">mobile client (⭐147)</a>.</li>\n</ul>\n<ul>\n<li><a href=\"https://delta.chat\" rel=\"noopener noreferrer\">Delta Chat</a> is a free software chat application and ecosystem based on IMAP and SMTP, which leverages end-to-end encryption via <a href=\"https://autocrypt.org/\" rel=\"noopener noreferrer\">autocrypt</a>. It piggybacks on top of the huge, already existing email infrastructure. All you need to get started is an email address. There's a client for Android and clients for iOS and desktop in the works. Follow the development on the <a href=\"https://github.com/deltachat\" rel=\"noopener noreferrer\">GitHub page</a>.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.meshtastic.org\" rel=\"noopener noreferrer\">Meshtastic</a> as an open-source extendable mesh communication and location sharing device.  Based on off-the-shelf $30 modules from various vendors, 8 day battery life. Good for skiers, hikers, protestors, finding lost kids, etc...</li>\n</ul>\n<ul>\n<li><a href=\"https://privmx.com\" rel=\"noopener noreferrer\">PrivMX WebMail</a> is an alternative private mail system with independent, decentralized PKI and support for end-to-end encrypted web forms.</li>\n</ul>\n<ul>\n<li><a href=\"http://retroshare.sourceforge.net/\" rel=\"noopener noreferrer\">RetroShare</a> is an open source, decentralised communication platform. It lets you chat and share with friends and family, with a web-of-trust to authenticate peers.</li>\n</ul>\n<ul>\n<li><a href=\"https://dcposch.github.io/scramble/\" rel=\"noopener noreferrer\">Scramble</a> is easy-to-use, open source encrypted email. Scramble server has no knowledge of the message contents, since encryption is always performed end-to-end on the clients. Public keys are verified using a fedetared trust model based on multiple independent notaries.</li>\n</ul>\n<ul>\n<li><a href=\"http://www.starkitsystems.com/\" rel=\"noopener noreferrer\">Starkit</a> is a private cloud plug-n-play secure email server for private communication allowing you the benefits of secure email as soon as you turn it on. Bundled with Web-based interface for anywhere access. Apart from a Secure Mail Server You can use Starkit as your Secure Private Cloud storage to save important documents, photos and videos and access your stuff from anywhere. Requires zero maintenance.</li>\n</ul>\n<ul>\n<li><a href=\"http://g10code.com/steed.html\" rel=\"noopener noreferrer\">STEED</a> is a protocol for opportunistic email encryption, featuring automatic key generation and distribution.</li>\n</ul>\n<h3><p>Networking</p>\n</h3><ul>\n<li><a href=\"http://en.freifunk.net\" rel=\"noopener noreferrer\">Freifunk</a> is a non-commercial initiative for free decentralised wireless mesh networks. Technically Freifunk firmwares are based on <a href=\"http://www.openwrt.net\" rel=\"noopener noreferrer\">OpenWRT</a> and OLSR or B.A.T.M.A.N.</li>\n</ul>\n<ul>\n<li><a href=\"http://funkfeuer.at/\" rel=\"noopener noreferrer\">Funkfeuer</a> is, just like Freifunk, a non commercial initiative for free wireless mesh networks. Funkfeuer is based in Austria and uses <a href=\"http://www.openwrt.net\" rel=\"noopener noreferrer\">OpenWRT</a> as the firmware for the Routers.</li>\n</ul>\n<ul>\n<li><a href=\"http://ipop-project.org/\" rel=\"noopener noreferrer\">IPOP (IP-over-P2P)</a> is an open-source user-centric software virtual network allowing end users to define and create their own virtual private networks.</li>\n</ul>\n<ul>\n<li><a href=\"http://librevpn.org.ar\" rel=\"noopener noreferrer\">LibreVPN</a> is a virtual mesh network using <a href=\"http://tinc-vpn.org\" rel=\"noopener noreferrer\">tinc</a> plus configuration scripts that even let you build your own mesh VPN.  It's also IPv6 enabled.</li>\n</ul>\n<ul>\n<li><a href=\"http://netsukuku.freaknet.org\" rel=\"noopener noreferrer\">Netsukuku</a> is an ad-hoc network system designed to handle massive numbers of nodes with minimal consumption of CPU and memory resources. It can be used to build a world-wide distributed, fault-tolerant, anonymous, and censorship-immune network, fully independent from the Internet.</li>\n</ul>\n<ul>\n<li><a href=\"https://nycmesh.net/\" rel=\"noopener noreferrer\">NYC Mesh</a> aims to create a free, resilient, stand-alone communication system that serves both for daily use and also for emergencies—be it power outages or internet disruption—running software that helps our community with hyperlocal maps and events.</li>\n</ul>\n<ul>\n<li><a href=\"http://www.opennicproject.org/\" rel=\"noopener noreferrer\">OpenNIC Project</a> is an alternative DNS provider that is open and democratic.</li>\n</ul>\n<ul>\n<li><a href=\"https://sudoroom.org/wiki/Mesh\" rel=\"noopener noreferrer\">People's Open Network</a> is a community mesh network in Oakland, California.</li>\n</ul>\n<ul>\n<li><a href=\"https://zeronet.io\" rel=\"noopener noreferrer\">ZeroNet</a> enabled decentralized websites using Bitcoin crypto and the BitTorrent network</li>\n</ul>\n<h3><p>Social Networks</p>\n</h3><ul>\n<li><a href=\"http://buddycloud.com\" rel=\"noopener noreferrer\">Buddycloud</a> is built for people who care about their privacy. We are building the future of social networks. A future founded on openness. A future built using open standards. We are making the future happen now, by building a massively scaled and fully distributed social network. Buddycloud is leading a quiet revolution to replace the closed retweet and like incumbents.</li>\n</ul>\n<ul>\n<li><a href=\"http://diasporaproject.org/\" rel=\"noopener noreferrer\">Diaspora*</a> is a free social network consisting of personal web server that implements a distributed social networking service. Diaspora* is a fun and creative community that puts you in control.</li>\n</ul>\n<ul>\n<li><a href=\"https://iris.to/\" rel=\"noopener noreferrer\">Iris</a> is a social networking application that stores everything on its users' devices which communicate directly with each other — no corporate gatekeepers needed.</li>\n</ul>\n<ul>\n<li><a href=\"https://joinmastodon.org/\" rel=\"noopener noreferrer\">Mastodon</a> is “the world’s largest free, open-source, decentralized microblogging network.”</li>\n</ul>\n<ul>\n<li><a href=\"http://movim.eu/\" rel=\"noopener noreferrer\">Movim</a> is a decentralized open source social network based on XMPP.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/ssbc/patchwork\" rel=\"noopener noreferrer\">Patchwork (⭐3.6k)</a> is a distributed social network. It uses crytographic keypairs to create feeds and publish unforgeable entries which can spread across the network. Relay servers optionally aggregate and redistribute the feeds.</li>\n</ul>\n<ul>\n<li><a href=\"https://pleroma.social\" rel=\"noopener noreferrer\">Pleroma</a> is a free, federated social networking server built on open protocols. It is compatible with <a href=\"https://gnu.io/social/\" rel=\"noopener noreferrer\">GNU Social</a>, <a href=\"https://joinmastodon.org/\" rel=\"noopener noreferrer\">Mastodon</a>, and many other ActivityPub implementations.</li>\n</ul>\n<ul>\n<li><a href=\"https://github.com/pixelpark/ppnet\" rel=\"noopener noreferrer\">PPNet (⭐118)</a> is a middleware that can be used to create a social network, either temporarily or permanently for a group of users. Includes mobile client for Android.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.scuttlebutt.nz\" rel=\"noopener noreferrer\">Scuttlebutt</a> gossip based p2p community social media, chess, book reviews, gatherings, ... (code <a href=\"https://www.github.com/ssbc\" rel=\"noopener noreferrer\">here</a>)</li>\n</ul>\n<ul>\n<li><a href=\"http://www.synereo.com/\" rel=\"noopener noreferrer\">Synereo</a> is an open source, decentralized <strong>social network</strong>. It is an <strong>attention economy</strong> that rewards popular content and participation with crypto-currency. Content is promoted or advertised in a way that fairly rewards the content's creator and those who choose to engage with that content. An automatic and transparent <strong>reputation economy</strong> assures that you experience content relevant to you. The privacy of your communications and contacts is baked-in to the structure of the network. Synereo is modeled in <a href=\"https://en.wikipedia.org/wiki/%CE%A0-calculus\" rel=\"noopener noreferrer\">π-calculus</a> and functionally programmed in Scala.</li>\n</ul>\n<ul>\n<li><a href=\"http://pdos.csail.mit.edu/~petar/5ttt.org/\" rel=\"noopener noreferrer\">Tonika</a> is a (digital) social network, which (by design) restricts direct communication to pairs of users who are friends, possesses many of the security properties (privacy, anonymity, deniability, resilience to denial-of-service attacks, etc.) that human sociaties implement organically in daily life.</li>\n</ul>\n<ul>\n<li><a href=\"http://www.trsst.com/\" rel=\"noopener noreferrer\">trsst</a> looks and feels like twitter but encrypted and anonymized and decentralized and only you hold the keys. Protocol implementation draft is available on <a href=\"https://github.com/TrsstProject/trsst\" rel=\"noopener noreferrer\">github (⭐172)</a>.</li>\n</ul>\n<ul>\n<li><a href=\"http://twister.net.co\" rel=\"noopener noreferrer\">Twister</a> is a secure and fully-decentralized P2P microblogging platform based on concepts and code from Bitcoin and Libtorrent (as described in <a href=\"http://arxiv.org/abs/1312.7152\" rel=\"noopener noreferrer\">this whitepaper</a>). Feel free to contribute to its <a href=\"https://github.com/miguelfreitas/twister-core\" rel=\"noopener noreferrer\">core service (⭐1.4k)</a> or <a href=\"https://github.com/miguelfreitas/twister-html\" rel=\"noopener noreferrer\">HTML UI (⭐228)</a>!</li>\n</ul>\n<ul>\n<li><a href=\"http://vole.cc/\" rel=\"noopener noreferrer\">Vole</a> is a web-based social network that you use in your browser, without a central server. It's built on the power of Bittorrent, Go and Ember.js. Uses bittorrent sync.</li>\n</ul>\n<h3><p>Telephony</p>\n</h3><ul>\n<li><a href=\"http://www.servalproject.org/\" rel=\"noopener noreferrer\">The Serval Project</a> lets mobile phones make phone calls to each other peer-to-peer without a base station.</li>\n</ul>\n<h3><p>Uncategorised</p>\n</h3><ul>\n<li><a href=\"http://wardcunningham.github.io/\" rel=\"noopener noreferrer\">Smallest Federated Wiki</a> innovates in three ways. It shares through federation, composes by refactoring and wraps data with visualization. The project aims to demonstrate that wiki would have been better had it been effectively federated from the beginning, and explore federation policies necessary to sustain an open creative community.</li>\n</ul>\n",
      "date_published": "2021-02-11T15:19:53.000Z",
      "date_modified": "2021-02-11T15:19:53.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/public-apis/public-apis/",
      "title": "Public Apis",
      "_slug": "public-apis/public-apis/",
      "_filepath": "/content/public-apis/public-apis/README.md",
      "url": "https://www.trackawesomelist.com/public-apis/public-apis/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Social\n\n- API: [4chan (⭐1.1k)](https://github.com/4chan/4chan-API)\n\n  Description: Simple image-based bulletin board dedicated to a variety of topics\n\n  Auth: No\n\n  HTTPS: Yes\n\n  CORS: Yes\n\n",
      "content_html": "<h3><p>Social</p>\n</h3><ul>\n<li><p>API: <a href=\"https://github.com/4chan/4chan-API\" rel=\"noopener noreferrer\">4chan (⭐1.1k)</a></p>\n<p>Description: Simple image-based bulletin board dedicated to a variety of topics</p>\n<p>Auth: No</p>\n<p>HTTPS: Yes</p>\n<p>CORS: Yes</p>\n</li>\n</ul>\n",
      "date_published": "2021-02-11T13:24:15.000Z",
      "date_modified": "2021-02-11T13:24:15.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/jondot/awesome-react-native/",
      "title": "Awesome React Native",
      "_slug": "jondot/awesome-react-native/",
      "_filepath": "/content/jondot/awesome-react-native/README.md",
      "url": "https://www.trackawesomelist.com/jondot/awesome-react-native/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Build & Development / Navigation Demos\n\n*   [react-native-react-bridge (⭐281)](https://github.com/inokawa/react-native-react-bridge) - A toolset to run React web app in React Native and handle communication between them.",
      "content_html": "<h3><p>Build &amp; Development / Navigation Demos</p>\n</h3><ul>\n<li><a href=\"https://github.com/inokawa/react-native-react-bridge\" rel=\"noopener noreferrer\">react-native-react-bridge (⭐281)</a> - A toolset to run React web app in React Native and handle communication between them.</li>\n</ul>\n",
      "date_published": "2021-02-11T10:52:55.000Z",
      "date_modified": "2021-02-11T10:52:55.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/uraimo/awesome-software-patreons/",
      "title": "Awesome Software Patreons",
      "_slug": "uraimo/awesome-software-patreons/",
      "_filepath": "/content/uraimo/awesome-software-patreons/README.md",
      "url": "https://www.trackawesomelist.com/uraimo/awesome-software-patreons/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### People Doing Open Source Work / Hardware related\n\n*   [Bailey Burnsed](https://www.patreon.com/BaileyBurnsed) - FOSS Nerd developing open source games in Godot and Rust",
      "content_html": "<h3><p>People Doing Open Source Work / Hardware related</p>\n</h3><ul>\n<li><a href=\"https://www.patreon.com/BaileyBurnsed\" rel=\"noopener noreferrer\">Bailey Burnsed</a> - FOSS Nerd developing open source games in Godot and Rust</li>\n</ul>\n",
      "date_published": "2021-02-11T10:42:28.000Z",
      "date_modified": "2021-02-11T10:42:28.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/newTendermint/awesome-bigdata/",
      "title": "Awesome Bigdata",
      "_slug": "newTendermint/awesome-bigdata/",
      "_filepath": "/content/newTendermint/awesome-bigdata/README.md",
      "url": "https://www.trackawesomelist.com/newTendermint/awesome-bigdata/",
      "summary": "2 awesome projects updated",
      "content_text": "\n\n### Scheduling\n\n*   [Cronicle (⭐4.6k)](https://github.com/jhuckaby/Cronicle) - Distributed, easy to install, NodeJS based, task scheduler\n\n### Data Visualization\n\n*   [Dash (⭐23k)](https://github.com/plotly/dash) - Analytical Web Apps for Python, R, Julia, and Jupyter. Built on top of plotly, no JS required",
      "content_html": "<h3><p>Scheduling</p>\n</h3><ul>\n<li><a href=\"https://github.com/jhuckaby/Cronicle\" rel=\"noopener noreferrer\">Cronicle (⭐4.6k)</a> - Distributed, easy to install, NodeJS based, task scheduler</li>\n</ul>\n<h3><p>Data Visualization</p>\n</h3><ul>\n<li><a href=\"https://github.com/plotly/dash\" rel=\"noopener noreferrer\">Dash (⭐23k)</a> - Analytical Web Apps for Python, R, Julia, and Jupyter. Built on top of plotly, no JS required</li>\n</ul>\n",
      "date_published": "2021-02-11T10:26:46.000Z",
      "date_modified": "2021-02-11T10:26:46.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/CodyReichert/awesome-cl/",
      "title": "Awesome Cl",
      "_slug": "CodyReichert/awesome-cl/",
      "_filepath": "/content/CodyReichert/awesome-cl/README.md",
      "url": "https://www.trackawesomelist.com/CodyReichert/awesome-cl/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Emacs / Third-party APIs\n\n*   [Emacs4CL (⭐387)](https://github.com/susam/emacs4cl) - A tiny Emacs initialization file to quickly set up vanilla Emacs for Common Lisp programming. Comes with a line-by-line explanation of every line of code in the initialization file.",
      "content_html": "<h3><p>Emacs / Third-party APIs</p>\n</h3><ul>\n<li><a href=\"https://github.com/susam/emacs4cl\" rel=\"noopener noreferrer\">Emacs4CL (⭐387)</a> - A tiny Emacs initialization file to quickly set up vanilla Emacs for Common Lisp programming. Comes with a line-by-line explanation of every line of code in the initialization file.</li>\n</ul>\n",
      "date_published": "2021-02-11T10:20:16.000Z",
      "date_modified": "2021-02-11T10:20:16.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/ildoc/awesome-italy-events/",
      "title": "Awesome Italy Events",
      "_slug": "ildoc/awesome-italy-events/",
      "_filepath": "/content/ildoc/awesome-italy-events/README.md",
      "url": "https://www.trackawesomelist.com/ildoc/awesome-italy-events/",
      "summary": "7 awesome projects updated",
      "content_text": "\n\n### January\n\n*   27-31 - [Global Game Jam](https://globalgamejam.org/) - Multiple locations - Get together and create games in one weekend.\n\n### February\n\n*   11-12 - [Shipping 4.0](https://shipping-40.sharevent.it/) - Online - Technology improvements in shipping sector.\n*   21 - [ServerlessDays 2021](https://rome.serverlessdays.io/) - Rome - Developer-oriented conference about serverless technologies.\n*   24 - [AWS Innovate ML & AI](https://aws.amazon.com/events/aws-innovate/machine-learning/) - Online - AI & Machine Learning with AWS.\n\n### March\n\n*   2-4 - [Microsoft Ignite](https://myignite.microsoft.com/home) - Online - Microsoft annual conference.\n*   11 - [CSSDay 2021](https://2021.cssday.it/) - Online - CSS dedicated conference.\n*   23-25 - [Codemotion Online tech conference 2021](https://events.codemotion.com/conferences/online/2021/online-tech-conference-italian-edition-spring/) - Online - Biggest tech conference in Italy.\n\n### April\n\n*   7-9 - [ITASEC 21](https://itasec.it/) - Online - Cybersecurity italian conference.\n*   15 - [RubyDay 2021](https://2021.rubyday.it/) - Online - Ruby's national conference.\n*   28-30 - [Secsolutionforum](https://www.secsolutionforum.it/) - Online - The digital event for the security industry.\n*   29 - [VueDay 2021](https://2021.vueday.it/) - Online - Vue's national conference.\n\n### May\n\n*   29 - [HackInBo](https://www.hackinbo.it/) - Bologna - Free INFOSEC event.\n\n### September\n\n*   25 - [RomHack](https://www.romhack.io/) - Roma - Cybersecurity convention.\n\n### October\n\n*   27-28 - [ItaliaSec](https://italy.cyberseries.io/) - Milano - This groundbreaking summit is designed for senior security leaders.",
      "content_html": "<h3><p>January</p>\n</h3><ul>\n<li>27-31 - <a href=\"https://globalgamejam.org/\" rel=\"noopener noreferrer\">Global Game Jam</a> - Multiple locations - Get together and create games in one weekend.</li>\n</ul>\n<h3><p>February</p>\n</h3><ul>\n<li>11-12 - <a href=\"https://shipping-40.sharevent.it/\" rel=\"noopener noreferrer\">Shipping 4.0</a> - Online - Technology improvements in shipping sector.</li>\n</ul>\n<ul>\n<li>21 - <a href=\"https://rome.serverlessdays.io/\" rel=\"noopener noreferrer\">ServerlessDays 2021</a> - Rome - Developer-oriented conference about serverless technologies.</li>\n</ul>\n<ul>\n<li>24 - <a href=\"https://aws.amazon.com/events/aws-innovate/machine-learning/\" rel=\"noopener noreferrer\">AWS Innovate ML &amp; AI</a> - Online - AI &amp; Machine Learning with AWS.</li>\n</ul>\n<h3><p>March</p>\n</h3><ul>\n<li>2-4 - <a href=\"https://myignite.microsoft.com/home\" rel=\"noopener noreferrer\">Microsoft Ignite</a> - Online - Microsoft annual conference.</li>\n</ul>\n<ul>\n<li>11 - <a href=\"https://2021.cssday.it/\" rel=\"noopener noreferrer\">CSSDay 2021</a> - Online - CSS dedicated conference.</li>\n</ul>\n<ul>\n<li>23-25 - <a href=\"https://events.codemotion.com/conferences/online/2021/online-tech-conference-italian-edition-spring/\" rel=\"noopener noreferrer\">Codemotion Online tech conference 2021</a> - Online - Biggest tech conference in Italy.</li>\n</ul>\n<h3><p>April</p>\n</h3><ul>\n<li>7-9 - <a href=\"https://itasec.it/\" rel=\"noopener noreferrer\">ITASEC 21</a> - Online - Cybersecurity italian conference.</li>\n</ul>\n<ul>\n<li>15 - <a href=\"https://2021.rubyday.it/\" rel=\"noopener noreferrer\">RubyDay 2021</a> - Online - Ruby's national conference.</li>\n</ul>\n<ul>\n<li>28-30 - <a href=\"https://www.secsolutionforum.it/\" rel=\"noopener noreferrer\">Secsolutionforum</a> - Online - The digital event for the security industry.</li>\n</ul>\n<ul>\n<li>29 - <a href=\"https://2021.vueday.it/\" rel=\"noopener noreferrer\">VueDay 2021</a> - Online - Vue's national conference.</li>\n</ul>\n<h3><p>May</p>\n</h3><ul>\n<li>29 - <a href=\"https://www.hackinbo.it/\" rel=\"noopener noreferrer\">HackInBo</a> - Bologna - Free INFOSEC event.</li>\n</ul>\n<h3><p>September</p>\n</h3><ul>\n<li>25 - <a href=\"https://www.romhack.io/\" rel=\"noopener noreferrer\">RomHack</a> - Roma - Cybersecurity convention.</li>\n</ul>\n<h3><p>October</p>\n</h3><ul>\n<li>27-28 - <a href=\"https://italy.cyberseries.io/\" rel=\"noopener noreferrer\">ItaliaSec</a> - Milano - This groundbreaking summit is designed for senior security leaders.</li>\n</ul>\n",
      "date_published": "2021-02-11T08:40:42.000Z",
      "date_modified": "2021-02-11T11:17:36.000Z"
    },
    {
      "id": "https://www.trackawesomelist.com/DopplerHQ/awesome-interview-questions/",
      "title": "Awesome Interview Questions",
      "_slug": "DopplerHQ/awesome-interview-questions/",
      "_filepath": "/content/DopplerHQ/awesome-interview-questions/README.md",
      "url": "https://www.trackawesomelist.com/DopplerHQ/awesome-interview-questions/",
      "summary": "1 awesome projects updated",
      "content_text": "\n\n### Programming Languages/Frameworks/Platforms / Python\n\n*   [20 Python interview questions and answers](http://www.careerride.com/python-interview-questions.aspx)",
      "content_html": "<h3><p>Programming Languages/Frameworks/Platforms / Python</p>\n</h3><ul>\n<li><a href=\"http://www.careerride.com/python-interview-questions.aspx\" rel=\"noopener noreferrer\">20 Python interview questions and answers</a></li>\n</ul>\n",
      "date_published": "2021-02-11T05:44:31.000Z",
      "date_modified": "2021-02-11T05:44:31.000Z"
    }
  ]
}
